{
    "name": "Tamil Nadu",
    "email": "aarthi9197@gmail.com",
    "phone": "+919360489478",
    "education": [],
    "work_experience": [
        {
            "company_name": "• Up to date with the latest trends and best practices in SEO and SEM",
            "job_title": "• Analyzing clients' initial data in order to understand the client’s infrastructure.",
            "dates_worked": "",
            "additional_info": [
                "• Support client in Goals/KPIs settings.",
                "ACHIEVEMENT",
                "",
                "",
                "• Increased website Traffic by 50% by creating and implementing",
                "an SEO strategy",
                "• Generated a 200% uplift in organic traffic to the website in 6",
                "months",
                "• Created an effective paid Facebook advertising campaign which",
                "generated 5,000 website visits.",
                "• Optimized ad copy, resulting in a higher quality score and a",
                "lower CPC",
                "• Conducted A/B testing on paid Facebook ad campaigns,",
                "boosting conversion by 140%",
                "",
                "",
                "CORE"
            ]
        }
    ],
    "linkedin": "",
    "github": "",
    "projects": "relationships. Developing, implementing & optimizing search engine strategies \nincluding SEO on-page & off-page optimization. \n• Reviewing reports on website rankings and analysis. Monthly reports were sent to clients. \n• A thorough knowledge of SEO (Search Engine Optimization) techniques. The ability to \neffectively handle a search engine marketing (SEM) campaign. \n \n• Working with copywriters and designers to ensure content is informative and appealing. \nForecast sales and production plan. \n• Analyze and monitor the data from Daily report/Monthly Report in term of products  \n• Conduct keyword research and analysis to identify opportunities for improving website \nrankings. \n• Monitor and report on website traffic, rankings, and other key performance \nindicators \n• Identify and resolve technical SEO issues \n• Proven SEM",
    "certifications": null,
    "extra": null,
    "skills": "• SMM \n• Google analytics \n• SEM, Email marketing, SEO on page and off page \n• Social media optimization \n• Facebook and Instagram ads \n• LinkedIn ads \n• Google ads \n• Email marketing \n• Word Press \n• Google Ad Words & PPC \n• Conversion Rate Optimization (CRO) \n• Content Creation \n• Design Skills (Canva, Photoshop, After Effects, InDesign) \n• English: Excellent, Tamil: Native \n• Computer skills: Microsoft Office (Word, Excel, PowerPoint, and \nOutlook) \n• Typing: English 35 words/min, \n \nTRAINING AND SEMINAR \n \n \n• Digital Marketing – Effective Tool for Brand Building” Under Quality \nImprovement Programme- National Level Seminar VIT University \n• Professional Digital Marketing Certificate Program – by 360 Digital Marketing \nAcademy \n• Social Media Marketing - Workshop at VIT University \n• Review of Social Media Management Tools - by 360 Digital Marketing Academy \n• Analysis of Various Social Network Management Systems- by 360 Digital \nMarketing Academy \n \nEXTRA CURRICULAR ACTIVITIES \n \n \n2018 \n-Exemplary Student Award, In Zonal Level Vellore District  \n 2018-2019     -Leader of The Green Environment, SRM University Committee, \n- Team Leader, School Religious Activities."
}