{
    "name": "Vectorworks",
    "email": "aglae12345@yahoo.com",
    "phone": "",
    "education": [
        {
            "university_name": "Broward College",
            "course_name": "",
            "dates_attended": "2020-2022",
            "marks_or_percentage": "",
            "additional_info": [
                "(Florida, USA): 2014 \nEnglish Language Foundation"
            ]
        }
    ],
    "work_experience": null,
    "linkedin": "",
    "github": "",
    "projects": null,
    "certifications": null,
    "extra": null,
    "skills": "• CAD Software: Vectorworks, \nGoogle SketchUp and \nTwinmotion \n \n• Graphics: Adobe Photoshop, \nDaVinci Resolve. \n \n• Programming: Python, \nDjango, Windows Batch. \n \n• Office: Microsoft Word, \nExcel, Calendars, and Emails. \nLanguages \n• Spanish: Mother’s tongue \n• English: Fluent \n \nAglae Rodriguez \n Employment History \nStudio Assistant: Build A Rocket Boy  \nOctober 2022 - Present \nResponsible for a wide range of functions within a busy game studio including event \nmanagement, talent acquisition, interior design for new office spaces, events, and \ninterviews. Frequently pitched, researched, and planned ideas and events to improve the \noffice environment and employee satisfaction or engagement. \n \nFront Desk: Lloyds Bank Group \nApril 2022 – October 2022 \nWorked in a professional office environment. Assisted with event and interview room \nlayouts. Assisted with budgeting, travel arrangements, scheduling meetings, greeting \nvisitors, and writing emails.  \n \nOperative: Newington Library COVID-19 NHS Testing Centre \nAugust 2021 - March 2022 \nWorked in a high-pressure environment. Followed strict health and safety rules whilst \ndelivering clear instructions and protocols for the tester’s delivery. \n \nKitchen Designer: Jonas and James Kitchens (The Range) \nNovember 2020 - December 2020 \nChristmas temporary work in a busy kitchen design environment during the re-opening of \nthe sales floor after the Covid-19 pandemic. Assisted with bathroom and wardrobe sales \ndesigns, created custom-fit spaces within the company’s products and services, managing \nbudget, design trends and requests from the clients."
}