{
    "name": "Anywhere \n \n \nPersonal Details \n \nDate",
    "email": "anupamaojha.cs12@gmail.com",
    "phone": "+919608596033",
    "education": [
        {
            "university_name": "NRI Institute",
            "course_name": "mation science and technology",
            "dates_attended": "May 2019",
            "marks_or_percentage": "80%",
            "additional_info": [
                "of infor, Bhopal - Bhopal, Madhya Pradesh \nR.G.P.V. University, Bhopal  \nMay 2019 to May 2023 \n \n12th in Science (PCM)  \nRajkamal Saraswati Vidya mandir Dhanbad - Dhanbad, Jharkhand \nCBSE Board: 80%  \nMarch 2016 to May 2018  \n \nDiploma In Psychology (Human Behaviour)  \nUniversity of Strathclyde Glasgow (Online Platform) \nAccuracy: 83% Grade: “A \nAugust 2019 to September 2020 \n10th in All subjects  \nSSVM Institutions Dhanbad - Baghmara, West Bengal  \nCBSE Board: 10 CGPA \nApril 2015 to July 2016 \n \nAdditional Information \n \nBachelor in Computer Science with distinction and more than two year of experience as a Data \nAnalyst. Key knowledge in AI/ML, data science and analytics, data structures and algorithms, and \ndata modelling.  \nProficiency in HTML, MySQL, big data (Hadoop), Python. Beginner in MATLAB.  Experienced in \nmanipulating visual hierarchy and automation in prediction algorithms for customer trends.   \nOrganized, top performer, and goal-driven individual with Eight months of experience in working \nwith key stakeholders and communicating between manager and technical levels of an \norganization. Skilled at using data modelling to build a competitive advantage.   \nNew to corporate industry with 1.8 years of experience, can work well under pressure and make the \nbest of any situation. Passionate individual with great interpersonal and communication skills."
            ]
        }
    ],
    "work_experience": [
        {
            "company_name": "Netlink Software Pvt. Ltd - Mandideep, Madhya Pradesh",
            "job_title": "Data Analyst",
            "dates_worked": "Date of Birth: 2020-01-31",
            "additional_info": [
                "give total support to the organization that I work for with all my capabilities that I have and that I'll",
                "learn.",
                "Willing to relocate: Anywhere",
                "Personal Details",
                "Eligible to work in: India",
                "Highest Career Level: 1-2 years' experience",
                "Industry: Software Development (IT)",
                "Total years of experience: 2"
            ]
        },
        {
            "company_name": "SQL, database (vertica), azure, AWS, RDBMs.",
            "job_title": "Trainee Python Developer",
            "dates_worked": "November 2022 to Present",
            "additional_info": [
                "Analytical understanding of data.",
                "Generation of reports, data Modelling, Data Migration, Data Analysis, and manipulation.",
                "Analytical dashboard and functional testing, manual testing.",
                "Dashboard development",
                "Advanced Excel (VLOOKUP, lookup).",
                "Project management, business requirements (BRD) and KPI Mapping documents.",
                "Fresher Interviews, Project Presentation, Client handling etc."
            ]
        },
        {
            "company_name": "Rack AI Pvt. Ltd - Bhopal, Madhya Pradesh",
            "job_title": "In this role, I had to do teamwork with developers to design algorithms and flowcharts.",
            "dates_worked": "March 2022 to October 2022",
            "additional_info": [
                "I was responsible for developing and implementing functional programs in Python language with",
                "its libraries like pandas, NumPy, skit-learn, (keras, TensorFlow)."
            ]
        },
        {
            "company_name": "NRI Institute of Technology - Bhopal, Madhya Pradesh",
            "job_title": "",
            "dates_worked": "July 2021 to December 2021",
            "additional_info": [
                "Along with this, I integrate several software components and third-party modifications in the",
                "existing program are also observed by me.",
                "I had to create technical documentation for reference and reporting.",
                "Data visualization with JustPy",
                "Internship",
                "Project work based on Data Analytics and Visualization.",
                "Skill: SQL, python, data visualization and analytics, excel, Functional testing etc",
                "Interview Preparation, Presentation skills, et",
                "Skills / IT Skills",
                "Communication Skills, Presentations, Client Handling",
                "SQL, Microsoft Excel Advances Analysis skills",
                "Python",
                "Pandas, NumPy, Skit-learn Lib",
                "Django",
                "Rest API, Keras, TensorFlow",
                "Data mining",
                "Communication skills",
                "Tableau, Power BI tools",
                "Machine learning",
                "Natural language processing",
                "Computer vision",
                "Big data, Hadoop",
                "Interview Scheduling, Project Management",
                "Functional testing",
                "Data analytics",
                "Artificial Intelligence",
                "Simple Chatbot",
                "Data analysis skills: Data Modelling, Data Migration",
                "Data Manipulation",
                "Languages",
                "English - Fluent",
                "Hindi - Fluent",
                "Bengali - Fluent",
                "Online Profile",
                "LinkedIn: https://www.linkedin.com/in/anupama-ojha-12b055199"
            ]
        }
    ],
    "linkedin": "https://www.linkedin.com/in/anupama-ojha-12b055199",
    "github": "",
    "projects": "to analyse and categorize text based on sentiment. The goal is to gain insights from data like social \nmedia posts or customer reviews. Steps include data collection, pre-processing, feature extraction, \nmodel training, and evaluation. Success depends on data quality, pre-processing techniques, and \nchoice of algorithms. Applications include social media monitoring, brand management, and market \nresearch. \n \nData Analytics and visualization  \nFebruary 2023 - April 2023  \n(Client- Netlink Software's) \nData visualization is the graphical representation of information and data. By using visual elements \nlike charts, graphs, and maps. \nThe Data analysis and visualization project using Python and JustPy involves using Python and the \nJustPy library to analyse and visualize data. It includes steps like data collection, data preparation, \ndata analysis using libraries like NumPy and Pandas, data visualization using JustPy and other \nvisualization libraries, creating interactive web-based visualizations, and deploying the web \napplication. This project enables the exploration and communication of data insights through \ninteractive and visually appealing web-based visualizations. \n \nWeb Scraping  \nMarch 2022 - September 2022 \n(Client- Rack AI Pvt. Ltd.) \nWeb scraping is a process of automating the extraction of data in an efficient and fast way. With the \nhelp of web scraping.  \nWeb scraping of images involves automatically extracting images from websites developed with \nPython, BeautifulSoup, Scrapy, Selenium, Pillow, Pandas, Requests. It includes steps like identifying \nthe target website, parsing the HTML structure, fetching, and parsing web pages, locating image \nURLs, downloading the images, and optionally performing image processing. The scraped images \ncan be stored and managed for various purposes, such as building datasets or creating image \ngalleries. Legal and ethical considerations should be considered during the process. \n \nCommunication Skills  \nOctober 2020 - Feb 2021 \n(Client- LinkedIn) \n \nIt recognizes successful completion of a comprehensive program designed to enhance and refine \ncommunication abilities. This certificate validates the individual's competence in various aspects of \neffective communication, including verbal and nonverbal communication, active listening, public \nspeaking, interpersonal skills, and conflict resolution.",
    "certifications": "Sentimental Analysis  \nOctober 2022 - Feb 2023 \n(Client- Netlink Software's) \nSentiment analysis",
    "extra": null,
    "skills": "my best to learn new trends and new environmental skills, and if given a chance to work with you, I \nassure you of my level best. I am new to this industry with 2 years of"
}