{
    "name": "Chandigarh",
    "email": "chiragsuthar236@gmail.com",
    "phone": "",
    "education": [],
    "work_experience": [],
    "linkedin": "",
    "github": "",
    "projects": "AWARDS AND ACHIEVEMENTS\nchiragsuthar236@gmail.com | 9265981003\nChirag Suthar\nMay 2021 | Chandigarh, Punjab\nCGPA : 8.02/10\nProficiency\n  C++   C   Python\n  Competitive Programming\n  Garba\n  Cricket, Badminton, Cards\n  Movies, Television Series\nFamiliar:\n  JavaScript   NodeJS   JAVA\nJanuary 2021 - July 2021 | Noida, India\nJuly 2021 - July 2022 | Pune, India\nCGC Technical Campus\nChandigarh Group Of Colleges\n   Time Management\n   Adaptability\n   Accountability",
    "certifications": null,
    "extra": "\n\nTeam Player\nOperating System\nSoftware Engineering\nObject Oriented Programming\nData Structures and Algorithm\nWeb Technologies\nDatabase Management System\nMachine Learning\nArtificial Intelligence\n 2022         Coding Ninjas          Excellence in  C++\n 2022         Hacker Rank            Python\n 2022         Microsoft                  AI Engineering\n 2020         Google                     Operating System - Power User, Cloud\n 2020         ISRO                        Satellite photogrammetry and its Application\n  LinkedIN: chirag26\n   Followers: 5000+\n  HackerRank: chirag_sv            \n   MaxRating: 610 [ master ]\n CodeStudio: Suthar Chirag    \n   Max Rating: 3380 [ Champion ]\nBachelor Of Technology with honors\ninComputer Science & Engineering\nSTRENGTH\nTRAININGS & COURSES\nWe make a smart toilet for swachh bharat abhiyaan in TATA Innovers hackathon at NIT\nDelhi. We create this project for sustainable cleanness of our public toilet and this \nproject is used totally green energy like solar power system. And based on totally \nautomatically so with this concept we also save the energy. The speciality of smart \ntoilet is it's work without any worker with sustainable technology. We use sensors and \narduino to automate the toilet. I was the team leader in this project.\nWe create the online website to provide the platform which is very useful for every \nscience student specially computer science and engineering. It is very helpful to give \nuseful knowledge about various types of hackathon in national institution. It is also \nprovide placement paper and prepared for comparative exam like GATE and NET. \nCODE BLOGGERS - SELECTED FOR ENGINNER'S DAY \nAUTOMATED HYGIENE TOILET - SELECTED IN TOP 10 POSITION \nIN TATA INNOVERSE HACKATHON AT NIT DELHI\n  Secured a position in top 10 for TATA Crucible Hackathon 2019 at NIT Delhi. \n  Complete the CCC+ learning programme with A grade which is organized by all     \n   India Computer Education (AICE). \n  Successfully cleared ISRO Space Quiz which is organized by ISRO.\n  Participation in Ideate for India powered by INTEL.\n  Give my best public speech in paper presentation on engineer's day\nAs a Game developer, I am responsible to make a reskins game with various and latest\nweb technologies for frontend and back-end like HTML, CSS, Javascript, Typescript, \nNodeJS etc. During this period I create a many reskins game for 888 client like \nDr.Jackpot and Mr. wild , chilli con carnival, lepricon rainbow, victory vixens etc.\nworking with various game technology. help to game developers to develop many \ncasino games for foreign clients.\nMade over 800 insertions and 150 deletions to 4 central Firmware repositories in \nless than 3 months. Participated in more than 4 projects per year from initial \nresearch and conceptual design through testing and implementation phases.\nDRC Systems India Limited | Software Engineer\nHCL Engineering and R&D services | Software Engineer\nJuly 2022 - Present | Gift City, Gandhinagar, India\nWorking on Python Rest APIs, Django Frameworks. Working on Goverment \neducation project - National Skill Development Corporation. made some amzing \nEducational web site with OpenEdx and Django Framework. \nIngenuity Gaming Pvt Ltd  | Game Developer",
    "skills": "PROGRAMMING\nPROFILE LINKS"
}