{
    "name": "Opera North",
    "email": "seraphinaayip@gmail.com",
    "phone": "",
    "education": [],
    "work_experience": [
        {
            "company_name": "Consulting and Digital Marketing Project",
            "job_title": "",
            "dates_worked": "Sep 2021 – Dec 2021",
            "additional_info": [
                "Filamentive",
                "Leeds, United Kingdom",
                "3D printing company using sustainable resources only for printing purposes, based in Bradford.",
                "-  Plan, execute digital marketing campaigns for customer acquisition (local SME) across Facebook, Instagram, Actively",
                "reviewed CRM system to re-define target audience, conducted Google Trend research, before creating a customer journey",
                "map, marketing calendar to plan, optimised campaign (e.g. content, keywords, scheduling). Conversion increased 20%.",
                "- Designed, executed B2B email campaign for lead generation, using HubSpot - CRM. Actively draft email calendar, after",
                "extracting data from CRM system. Conduct AB testing, to spot best email copywriting (in terms of open rate, conversion,",
                "bounce rate. Referenced competitors’ best practise for content distribution. Lead generation increased by 20%.",
                "- Advise the founder on tracking environmental improvement by conducting environmental appraisal and internal meetings with",
                "employees via planning, consenting, and executing online, offline surveys. Extract and monitor quantitative, qualitative data to",
                "design sustainable strategies by running environmental threat and opportunity profile analyses. Potential threat reduced to",
                "20%.",
                "- Initiated regular meetings with Founder and requested internal data to create an excel spreadsheet identifying environmental",
                "impact by forecasting, calculating variables, incl. energy consumption, carbon footprint, temperature. Visualised, presented",
                "data to the founder in a report. Implemented environmental impact assessment (EIA) to evaluate potential environmental",
                "impact. Review EIA performance, impact reduced by 15%, supported by environmental scanning.",
                "Sustainability Consulting Project",
                "Feb 2020 – Jun 2021",
                "Opera North",
                "Leeds, United Kingdom",
                "National Opera company and a leading UK arts organisation, based in Leeds.",
                "- Advised client – Opera North on carbon-neutral 2030 strategy by producing supply chain’s environmental impact",
                "reduction analysis. Proposed, EIA planning and evaluated stakeholder engagement with the local council.",
                "Produced environmental statement, brought up staff sustainability awareness by 20%.",
                "- Introduced environment screening and continuous improvement on opera procurement after observing a high",
                "disposal rate on props and costumes. Produced cost & benefit analysis on opera’s 3R strategy proposal by",
                "reusing clothes (visualise cost-saving) and industry research on sustainable fashion (show industry new",
                "standard). Carbon footprint reduced by 20%.",
                "Project Leader",
                "Nov 2019 – Dec 2019",
                "Straw Bale Hotel Project",
                "Leeds, United Kingdom",
                "-Analysed environmental reports on transition network and sustainable regeneration initiatives in Todmorden. Assessed",
                "environmental investigation, planned, and redesigned the local high street to support a low carbon future with the local",
                "community (Incredible edible). Targeted ecological footprint reduced by 10%. Proposed the potential for future sustainable",
                "development by assessing EIA and gaining permission from the local council. Conducted data analysis via the clone town",
                "survey.",
                "Voluntary Work",
                "Committee member, Student Union, TWGHs S.C.Gaw Memorial College.                                       Sep 2015- Sep 2016",
                "Hong Kong",
                "IT SKILLS",
                "Microsoft Office (Excel, PowerPoint, Words), SPSS (Intermediate), NVivo (Beginning),",
                "Google Analytics (Beginning), Canva (Beginning), Hubspot (Intermediate)",
                "Language",
                "English (Fluent), Cantonese (Native), Mandarin (Native)",
                "Ka Wing Yip",
                "201, Switch House East",
                "Circus Road East,",
                "London, SW8 5BN",
                "seraphinaayip@gmail.com",
                "Tel: 07546927848"
            ]
        }
    ],
    "linkedin": "",
    "github": "",
    "projects": null,
    "certifications": null,
    "extra": null,
    "skills": "Evidence-based Consultancy (66%), Research in the Environmental Social Sciences (71%)"
}