{
    "name": "Linux",
    "email": "contactmonika5@gmail.com",
    "phone": "+918554992238",
    "education": [
        {
            "university_name": "KDK College",
            "course_name": "Bachelor",
            "dates_attended": "2020",
            "marks_or_percentage": "",
            "additional_info": [
                "of Engineering, Nagpur\nCompleted 's of Engineering in 2020. \n \nMonika M. Bhute"
            ]
        }
    ],
    "work_experience": [],
    "linkedin": "",
    "github": "",
    "projects": "Technologies : Python, MySQL, AWS \nRole : Python Developer\nDescription: \nAs a Python Backend Developer worked on couple of projects like to write scripts for managing a portal \nfor handling data of new employees and automating the scripts for manual tasks using AWS.\n        \n \nProject : Project and Resources Management Tool\nTechnologies : Python, Flask, MySQL\nRole : Python Developer\nDescription: \n The project is developed for managing projects and resources bandwidth data along with KPI\nCalculations. To maintain records of projects status, resources availability, skillset management, new\nuser management and KPI data. Keep track of all data related to projects and resources.\nRoles and Responsibilities: \n  Developed the application using Flask Framework, which includes Python code. \n  Written backend efficient codes and logic using python. \n  MySQL was the primary database for data storage.\n  Developed RESTful APIs to communicate with frontend ensuring seamless communication.\n  Utilized libraries such as NumPy and Pandas for data manipulation.\n  Postman tool to test and verify the API's functionality ensuring they are reliable and accurate.\n  Understanding the process and interacting with front end team. \n  Worked on Defects and Bugs. \n  Experience working in Agile environments, employing Scrum, Agile or Kanban Frameworks.\n   Modifications in python code to make new enhancements or resolve problems, as per \nclient requirements. \n_____________________________________________________________________________________ \nPROJECT PROFILE \nProject 2: \nProject 1: \nRoles and Responsibilities: \n  Understanding the project requirements and developing/enhancing the code based on the client\nrequirements using Python. \n  Involved in creating modules and models using Python required for the project. \n  Developed python script to automate the manual task of taking data from AWS manipulating it\nand loading again on AWS using S3 buckets.\n  Involved in accessing data from database as demanded for a task. \n  Coordinating with the team to meet the client requirement. \n  Installed & Configured MySQL database Connections. \nPersonal Profile: \nDate of Birth : 29 June 1998\nLanguages Known : English, Hindi, Marathi \nPermanent Address : Nagpur, Maharashtra\nSex : Female \nMarital Status : Single \nNationality : India",
    "certifications": "AWS Certified Cloud Practitioner  by AWS\nSAFe5 Practitioner by Scaled Agile\nPython Certification by Simplilearn\nProject : Multiple",
    "extra": null,
    "skills": "Basic understanding of Front-End Technologies, such as HTML, CSS and Server-Side \nlanguages. \n  Having Strong knowledge in OOPS Concept and Python. \n  Familiarity with MySQL databases and their declarative query languages. \n  Proficient understanding of code Versioning Tools such as Git. \n  Ability to handle multiple tasks and work as in a team Members. \nSKILLS:"
}