{
    "name": "Faym-wall",
    "email": "0822deepakverma@gmail.com",
    "phone": "+917701834592",
    "education": [],
    "work_experience": [
        {
            "company_name": "Grynow Media Pvt. Ltd.(Faym)🔗",
            "job_title": "Remote",
            "dates_worked": "",
            "additional_info": [
                "Software Developer Engineer( Nest.js, Typescript, AWS, Firebase)",
                "May/2022 - Present",
                "●",
                "Developed multiple Faym-wall’s for influencers to boost online presence and engagement.",
                "●",
                "Built a dashboard using Google Analytics APIs to monitor and summarize website clicks and views, enabling effective",
                "measurement of the Faym-walls' impact on achieving influencer goals.",
                "●",
                "Developed and integrated various modules, including order tracking, influencer dashboard, and wallet, while utilizing",
                "third-party APIs like Admitad, Razorpay, and Google Spreadsheet to meet business requirements.",
                "●",
                "Worked closely with the founder to understand product requirements and provided scalable, efficient solutions that",
                "optimized performance. Utilized AWS services such as S3, EC2, and IAM to deploy and host websites and APIs.",
                "Fly0kart🔗",
                "Remote",
                "Fullstack Developer (React.js, Node.js, MongoDB, JavaScript)",
                "Oct/2021 - May/2022",
                "●",
                "Developed and maintained a flight booking portal, fixing existing bugs and adding new features to meet requirements.",
                "Achieved zero errors and a seamless user experience.",
                "●",
                "Managed development and deployment of HRMS, ticketing tool, Zoho, and the official website on various platforms",
                "like Bluehost, Netlify, and Render. Also, performed domain configuration and email service setup for efficient operation.",
                "●",
                "Collaborated closely with the founder, led a team of 7 developers, and interviewed 20+ candidates for respective",
                "roles, gaining valuable"
            ]
        }
    ],
    "linkedin": "",
    "github": "",
    "projects": "MENTOR( Git, Github, MERN stack, Data Structures & Algorithm)\nJune/2021 - June/2022\n●\nMentored 500+ folks at various open-source programs like GWOC’21, GSSoC’22, DevIncept’21 and LGMSoC’21.\n●\nGuided and cleared doubts of 300+ Contributors regarding React.js, Js, HTML, CSS via One-to-One interaction.\n●\nProjects worked with: LearnZania🔗, DevEmpire🔗, EmpowHer🔗 and Awesome-portfolio-websites🔗.\nGet Me Therapy🔗\nHTML, CSS, Bootstrap, Zoho CRM & Javascript\n● Developed User-friendly, Responsive pages i.e. Landing Page, Pricing Page, Client Page and T&C Page from scratch.\n● Integrated Zoho Webforms where the user can put his query, which gets mapped in the Zoho CRM.\n● Worked with Domain Management, WordPress Dashboard and Hosting as well.\nAmazing CSS Projects🔗\nHTML, CSS, Javascript\nImplemented 50 unique projects using Javascript & CSS, gaining practical experience and expertise.",
    "certifications": null,
    "extra": "Ranjan Technologies Pvt. Ltd.🔗\nRemote\nFullStack Developer(HTML, CSS, Javascript, Bootstrap, Node.js, MongoDB)\nSep/2021 - Nov/2021\n●\nCreated user-friendly dashboards for teachers, students, and admins. The new UI streamlined interactions between all\nparties, resulting in improved communication and greater efficiency.\n●\nIntegrated Twilio, Google Maps, AWS storage, and RazorPay APIs for payment and other features, improving the\nfunctionality and usability of the application.\n●\nDeveloped a Node.js-based API for efficient request handling and transaction management between frontend and\nbackend, improving application functionality and performance.\nOPEN-SOURCE &",
    "skills": "●\nLanguages: C++, C, JavaScript, Typescript, Data Structures & Algorithm\n●\nFrontend: React.js, Redux,BootStrap, EJS, HTML, CSS, JQuery, SCSS\n●\nBackend: Nodejs, Mongoose, Express.js, MongoDB, RESTful API, OAuth 2.0, MySQL, Nest.js"
}