{
    "name": "2023/02 - \n \nSenior",
    "email": "talk2dn@yahoo.com",
    "phone": "",
    "education": [],
    "work_experience": [
        {
            "company_name": "https://www.linkedin.com/in/dhritima",
            "job_title": "n-nandi-622522",
            "dates_worked": "",
            "additional_info": []
        }
    ],
    "linkedin": "https://www.linkedin.com/in/dhritima",
    "github": "",
    "projects": "GSK and JPMC \n• Worked as database developer and administrator for \ndifferent requirements \n• Brought down migration completion timeline by 80% \n• Solve issues with special characters in clinical data while \nmigrating to a different database",
    "certifications": "2011-12 \n  \nOracle Certified Professional in Oracle 11g on the PL/SQL \nTrack. \n  \n2019-05 \n  \nHuman Research (Curriculum Group) Data or Specimens Only \nResearch",
    "extra": "• \nGIS based solutions \n• \nAgritech \n• \nDemand Estimation \n• \nEconometrics \n• \nOR \n• \nData Visualization \n• \nCloud data architecture \nInternships  \nOrganization Name: ABInBev \nTitle: Implementation of BLP methodology in Beer Market \nBusiness Problem: The challenge was to do an empirical \ndemand estimation at brand level for a market where only \naggregated sales data was available. \nApproach: We came up with a latent variable (utility from \na brand at a market for a consumer) model and estimated \nthe market share for a set of coefficients. Then we \nestimated the market share and calculated the difference \nwith the market share derived from the data. Then we \nmodeled it as an non-linear minimization problem and used \nGMM to solve the same with iterations until the difference \nreached a pre-defined tolerance value. We also checked \ngradient descent algorithm as another approach to solve the \nminimization problem. \nAlgorithms/Techniques: GMM, Gradient Descent \nalgorithm, 2SLS regression, IV model. \nDuration: Jan 2018-Jun 2018 \n \nOrganization Name: IL&FS Education and Technology \nServices Limited. \nTitle: Investment sensitization using statistical data \nanalysis. \nBusiness Problem: The investors of the organization were \ninterested to know about how to draw statistical inference \non whether company's presence is having any impact in \nhuman life in comparison to the respective district's same \nparameters as benchmark at a reasonably small geography \n(Pin code level in this case). \nApproach: We first came up with a metric to measure the \nsocio-economic condition for an individual and an area (at \nthe pincode level). Then test on population proportion was \nused to test the hypothesis whether the value of the \nmeasure of socio economic condition is higher than the \ndistrict level mean. This method was chosen after careful \nconsideration of other tests as well as non-parametric \nmethods. The sampling distribution was found to follow \nnormal distribution which was in line with using of \nproportionality test. \nAlgorithms/Techniques: Proportionality test, MLR. \nDuration: May 2017-Jul 2017",
    "skills": "Machine Learning \nExcellent \nReinforcement \nLearning \nVery Good \nDeep Learning \nVery Good \nR \nExcellent \nPython \nExcellent \nSQL \nExcellent \nGCP \nVery Good \nAWS \nVery Good \nShell Scripting \nExcellent \nGIS \nVery Good \n \n \nWork History \n \n2023/02 - \n \nSenior Associate – Analytics \nDun & Bradstreet, Mumbai \n• \nDeveloping in-house tech solutions as part of country \ninsight group. \n• \nDeveloping MDA model for automating scores for variou\nentities \n• \nDeveloping model to predict various macro economic \nvariables \n• \nDeveloping satellite based solutions to assess economic \nactivities \n• \nReduced dependencies on manual run for weekly and \nmonthly jobs by automating python scripts \n• \nWorking on large language model for alert and \nnotifications on relevant news articles \n \n  \n2021/11 -\n2023/02 \n  \nManager Analytics \nRPG Enterprises, Mumbai \nProject: HML \n• Decide on algorithms to build models for shoot \ndevelopment and pest prediction/detection based on \nweather and GIS data. The model based approach \nestimates yield improvement by 130% \n• Scout different service providers for satellite images and \nweather data to choose one based on cost and services \noffered \n• Requirement gathering and building solutions to tackle \nvarious problems that plague the century old practices at \ntea plantations \n• Come up with solutions for cloud based data pipeline \narchitecture \n  \n2019/09 – \n2021/11 \n  \nData Scientist II \nGeneral Mills , Mumbai \nProject: Research New Algorithm \n• Come up with LSTM model and fitment of the same as a \nreplacement of the existing approaches. The MAPE was \nimproved from 70% to 92% \n• Develop and deliver content in the space of machine \nlearning for analytic capabilities development \n• Check feasibility of algorithms like Q-learning and SARSA \nas a replacement of the OR based approaches for the \nsupply chain team \nProject: Finance Transformation \n• Come up with a machine learning model to predict financial \nindicators based on external factors only. The monthly \nmodel had MAPE around 84% \n• Assess the effectiveness of the external data source used \nin the project \n• Generate monthly report and explain it to the finance team \nProject: C&F Harmonization \n• Come up with a machine learning model to harmonize text \nbased customer data from various sources about various \nentities \n• Assess various record linkage algorithms to come up with \nthe best fit. The accuracy achieved was 95% \n  \n2019/01 – \n2019/09 \n  \nSenior Data Scientist \nCircle of Life Healthcare Pvt. Ltd., New Delhi \nProject: ZEVAC \n• To develop a product based on clinical data available at a \nhospital that can suggest the proper anti-biotic for a \npatient based on various attributes of the person and the \nsymptoms \n• Come up with a strategy on what model to use based on \nthe data and the inputs from the SMEs \n• Planned and executed go-live as the PoC for the clients \n• Come up with automated testing strategy of the data \nscience codes \n• Come up with a testing strategy for the data science \nmodule and the final product \n• Come up with a set of best practices for the coding and \nensure the same is enforced \n• Come up with a strategy for the data extraction and \nhandling \n• Looking after the patenting process of the product \n• Manage the team of data scientists and do proper resource \nallocation \n  \n2013/05 – \n2016/08 \n  \nSenior Software Engineer \nCGI, Bengaluru \nProject: Shell Horizon H3 \nClient: Royal Dutch Shell \n• Examine and troubleshoot problems as logged in by the \nservice desk to ensure smooth operation of the application \n• To come up with fraud detection model to handle large \nvolume of fraudulent transactions \n• Monitor different components of the application and \ndatabase \n• Proactive tuning of the database to bring down the \nresponse time \n• Maintained information security of the transaction data at \nall times \n• Liaise with the Defect Management Team to take care of \nany defect that has been logged in the system \n• Work closely with the testing team the effectiveness of the \nsolutions provided by the Application vendor to include in \nthe next release \n• Taking care of the deployment process for bug fixes, \nimprovements, and go live for major OUs for the \napplication \n• Taking part in creating and improving support plan for the \napplication \n  \n2008/12 – \n2013/04 \n  \nAssociate  \nCognizant, Pune \n• Worked on various data migration"
}