{
    "name": "Linkedin",
    "email": "sidip333@gmail.com",
    "phone": "",
    "education": [
        {
            "university_name": "Dharmsinh Desai University",
            "course_name": "Bachelor of Technology",
            "dates_attended": "",
            "marks_or_percentage": "",
            "additional_info": [
                "Nadiad, Gujarat\n (IT); CPI: 7.78\nJul 2017 - May 2021\n• Krishna Science School\nRajkot, Gujarat\nHigher Education; Percentage: 91.5\nJun 2015 - Mar 2017"
            ]
        }
    ],
    "work_experience": [
        {
            "company_name": "Pune, Maharashtra",
            "job_title": "Software Developer",
            "dates_worked": "",
            "additional_info": [
                "Aug 2022 - Current",
                "◦ Back-End Development: (Django, MongoDB, AWS)",
                "• Closely worked with co-founders to Implement the Back-end and Logic behind new features.",
                "• Improved product efficiency by reducing time of AI content generation process from 60 sec to 15 sec.",
                "• Integrated Linkedin, Facebook, Instagram, TikTok, Twitter, Google Business, Pinterest for scheduling and publishing AI",
                "generated Post.",
                "◦ Data Analysis: (Pandas, Numpy, MongoCharts)",
                "• Performed Data analysis in day-to-day activity to improve the weak part of the product.",
                "• Experienced in creating and interpreting visualizations and dashboards to extract valuable insights.",
                "◦ Marketing:",
                "• In addition to Technical aspects, has made contributions in marketing, to gain a good number of users.",
                "• Also, Got good understanding of SEO, Email marketing, Ad marketing and Influencer marketing.",
                "• Tata Consultancy Services",
                "Pune, Maharashtra",
                "System Engineer",
                "Jun 2021 - Oct 2022",
                "◦ Real-Time Data Streaming Project: (PySpark, Kafka, Hive, HDFS)",
                "• Performed end-to-end process to convert the Batch-Processed Data (Transactional data) into Real-Time Streaming",
                "using Python, Spark, Kafka, Hive and HDFS.",
                "• As per Stakeholder’s technical requirements, Developed configuration, scripts and packages for different countries and",
                "different sources.",
                "• Additionally, Responsible for creating Solace and Kafka topics and Queues, Ni-Fi Loading, NFR/PT templates etc.",
                "• Performed end-to-end process to convert the Batch-Processed Data (Solved the problems identified by the testing team or",
                "referred them to the appropriate personnel for correction.",
                "• Turabit Solutions Pvt. Ltd",
                "Ahmedabad, Gujarat",
                "AI Intern (Python)",
                "Dec 2020 - May 2021",
                "◦ Task automation using Image detection: (OpenCV, PyAutoGUI)",
                "◦ Generalize Web Scraping: (BeautifulSoup, Selenium)",
                "Academic"
            ]
        }
    ],
    "linkedin": "https://www.linkedin.com/in/dip-sidpara-697855159/",
    "github": "https://github.com/dip333"
}