{
    "name": "Linkedin",
    "email": "sidip333@gmail.com",
    "phone": "",
    "skills": [
        "Summary",
        "Languages: Python, C++, Java",
        "Framework and Technologies: Django, Spark, Kafka, Hive, HDFS",
        "Databases: MongoDB, SQL",
        "Tools: GIT, JIRA, PyCharm",
        "Experience",
        "Predis.ai",
        "Pune, Maharashtra",
        "Software Developer",
        "Aug 2022 - Current",
        "◦ Back-End Development: (Django, MongoDB, AWS)",
        "Closely worked with co-founders to Implement the Back-end and Logic behind new features.",
        "Improved product efficiency by reducing time of AI content generation process from 60 sec to 15 sec.",
        "Integrated Linkedin, Facebook, Instagram, TikTok, Twitter, Google Business, Pinterest for scheduling and publishing AI",
        "generated Post.",
        "◦ Data Analysis: (Pandas, Numpy, MongoCharts)",
        "Performed Data analysis in day-to-day activity to improve the weak part of the product.",
        "Experienced in creating and interpreting visualizations and dashboards to extract valuable insights.",
        "◦ Marketing:",
        "In addition to Technical aspects, has made contributions in marketing, to gain a good number of users.",
        "Also, Got good understanding of SEO, Email marketing, Ad marketing and Influencer marketing.",
        "Tata Consultancy Services",
        "Pune, Maharashtra",
        "System Engineer",
        "Jun 2021 - Oct 2022",
        "◦ Real-Time Data Streaming Project: (PySpark, Kafka, Hive, HDFS)",
        "Performed end-to-end process to convert the Batch-Processed Data (Transactional data) into Real-Time Streaming",
        "using Python, Spark, Kafka, Hive and HDFS.",
        "As per Stakeholder’s technical requirements, Developed configuration, scripts and packages for different countries and",
        "different sources.",
        "Additionally, Responsible for creating Solace and Kafka topics and Queues, Ni-Fi Loading, NFR/PT templates etc.",
        "Performed end-to-end process to convert the Batch-Processed Data (Solved the problems identified by the testing team or",
        "referred them to the appropriate personnel for correction.",
        "Turabit Solutions Pvt. Ltd",
        "Ahmedabad, Gujarat",
        "AI Intern (Python)",
        "Dec 2020 - May 2021",
        "◦ Task automation using Image detection: (OpenCV, PyAutoGUI)",
        "◦ Generalize Web Scraping: (BeautifulSoup, Selenium)",
        "Academic Projects",
        "Text Extraction From Image: (Python, OCRSpace, OpenCV)",
        "◦ This tool is used to extract the text from the image. Initially, In the Pre-processing stage of the tool it’s improving the",
        "image quality, After that in the Processing stage it’s performing text detection/text localization and text binarization, In final",
        "Post-Processing stage it’s performing segmentation and parsing and after that It’ll print text.",
        "◦ Also, This is supporting around 20 languages to detect the text available on the image and is also implemented in a chatbot.",
        "NLP to SQL Tool: (Python, NLTK)",
        "◦ This is an NLP tool to query a database in natural language. The tool takes speech as an input using Python Speech",
        "Recognition, after that it will convert it to a sentence and returns a well-structured SQL query as output using NLTK",
        "library.",
        "◦ Before printing the final Query, the Sentence is processed through different stages like, Tokenization, Escape word remover,",
        "Analyze the tagged tokens and map it to table names and attributes, Filter redundancy and ambiguity check, etc."
    ],
    "education": [
        {
            "university_name": "• Dharmsinh Desai University",
            "course_name": "Nadiad, Gujarat",
            "dates_attended": "",
            "marks_or_percentage": "",
            "additional_info": ""
        },
        {
            "university_name": "Bachelor of Technology (IT); CPI: 7.78",
            "course_name": "Jul 2017",
            "dates_attended": "May 2021",
            "marks_or_percentage": "",
            "additional_info": ""
        },
        {
            "university_name": "• Krishna Science School",
            "course_name": "Rajkot, Gujarat",
            "dates_attended": "",
            "marks_or_percentage": "",
            "additional_info": ""
        },
        {
            "university_name": "Higher Education; Percentage: 91.5",
            "course_name": "Jun 2015",
            "dates_attended": "Mar 2017",
            "marks_or_percentage": "",
            "additional_info": ""
        },
        {
            "university_name": "Skills Summary",
            "course_name": "• Languages: Python, C++, Java",
            "dates_attended": "",
            "marks_or_percentage": "",
            "additional_info": ""
        },
        {
            "university_name": "• Framework and Technologies: Django, Spark, Kafka, Hive, HDFS",
            "course_name": "• Databases: MongoDB, SQL",
            "dates_attended": "",
            "marks_or_percentage": "",
            "additional_info": ""
        },
        {
            "university_name": "• Tools: GIT, JIRA, PyCharm",
            "course_name": "",
            "dates_attended": "",
            "marks_or_percentage": "",
            "additional_info": ""
        }
    ],
    "work_experience": [],
    "linkedin": "https://www.linkedin.com/in/dip-sidpara-697855159/",
    "github": "https://github.com/dip333"
}