{
    "name": "Faris Khan",
    "email": "faris.khan456@gmail.com",
    "phone": "",
    "education": [],
    "work_experience": [],
    "linkedin": "",
    "github": "",
    "projects": null,
    "certifications": null,
    "extra": null,
    "skills": "Excellent communication and interpersonal skills, with the ability to build and \nmaintain relationships with stakeholders from diverse backgrounds\nDetail-oriented with a focus on accuracy and precision in project management\nStrong analytical and problem-solving skills, with the ability to analyze complex data \nand identify actionable insights\nCreative and innovative mindset, with a passion for exploring new ideas and \napproaches in business and marketing.\nMumbai\nBachelor \nMumbai university \nMumbai\nBusiness management\nMumbai university\nBachelor's degree in Business Management with a specialization in Marketing\nStudies in Logistics, Traditional Marketing, and Digital Marketing\nFinance studies in Investing and Money Management\nSkills and Abilities:\nExpertise in Marketing strategies, including traditional and digital marketing \ntechniques, to promote business growth and increase brand awareness\nProficient in logistics and supply chain management to ensure efficient and cost-\neffective operations\nStrong financial acumen in investing and money management to make informed \nbusiness decisions\nExcellent communication and interpersonal skills, with the ability to build and \nmaintain strong relationships with clients, colleagues, and stakeholders\nResults-driven mindset, with a focus on achieving targets and meeting deadlines\nWith this entry, you highlight your education, relevant studies, and key skills and \nabilities that you can bring to the table. This can help potential employers quickly \nunderstand your background and what you can offer to their organization.\nFaris Khan\nfaris.khan456@gmail.com\n1 / 2\nSKILLS\nMarketing and investment\nExceptional marketing skills with a creative \nmindset, capable of developing highly effective \nmarketing campaigns for products and companies \nStrong ability to understand and analyze products \nand companies quickly, enabling the development \nof tailored marketing strategies \nProficient in crafting compelling written content for \nmarketing campaigns, leveraging skills honed \nduring studies and recognized success in global \nstrategy \nSolid understanding of business principles gained \nthrough a Bachelor's degree in Business and a \nMaster's degree in International Business \nManagement \nKeen aptitude for researching and analyzing \ncompanies, demonstrated by identifying 25 high-\npotential stocks in 2020, with approximately 20 \nalready exceeding 600 percent growth\nFaris Khan\nfaris.khan456@gmail.com\n2 / 2"
}