{
    "name": "Skimage",
    "email": "himanshu.dobhal24@gmail.com",
    "phone": "+917760516408",
    "education": null,
    "work_experience": [],
    "linkedin": "",
    "github": "https://github.com/himanshudobhal",
    "projects": "Processing and Representation pipelines to design, analysis and engineering workflows for real world problems  \n  \nAnalysing patient anatomy through X-ray & visual the moment on dashboard using contour from reference image to target image  \n  \nDesigning/developing computer vision or deep learning AI object detection/ classification of light on/off condition inside X-ray room \nusing live streaming videos  \n  \nCollaborating with architecture, research, libraries, software engineers, data engineers, designers, program management, and quality \nassurance to ensure prototypes and solutions are delivered efficiently and effectively  \n  \nBuilding application for auto calibration for X-ray machine using depth camera by estimating pose of different receptor type  \n  \nParticipating in computer vision and deep learning-based model using Open vino (Intel SDK for deep learning) for inferencing in \nEmbedded System  \n  \nResponsible for development of automated testing to measure quantitative impact of company's core technology on subsequent \ncomputer vision processing.  \n  \nJan 2017 - July 2019  \nConsultant | Vee Technologies, India  \n  \nDrive improvements to our core vision engine that models the 3D environment from 2D images  \n  \nApplied image processing techniques for running an incubator center (AIML R&D lab) in Sona College of Engineering with \ncollaboration of VEE technologies  \n  \nPerformed research and developed computer vision solutions/models for estimating decaying time of fruits and vegetables using \nhyperspectral images  \n  \nImplemented deep learning method of classification, segmentation and anomaly detection for grain identification  \n  \nSpearheaded the team of 20 members to enhance Research Associates, undergraduate/postgraduate students in Incubator center  \n  \nInvolved in live product development for Grain type identification and quality of grains using images  \n  \nTechnical approach to develop applications for Face Recognition & Verification of proctored exam HIREMEE APP and deployed in \nAWS server  \nSep 2016 - Jan 2017  \nSenior Software Engineer | LEECO India Pvt. Ltd  \n  \nStay up to date with the latest research in computer vision and machine learning as applied to the problem resolution  \n  \nDeveloped/deployed high-quality unit-tested, production photogrammetry software and POC for recommender system  \n  \nCollaborated closely with team members to solve tough computer vision problems and automated quality assessment  \n  \nWorked with engineering, design, operations and marketing other teams to optimize/execute our commercial software deployment  \n  \nMaintained high level of communications with the software development team and application engineers to enable progress of \nmultiple projects and products  \n  \nDeveloped quality software for mission critical industrial applications optimized to be deployed on high performance platforms  \n  \nProvided image processing/Machine Learning software for quality inspection  \nMar 2013 - Sep 2016  \nSenior Software Engineer | Bosch India & Germany  \n  \nDriven significant improvements in speed and quality from conception to production rollout and ongoing support  \n  \nManaged computer vision tasks such as image search, image segmentation, depth estimation, object detection, image editing, pose \nestimation, and generative image editing using  \n  \nResponsible for creation of Image based ego motion (pitch and roll rate) estimation using stereo camera  \n  \nCarried out Optical flow vector generation and Image harmonization of stitched images for near range camera  \n  \nInvolved in Image enhancement for dashboard screen in the car (brightness and contrast)  \n  \nCoordinated with image quality testing engineers to optimize image quality and algorithm performance across a wide range of \nenvironmental conditions  \n  \nDeveloped & maintained end to end algorithm models for multi-camera imagers  \n  \nResearch/implemented algorithms for image transformations with an eye towards performance and compression  \n  \nAssisted in development of the image processing space including image formats, computer vision, and new software  \n  \nP R I O R H I S T O R Y  \n  \nOct 2012 - Mar 2013 | Consultant | Sony India Pvt. Ltd  \nFeb 2011 - Oct 2012 | Software Engineer | ASDLABS, India  \n  \nE D U C A T I O N A L B A C K G R O U N D  \n  \n 2019  \nPost Graduate Program in Artificial intelligence & Machine Learning | The Great Lakes Institute of Management, India  \n 2011  \nMaster of Science in Embedded and Control System | University of Leicester, Leicester, England  \n 2009  \nBachelor of Technology in Electronic & Communication | University of Rajasthan, India",
    "certifications": null,
    "extra": null,
    "skills": "\nKeras, PyTorch, etc.  \n  \nSkill Sets:  Research & Development | Generative AI | LLM | NLP | | Time Series | Computer Vision | Visual SLAM | 3D reconstruction | 3D \nGeometry | Image processing | Machine Learning | Deep Learning | Artificial Intelligence | Software Development | Python/C++ | Generative \nAdversarial Network VAE | Multiple rnel Learning | Auto Calibration | Image Enhancement | Object Recognition & Tracking | Face \nRecognition | Detection/Classification | Project & Team Management  \n  \nTechnical Skills: Languages- Python, C++, Matlab | Machine Learning- Scikit-learn, StatsModels | Deep Learning- Tensorflow, Keras,  \nPyTorch | LLM - OPEN AI, LangChain GPT 3.5 and 4 | Embedded Systems- Open vino | CV packages- Opencv, Skimage, Matlab toolkit | \nScripting Languages- Perl, Bash shell |  \nPlotting- Matplotlib, ggplot2 & Seaborn | Version Control Systems- Git, SVN | Operating System- Linux (Ubuntu, CentOS, Fedora), \nWindows  \n  \nE M P L O Y M E N T H I S T O R Y  \nJan 2023 - Present \nPrincipal Data Scientist | Asper.ai  \n  \nImplementing large language models (LLMs) across various turnkey products to enhance natural language processing \ncapabilities and drive intelligent decision-making.  \n  \nLLM implementation to analyze statical data and query the database. (SQL , pandas data frame) \n  \nLeveraging time series analysis techniques to provide accurate forecasting solutions in the Consumer Packaged Goods (CPG) \ndomain ( XGboost, CNN-LSTM, Wave net, ,Transformer time series) \n  \nPassionate about integrating cutting-edge technologies to optimize business processes and deliver tangible value to clients \n \n  \n \n  \n  \n  \nHIMA   N   S   HU   D   O   BHA   L   \n \nJune 2021 - Nov 2022 \nSolution Architect | Tooliqa Innovations India  \n  \nImplemented Sensor Fusion to get precious visual odometry for an indoor area (Sensor used:- lidar, RGB and IMU)  \n  \nReduced extrinsic metric error using the ICP algorithm in frame-frame or frame-map while having depth error in lidar frame data.   \n  \nData optimization on point cloud has been done using the octree data structure for high performance in calculation   \n  \nBIM structure has been formed using the basic structure shape (plane, cylinder and sphere) on the point cloud.   \n  \nDeep learning model (Yolo7, NERF,Efficient net) used for conversion of 2D to 3D and segmentation of 3D object from environment.   \n  \nComputed Camera Calibration for Converting depth image to Point cloud.  \n \nJul 2019 - May 2021  \nSr. Software Engineer | GE Healthcare, India  \n  \nFocusing on research and development of computer vision and machine learning algorithms related to object recognition, image \nenhancement, detection/classification, and identification/segmentation of human anatomy  \n  \nActively participate in challenging software research"
}