{
    "name": "Kenya Certificate",
    "email": "irenewaithera93@gmail.com",
    "phone": "+254711339315",
    "education": [
        {
            "university_name": "University",
            "course_name": "Marketing",
            "dates_attended": "2018",
            "marks_or_percentage": "",
            "additional_info": [
                "of Nairobi; 2018. \n \nKenya Certificate of Secondary Education: Buruburu Girls Secondary School; 2011. \nPROFESSIONAL COURSES \n \nProfessional in Digital : (CIM) – Ongoing. \n \nCertificate in Quick Books: Institute of Advanced Technology; 2017. \n \nCertified Public Accountant, Section 1: KASNEB"
            ]
        }
    ],
    "work_experience": null,
    "linkedin": "",
    "github": "",
    "projects": null,
    "certifications": null,
    "extra": " \nAdaptability and Flexibility \n \nMulti-tasking and time management skills \n \nAn enthusiastic team player \n \nNetworking \n \nSales and Marketing  \n \nCreating brand awareness \n \nSegmentation, positioning and targeting \n \nInformation Technology (IT)  \n \nVideo editing skills using Adobe Premiere Pro  \n \nPhoto editing and poster creation skills using Canva \n \nSecretarial Skills \n \nERP specifically Quick Books and Oracle \n \nPlanning and Organizing skills \n \nProficiency in general office software that is, Microsoft Word, Excel and Power Point \nWORK HISTORY \nInternal Audit Assistant \nPublic Sector Accounting Standards Board; April 2022 – To Date \nDuties, Responsibilities and Achievements \n \nProof reading assigned documents to be sent out or utilized internally in terms of context, grammar and \nspelling mistakes. \n \nCreating a stakeholder engagement database of all Semi-Autonomous Government Agencies, Ministries and \nState departments, Commissions, Funds, Public Universities and Tertiary learning institutions to be utilized \ninternally.  \n \nCommunicating with above mentioned stakeholders on various engagement workshops through emails, \nphone calls and conferences. \n \nSupport staff for the Head of Internal Audit and Accounting Officer for Internal Audits conducted. \n \nAssisting stakeholders, for example National Museum of Kenya streamline their Internal Audit Manuals and \nprocesses. \n2 \n \n \nCreating power point presentations for assigned topics. \n \nFilming and editing videos for the PR department depending on the managers’ specifications. \n \nConducting stock take with the Procurement department as assigned by the procurement manager. \n \nReception desk tasks, that is receiving calls, letters and giving feedback to external individuals who need \nassistance and clarifications from internal staff. \n \nScreening applications for various PSASB job applicants. \nAssistant Accountant; Accounts Payable, Finance Department \nKenya Airways; April 2019 to January 2021 \nDuties, Responsibilities and Achievements \n \nReceiving and establishing compliance of invoices from KQ Commercial stores and suppliers.  \n \nMatching received invoices to their respective LPO’s and GRN’s. \n \nPresenting posted invoices for payment processing to various approvers. \n \nFollowing up and ensuring resolve for invoices with issues.  \n \nEnsuring payments are made on time and as per terms date. \n \nAccruing for expenses not reported in the previous month. \n \nPassing Journals to correct various misposted costs. \n \nSupplier statement reconciliations in every payment submitted. \n \nPlanning and coordination of department functions and work related events such as department parties, \nburials and any other event as assigned. \nIntern, Finance Department \nKenya Airways; November 2018 to March 2019 \nDuties, Responsibilities and Achievements \n \nReceiving invoices from stores at Kenya Airways and suppliers. \n \nEnsuring invoices are compliant with KQ finance policies. \n \nPosting invoices to ERP and matching them to various purchase orders. \n \nWorking with suppliers to acquire statements and required invoices. \n \nPaying various KQ vendors and ensuring payments are up to date. \n \nAccruing for expenses not reported during the required financial period. \n \nPAST ENGAGEMENTS AND PROFESIONAL TRAINING \nA. Content Creator for my YouTube, Instagram and Facebook from January 2021 to December 2021. \nDuties, Responsibilities and Achievements include: \n \nBrainstorming and coming up with content ideas. \n \nFilming the content. \n \nEditing and thorough polishing of footage using Adobe Premiere Pro. \n \nUploading of content on the various social media platforms. \n \nAnalysis of content engagement and feedback which leads to finding ways of improving quality of content. \n \nPhotography, ensuring lighting and aesthetics are good leading to good quality photos. \n \nCuration of appealing YouTube thumbnails and Instagram posters. \n \nB. Ran an Online Organic Hair Care Line and a Second-hand Clothes Dealership in partnership with \nsome friends from 2017-2018. Duties, Responsibilities and Achievements include: \n \nSourcing for cheaper quality raw materials. \n \nBatch Recording.  \n \nRunning of an Online Thrift Store on Facebook and Instagram.  \n \nPurchasing of stocks. \n \nWashing and repairing the clothes if need be. \n \nTaking orders and making deliveries. \n \nCommunicating with my partners about any relevant updates or activities relating to the online stores. \n \nConducting photoshoots for purposes of modelling the outfits. \n \nC. Outward Bound Trust Kenya: Team Building Training; 2022. \n \nACHIEVEMENTS \n \nIncreased stakeholder engagement by 65%. \n3 \n \n \nSuccessful market research, implementation and execution of marketing plans and strategy by 79%. \n \nTriumphed in the reduction of Vendor Statement balances by 60%. This was done by ensuring timely \npayments as per credit terms and resolve of multiple invoices with issues. \n \nSuccessfully coordinated supervision of a KQ Intern, liaising with the departmental head to ensure \ncompliance with ERP, finance and general company policies. \n \nSuccessful planning of social and corporate events such as the Launch of the Public Sector Accounting \nStandards Board strategic plan. \n \nSuccessfully launched and ran a YouTube Channel, Instagram and Facebook Accounts. Managed to gain \n207 subscribers on YouTube which amassed 13,151 views, Instagram followers increased by 3000, that is \nfrom 2500 to 5587 and I gained 1200 Facebook followers in a span of 6 months. \n \n60% reduction of invoices with issues due to vigilant follow-ups for resolve working hand in hand with the \nprocurement department. \n \nStakeholder database development has improved PSASB connections with the public sector by 75% and \nraised awareness of the necessity of the board's existence. \n \n100% success in planning and coordination of office parties and events. \n \nPROFESSIONAL MEMBERSHIP \n \nRegistered Member of the Chartered Institute of Marketing (CIM) \n \nPERSONAL INTERESTS \n● \nPuzzles and Crosswords \n● \nReading \n● \nPhysical Exercise \n \n \nREFEREES \nBonny L’souza \nMarketing Consultant/Tutor \nSimon Page College of Marketing \nEmail: bonny@simonpage.ac.ke  \nTel: +254 723 626 471 \n \nDennis Lore \nAssistant Accountant Credit \nControl \nKenya Airways \nEmail: dennis.lore@kenya-\nairways.com \nTel:  +254 741 777 217 \nCPA - Gilbert Ngeno \nPrincipal Officer Internal Audit \nPublic Sector Accounting Standards \nBoard (PSASB) \nEmail: gilbertngeno63@gmail.com \nTel:  +254 722 473 846",
    "skills": " \nCustomer Service  \n \nCommunication and Interpersonal skills \n \nMarket Research and Analysis \n"
}