{
    "name": "Jennifer Wong",
    "email": "jenniferwong138@hotmail.co.uk",
    "phone": "+447783808456",
    "education": [
        {
            "university_name": "2023                    University",
            "course_name": "BA Business Management with a Year Abroad",
            "dates_attended": "2019 - 2023",
            "marks_or_percentage": "",
            "additional_info": [
                "East Anglia, Norwich \n                                          \n                                      - Projected First Class \n                                      - Coursework: Principles of Marketing, Digital Marketing and The Service              \n                                        Economy, Shopper Marketing, Strategic Brand Management, International Business \n                             \n2021-"
            ]
        },
        {
            "university_name": "2022                      Hankuk University",
            "course_name": "Media Industry",
            "dates_attended": "2021-2022",
            "marks_or_percentage": "",
            "additional_info": [
                "of Foreign Studies, South Korea (Study abroad) \n                                       - Achieved 4.0 GPA \n                                       - Coursework: Korean , Understanding Korean Chaebol Enterprises \n                                       - Presentations: Marketing Management, New Product & Innovation Strategy,                        \n                                         Principles of Business Management \n2017 - 2019 \n             Copleston Sixth Form, Ipswich \n \n \n \n- A-levels: English Language (B), Business (B) and Psychology (B) \n2013 - 2017 \n \nCopleston High School, Ipswich \n \n \n \n- GCSEs: two A* (English Language and Literature), four As, two Bs, three Cs \nComputing  \nMicrosoft Office: Word, Excel & PowerPoint – Intermediate \nLanguages \nEnglish (Native), Cantonese Chinese (Conversational speaker), Korean (Basic) \nRelevant Experience \nSeptember - January 2023                                     Management Consulting Project - University East Anglia \n-\nMarketing strategy; analysed a CRM company's presence on Instagram, Twitter, LinkedIn and \nFacebook.\n-\nCompetitor benchmarking; - curated a table to identify key rivals such as market leader, Salesforce, \nand their competitive advantages. \n-\nCreative design;  created an improved mock-up website for the client, including important features \nsuch as a live chat box, free trial and price listing (drive website trafﬁc and increase sales conversion).\nSeptember 2021- June 2022                                                                                   Study Abroad - South Korea  \n-\nLocal collaboration; presented a marketing plan for a Korean company as a group. Learned to listen \nand communicate with both Korean and International students, understanding cultural differences and \nbeing open to contrasting opinions, overcoming disagreements. \n-\nResearch and analysis skills; prepared a paper which analysed the external environment of the aviation \nindustry and presented this to fellow class members and the professor.  \n-\nGlobal marketing; observed Korean marketing campaigns e.g. celebrity endorsements appealing to \nyoung teens/adults for industries such as beauty, fast food, mobile phone providers, etc. \n-\nOrganisation; meticulously prepared for my year abroad by sorting multiple documents, budgeting and \ntime managing. Demonstrated initiative and determination throughout the process despite COVID-19.  \n-\nLanguage exchange; contributed to a GAT ('Give and Take’) program. Rewarded with a Level 2 \ncertificate for completing an Introductory Korean Course. \nDecember 2017 – 2020           Chinese Food Takeaway, Ipswich – Front House Customer Service Assistant  \n-\nCustomer engagement; direct responsibility in taking face-to-face/telephone orders, and assisted \ncustomers with specific attention to customer preferences and dietary requirements, whilst providing \nappropriate alternatives based on this.  \n-\nConflict resolution; the ability to offer quick yet effective solutions when customers were not satisfied.     \n-\nInterpersonal skills; relayed queries, recommendations or complaints from customers to kitchen staff \nusing Cantonese and English.  \n-\nEfficiency; worked diligently in a fast-paced environment as a team of 8+ people.  \nVolunteering \n2017 – 2019                                     Anglo-Chinese Cultural Exchange, Ipswich – Performing Artist  & staff \n-\nProfessionalism; annually performed/choreographed various acts for my local Chinese Community \nNew Year showcases with 100+ attendees including important guests (Ipswich Mayor and MP).  \n-\nEvent assistant and management; volunteered at Multicultural festivals and celebrations, helping in \nmaintaining merchandise stalls. Also assisted backstage and organised rehearsals.  \nNovember 2021                                                                               Instagram Takeover Project - South Korea     \n-\nContent creator; edited my own images taken during my study abroad to create engaging Instagram \nStories/Highlights on my University’s Instagram page.  \n-\nEngagement; set up a Q&A session where I answered students’ questions regarding my year abroad \nexperience and provided relevant advice/opinion. Responded to queries through DMs and email.  \nHobbies & Interests \nI am a new UGC creator on Tiktok with 700+ followers and love creating content for a variety of niches \nincluding skincare, fashion, travel and lifestyle. I take a keen interest in food culture and aspire to open a cafe \nin the future. I am also a Hip Hop Competition Team member for UEA Dance Society and have performed in \nfront of celebrities/influencers.  \nReferences and creative portfolio available upon request"
            ]
        }
    ],
    "work_experience": [],
    "linkedin": "",
    "github": ""
}