{
    "name": "Kelly Zhang",
    "email": "golive.future@gmail.com",
    "phone": "+17856694192",
    "education": [],
    "work_experience": [],
    "linkedin": "https://www.linkedin.com/in/kelly-zhang-930752246/",
    "github": "",
    "projects": "classification, clustering\n05/2018 – 05/2023\nNew York, USA\n•Professionally experienced with AWS Lambda, Sagemaker, Kinesis, Firehose, Glue, Athena, EKS, \nEMR, Redshift, CodeBuild, CodeCommit and led as a technical advisor\n•Mentor and guide junior team members, provide technical",
    "certifications": null,
    "extra": "knowledge sharing initiatives.\nMachine Learning Engineer, Guardian Life Insurance Limited\n•Implemented Cloud based 10+ Machine Learning projects with the combination of coding, \nrelational database, MySQL, Oracle, Computer Science NLP and data-driven projects such as AI \nPoster, CRM and Recommendation System \n• Completed 10+ Deep Learning based computer vision, NLP projects using frameworks such as \nTensorflow, PyTorch, Yolo Model and successfully deployed 5+ large-scale production AI solutions.\n08/2016 – 05/2018\nNew York, USA\n•Work closely with software engineers to integrate machine learning algorithms into software \napplications.\nMachine Learning Intern, Federal Reserve Board of Governors\n•Collected and analyzed data from news and social media sources, and developed 12+ predictive \nmodels for cryptocurrency futures trading.\n•Designed Natural Language Processing (NLP) algorithms to valuate cryptocurrencies using \nsentiment analysis (Python, NLTK) and improved accuracy up to 96%.\n08/2014 – 08/2016\nWashington DC, USA\n•Provided analytical support for the launch and management of new quantitative investment for 8 \nproducts & strategies.\nFull-stack Developer, Niji\n•Developed 10+ new application features and distributed services that support high-scale \napplications\n•Created Web Application that allowed 75k users to search for nearby hotels and restaurants based \non their location with 97% accuracy.\n09/2012 – 08/2014\nCanton of Cesson, France\n•Worked with a team of 30 developers that created several e-commerce websites using PHP, MySQL, \nJavaScript, React, Vue, Angular and so on within 8 months\nSKILLS\nMachine Learning (Python, AWS, GCP, Azure, Keras, Numpy, Scikit-Learn, CI/CD, ChatGPT, GPT4, Stable Diffusion, LLM, Computer\nVision, NLP, Docker, Kubernetes, LSTM, CNN, RNN, Spacy)\nFull Stack Development (React.js, Angular.js, Node.js, JavaScript, TypeScript, ASP.NET, Flask, PHP, Django, RESTful API, SQL,\nNoSQL, MongoDB, PostgreSQL)\nProgramming (Python, C++, C#, Java, JavaScript, R, Scala, Delphi)",
    "skills": ""
}