{
    "name": "Kishore",
    "email": "Kishore1ga19ee034@gmail.com",
    "phone": "",
    "education": [],
    "work_experience": [
        {
            "company_name": "CATIA etc. I visited lab of LCA aircraft and learned some of testing such as NTT testing of LCA",
            "job_title": "",
            "dates_worked": "aircraft. I had good experience and had intern upto 1 month at HAL.",
            "additional_info": [
                "things on aircrafts, testing of aircrafts. I had experience by learning software such as AutoCAD,",
                "PERSONAL DETAILS:",
                "Address:",
                "Subash Chandra Bose street, Muthyalpet, Mulbagal, Kolar dist",
                "Date of Birth:",
                "16-04-2001",
                "Gender:",
                "Male",
                "Nationality:",
                "Indian",
                "Languages Known:",
                "Tamil, Kannada, Telugu, English.",
                "DECLARATION:",
                "I hereby declared that the above-mentioned details are true to the best of my knowledge. If given",
                "an opportunity to work under your organization, I shall discharge my duties to the best ability and",
                "to the satisfaction of my superior.",
                "P.KISHORE",
                "",
                "",
                "",
                ""
            ]
        }
    ],
    "linkedin": "https://www.linkedin.com/in/kishore-p-ore-6bb610243",
    "github": "",
    "projects": "1. PANIC ALARM \nIn this project, I will show how to design and build a simple panic alarm circuit using 555 \nTimer IC and a few other easily available components. This can used to activate an alarm in case of \nany emergencies. \nThere can be any sudden situation of panic. It could be because of an intruder entering our house or \nbad health status. Situations can be many for panicking and may vary from person to person. \nDuring such emergencies, we might be unable to intimate to the people around us. At that time we \nuse Panic alarm. \n \n \n \n2. CONVERSION OF SOUND ENERGY TO ELECTICAL VOLATGE. \nThis can be done by using a transducer by converting vibrations caused by noise into \nelectrical energy. The vibrations created by the noise can be converted into electrical \nenergy through the principle of electromagnetic induction. The demonstrated ideas probe \ninto a clean and readily available source of energy. \n3. RC SUBMARINE. \n \n          Nowadays, RC (radio control) submarine canbe used to do underwater monitoring. In this \nproject, the costwill be optimum and using an easy to obtain parts. The mainthings in the RC \nsubmarine are controller system andwatertight. The important components in the controllercircuit are \nESC and radio control module and propellermotor. For direction control servo motor is used to \ncontrolsurface unit. The ballast tank is made from PVC (poly vinylchloride) pipes, sockets and round \nshape. To make a controlsystem for the ballast system is the tough challenge in thisproject. The circuit \nis sensitive and easy to malfunctions. Thesubmarine can be controlled by using remote control \ndeviceand can broadcast underwater scene using on board wirelesscamera. \n \n      STRENGTHS: \n \nSelf-Motivated\n \nPunctual\n \nWorking smart\n \nRespect\n \nPunctual \n \nDisciplined\n",
    "certifications": null,
    "extra": " \nSinging\n \nDancing\n \nSports\n \nTravelling\n \nSwimming,\n \nReading magazines\n \nCERTIFICATION: \n Certified by SkillUP Simplilearn for completing course on programming with python 3.X.\n\n    INTERNSHIP: \n \nI have perused my intern at ARDC, HAL Bangalore. It was good",
    "skills": "company's goals and increases its profitability and growth.\n Programming Languages: C, C++ and basics of Python \n Electrical design such as embedded c, VLSI design, embedded hardware desings. \n Analog circuits such as switching circuits, dc-dc converters, invertors etc. \n Digital electronics, power electronics circuits. \n Electric machine design such as transformers, alternators etc. \n Basic knowledge about SCADA."
}