{
    "name": "Milton Keynes College",
    "email": "Lago7g@gmail.com",
    "phone": "",
    "education": [],
    "work_experience": [
        {
            "company_name": "CAREER OBJECTIVE",
            "job_title": "Campaign Management",
            "dates_worked": "",
            "additional_info": [
                "Marketing Strategy",
                "Brand Strategy"
            ]
        }
    ],
    "linkedin": "",
    "github": "",
    "projects": null,
    "certifications": null,
    "extra": null,
    "skills": "to improve them. Within this time I created a new social  media strategy which improved engagement levels by \n43% on average across the channels. I also ran email campaigns for our new services and products. \nDigital Marketing Assistant | November 2018 - May 2020 \nThe team allowed me to assist with all marketing activities to expand my knowledge and gain expertise in certain \nareas. This included event work, email marketing and social media work. \nLAYLA GOTT  \nCREATIVE DIGITAL MEDIA PRODUCER\nEmail: Lago7g@gmail.com\nSocial Media Content Producer | Jan 2023 - Present\n• \nHandle strategic planning, content strategy, and execution of posts across Wed2b’s Instagram, Facebook, \nand TikTok.\n• \nCreate all content that features on the Wed2b TikTok page. This includes BTS, Product based videos, Tiktok \nTrends, Competitions and fun brand awareness videos. \n• \nDirect shoots on a biweekly basis capturing video and photo content for our socials. I create on-brand \nvisuals using our photo studio, retail stores and location shoots.\n• \nRecieve a monthly budget for social shoots; I manage talent bookings, invoices, travel, locations and styling \nprops.\n• \nAssist with the planning of campaign shoots with the design team. I ensure the appropriate content can be \ncaptured for socials, and additional images for use in emails and on the website.\nCreative Graphic Designer | May 2022 - Jan 2023 \nI created design guidelines for the social channels and newsletters to ensure the branding was cohesive and in \nline with new brand guidelines. I created a wide variety of new collateral for stores including posters, banners \n& flyers. I worked closely with the marketing and agency team to create a variety of static and video ads that \nfeatured on our social channels and in publications such as The Mirror.\nSKILLS\nSPRINGBOARD\nWED2B"
}