{
    "name": "Lindi Qi",
    "email": "kilunti_kiki@outlook.com",
    "phone": "+12018062019",
    "education": [],
    "work_experience": [
        {
            "company_name": "Social-Touch｜Media Executive",
            "job_title": "",
            "dates_worked": "10/2020 - 09/2022",
            "additional_info": [
                "London，UK",
                "Courses：Mass Media，New Media Introduction，Website Design，Journalism Introduction，3Ds Max",
                "Courses： Global Media，Mediate Violence，The UK Media Industry，Journalism，Geopolitics",
                "Shanghai，China",
                "03/2018- 06/2019",
                "Global Media & Transnational Communications | MASTER",
                "Hefei，China",
                "09/2012 - 07/2016",
                "Journalism & Communications",
                "Zeux ｜PA (Part-Time)",
                "London，UK",
                "07/2022- Present",
                "Internal  Management: Independently complete the comprehensive and administrative affairs of the"
            ]
        }
    ],
    "linkedin": "",
    "github": "",
    "projects": "Sourcing Development: Based on the company's strategy and market development plan, formulate annual investment strategies with the team, \nexplore new platforms vendors such as Taobao, Douyin, Bilibili, etc., estimate the investment return rate of the media budget, also contact the \nmarket team to touch new customers.\n \nMedia Resources: Pitch and keep connections with media accounts based on brand requirements, analyze account followers' profiles, \nfollowers' loyalty, sales capability, and data traffic, cooperate with celebrities and top influencers posts such as Kan Qingzi, Li Jiaqi, and \nXinshixiang, and accumulate top and middle-tier media resources in the market, reaching over 2000+. \n \nStrategy Plan: Independently responsible for small-scale project media strategies, assist in achieving landing goals for large-scale campaigns,\noptimize channel reserve structure, and develop media promotion strategies based on project strategy. For example, for celebrity projects, \nexpand the volume from fan community; for technical products, dig out professional domains for brand reputation promotion; for beauty \ncategory products, mainly focus on video evaluations to lay out media resources.\n \nKOL Promotion: Evaluate the media value of the internally incubated accounts based on the project's matching degree and recommend \nsuitable own influencers to clients.\nJunoChina｜PR Specialist\nShanghai，China\n10/2016- 02/2018 \n \nBrand planning: Assist the project leader in completing the annual brand strategic planning, develop product communication themes and \ncontent plans based on client briefs, communicate project progress with design, marketing, and other teams. Have participated in more than 10 \nbrand planning activities, including the Be&Cherry Yang Yang live event and the Dazhong Dianping ten-year membership offline event.\n \nContent operation: Participate in the construction of content matrix, produce materials based on different demands, responsible for building \nthe company's WeChat official account and website, participate in brand activities for Fosun Group, Be&Cherry's new product releases, and \npublic relations articles, script activities, H5 rule setting, and other copywriting work for brands.\n \nMedia management: Assist in maintaining media relations, inviting media to participate in brand activities and controlling events rundown, \nwhile tracking online public comments and completing media data display to clients.\nPROJECT EXPERIENCE\nVolvo Polestar Project｜Project Manager\nMamonde Cushion Project｜Project Executive\nProject overview: The project aims to leverage the influence of popular celebrities to drive fan-based economy, create buzz on social media, and \nultimately promote e-commerce and offline purchases to achieve a complete marketing loop. My task was to independently manage the entire \nproject with a budget of over 2 million.\nResponsibilities: \n \nDeveloped media placement strategies and negotiated pricing and specific placement plans with media outlets to ensure compliance with the \nbudget. \n \nTracked placement effectiveness and analyzed data to adjust placement plans based on actual results to improve activity efficiency and ROI.\n \nMaintained relationships with media outlets, ensuring smooth communication and maximizing placement effectiveness. \n \nPlaced resources on Weibo, fan groups, and all four major app platforms to achieve a total topic exposure of over 190 million.\nProject results: By comprehensively utilizing the influencers and celebrities' fan community and social media, we successfully attracted a lot of\nattention and discussion. Potential Customers participation and purchasing willingness also significantly increased, and the entire project received \nhigh praise from the company and clients.",
    "certifications": null,
    "extra": "travel itineraries, meeting arrangements and minutes, managing company budget expenses, expense reporting, and data archiving, etc.\n \nBusiness Operations: Responsible for office location selection, tax registration and filing, vehicle tax and registration management, project \nprocurement price negotiation, and other work.\nLondon | kilunti_kiki@outlook.com | +44 7419298984\nPingCoo｜Senior Media Executive\nShanghai，China\n07/2019- 06/2020 \n \nMedia Maintenance: Communicate with integrated media channels, assist the marketing team in negotiating the annual media framework, \ncollaborate with the technical team to build up the company's media data system, maintain the network of media relationships, undertake \nmedia\nIT: Microsoft Office/ Photoshop/SQL\nLanguage：English / Mandarin\nHobbies：Tennis / Traveling/Hiking\nProject Overview: The Volvo new product project partnered with Sohu, Sina, and ATHM media to showcase the brand glory and racing culture \nof the Polestar model. Through online and offline activities in Chengdu, the project aimed to preview the power performance configuration of the \nPolestar model.\nResponsibilities:\n  Collaborate with authoritative bloggers and automotive websites to conduct a series of performance evaluations of the Polestar to increase the \nbrand's recognitions. Set up H5 interactive games offline to actively engage potential customers and showcase interact with new customers.. \n  Managing media buying, price negotiations with media partners, and maximize the use of media budgets to voice the event , also increase \nmedia engagement both online and offline and expanding the coverage of advertising.\n  Collect activity leads and data delivery results in the later stages of the project and deliver media performance to clients.\nProject Results: Through effective promotion and media delivery strategies, the project attracted the attention of potential consumers and \npromoted sales growth.",
    "skills": ""
}