{
    "name": "React JS",
    "email": "",
    "phone": "",
    "education": null,
    "work_experience": [
        {
            "company_name": "TAT.",
            "job_title": "Software Engineer - II",
            "dates_worked": "June 2022 - Present",
            "additional_info": [
                "Rocketium",
                "Bangalore",
                "Developed a range of functionalities for the video editor, such as the option to add, delete, clone, reorder scenes, and",
                "upload music in bulk. These features enabled the tool to be used effectively for creating video advertisements.",
                "Created a comprehensive animation engine and timeline view in the video editor from scratch, offering extensive",
                "control over keyframes and allowing users to add customized animations with ease.",
                "Developed options to add, delete, clone, reorder scenes and uploading scene music in bulk in the video editor,",
                "resulting the tool be a ready to use for making video ads.",
                "Software Engineer - I",
                "May 2021 - June 2022",
                "Rocketium",
                "Bangalore",
                "Successfully implemented Thirdlight for DAM management and easy media access, resulting in a 67% reduction in"
            ]
        }
    ],
    "linkedin": "",
    "github": "",
    "projects": "dAd Space - Decentralized Ad Network - You'r gateway to web3 Ad's. | ReactJS, Node.Js, Polygon\nNov 2022\n  Won Best Developer Tool or DAO Tooling by Polygon, in world's biggest ETH Hackathon\n  The entry point for DAPPs to be monetized with advertisements and analysis technologies to ensure that nobody\ngets inundated with unrelated adverts.\n  Uses The Graph, Push Protocol and Dune for other features.\n  View Project\nSummarize | ExpressJS\nMar 2021\n  Slack App for Summarizing slack threads.\n  Process video to generate summary out of it.\n  Summarize thread of 100+ messages in a jiff and ask any questions to get answer from the thread.\nAchievements\n∗ Provided mentorship to over 100 college students and professionals at Newton School, empowering them to take\ntheir initial strides into the technology industry.",
    "certifications": null,
    "extra": null,
    "skills": null
}