{
    "name": "React JS",
    "email": "",
    "phone": "",
    "education": null,
    "work_experience": [
        {
            "company_name": "TAT.",
            "job_title": "• Developed a user-friendly flow for workspace management, including inviting new members and managing member",
            "dates_worked": "",
            "additional_info": [
                "roles and settings.",
                "• Developed a global search engine with shortcut access to important features anywhere in the application, reducing",
                "overall turnaround time. Received MVP recognition for completing the project in just four days.",
                "• Built the first cut of Creative Analytics engine in less than 2 weeks, which automatically pulls data from platforms",
                "where campaigns run, understands formats, text, imagery, layouts, in the visuals, allows teams to add",
                "brand-specific data such as offer or goal, visualises this data with information-rich charts. This attracted a great",
                "attention among the marketers in industry.",
                "• Proficient in a variety of technologies, including MongoDB, ExpressJS, React JS, NodeJS, AWS, TypeScript, and",
                "Ant Design.",
                "Technical content writer Intern",
                "Nov 2020 – May 2021",
                "GeeksforGeeks",
                "Virtual",
                "• Crafted multiple articles on demanding topics and received good reviews."
            ]
        }
    ],
    "linkedin": "",
    "github": "",
    "projects": "dAd Space - Decentralized Ad Network - You’r gateway to web3 Ad’s. | ReactJS, Node.Js, Polygon\nNov 2022\n• Won Best Developer Tool or DAO Tooling by Polygon, in world’s biggest ETH Hackathon\n• The entry point for DAPPs to be monetized with advertisements and analysis technologies to ensure that nobody\ngets inundated with unrelated adverts.\n• Uses The Graph, Push Protocol and Dune for other features.\n• View Project\nSummarize | ExpressJS\nMar 2021\n• Slack App for Summarizing slack threads.\n• Process video to generate summary out of it.\n• Summarize thread of 100+ messages in a jiff and ask any questions to get answer from the thread.\nAchievements\n∗ Provided mentorship to over 100 college students and professionals at Newton School, empowering them to take\ntheir initial strides into the technology industry.",
    "certifications": null,
    "extra": null,
    "skills": null
}