{
    "name": "Fortabbas",
    "email": "ammaryousaf268@gmail.com",
    "phone": "+923228603468",
    "education": [],
    "work_experience": [
        {
            "company_name": "SMM and DM. I am very much eager to work on your",
            "job_title": "project to make it an exceptional one.",
            "dates_worked": "I am an experienced Social Media Marketer who can create, manage, maintain and work hard to grow your social media networks. Social Media is a large place to handle though I would like to share some of my expertise on Facebook, YouTube, and Instagram. FB ads, (Facebook pixel setup, Facebook lead generation ads, Targeted Audience, Funnel Testing, Lookalike audience, Page likes campaign, etc.) Instagram ads, Shopify Facebook ads, Google ads, and Email Marketing. I have been doing this for the past 3 years.",
            "additional_info": [
                "I am a specialist in SMM. Recently I finished a project on",
                "Facebook Ads successfully. I can assure you that I am a",
                "man of words. I swear to deliver each of your jobs in due",
                "time.",
                "Note",
                "If you want to discuss anything related to the project, I am available",
                "by Email and Skype 24/7. You can make a voice or video chat",
                "anytime if you see it’s necessary. I am ready to provide more than",
                "60 working hours per week, and I look forward to starting working on",
                "your project as soon as possible according to your affirmation.",
                "Thank you for being so considerate,",
                "Further Details will be provided on demand"
            ]
        }
    ],
    "linkedin": "",
    "github": "",
    "projects": null,
    "certifications": null,
    "extra": null,
    "skills": "Shopify Facebook Ads\nGoogle Ads\nYoutube Ads\nFacebook, Instagram Ads\nSocial Media Marketing\nABOUT ME\nREFERENCES\nMuhammad\nA m m a r  Y o u s a f\nS o c i a l  M e d i a\nM a r k e t i n g  E x p e r t\n +923228603468\nI am a professional expert Social Media Marketer. I\nhave more than 3 years of working"
}