{
    "name": "Kandagatla",
    "email": "Naveen0905@gmail.com",
    "phone": "+919989262918",
    "education": [
        {
            "university_name": "Communication from Osmania University",
            "course_name": "bad. \nExperience \nAPRIL 2022",
            "dates_attended": "JUNE 2002",
            "marks_or_percentage": "",
            "additional_info": [
                "in \nHydera - PRESENT \nSenior Engineering Manager/ Fabric, Remote \n \nPlatform components for B2C scenario \nRole: Senior Engineer Manager & leading a team of 9 (in Growth Stage). \n• \nPlatform Development: Led the development of a horizontal platform team to address key \nproduct requirements such as authentication and authorization, data publishing platform \n(syndication), and workflow automation (BPMN). \n• \nPartner & Customer Engagement: Drove discussions with partners, delivery teams, system \nimplementers, and customers to gather requirements and deliver solutions. \n• \nProduct Roadmap: Created a roadmap with phased approaches, including MLP, P0, and P1 \nitems, and defined clear KPIs to measure success. \n• \nArchitectural Changes: Driven design and architectural changes to meet clearly defined goals \nand improve the overall platform. \n• \nLive Site Management: Managed the live site of applications and ensured continuous \nimprovement through engineering and performance optimizations. \n• \nTeam Leadership: Coached teams, fostered transparency, and was responsible for team growth \nand development. \n• \nResource Management: Managed resources and capacity planning to ensure the delivery of \nhigh-quality products and services. \n• \nVendor Negotiations: Participated in negotiations with 3rd-party software vendors and pricing \nto align with the company's long-term vision. \n \nMAY 2012 – APRIL 2022 \nSenior Software Engineering Manager/ Microsoft, Hyderabad \n \nOffice 365 Security Product (Microsoft Defender for Office) \nRole: Senior Software Engineer Manager & leading a team of 10. \n• \nDefender for Office: Contributed to the Office 365 Security Product (Microsoft Defender for \nOffice) by processing logs, improving user experiences, generating alerts, and building data \npipelines for researchers. \n• \nData Processing: Handled terabytes of data daily, ensuring the scalability, reliability, and \nobservability of the system. \n• \nMicroservices & API Design: Designed and implemented microservices, APIs, and defined SLOs \nand KPIs to improve system performance. \n \n \n \n \n3 \n• \nGlobal Collaboration: Worked with teams across multiple geographies (U.S., Israel, China, India) \nto achieve common goals. \n• \nProduct Roadmap: Collaborated with stakeholders and product owners to create a roadmap for \nthe future of the application. \n• \nLive Site Management: Managed the live site of the application and ensured continuous \nimprovement through engineering and performance optimizations. \n• \nTeam Leadership: Coached teams, fostered transparency, and was responsible for team growth \nand development. \n• \nArchitectural Changes: Led the design and execution of architectural changes in the system to \nimprove performance and scalability. \nUnified Telemetry Platform CSEO DevOps, Learning & Readiness \nAs a Senior Software Engineer,  \n• \nwas part of a common telemetry platform used by hundreds of applications generating 250TB of \ndata monthly.  \n• \nParticipated in architectural discussions and worked with multiple teams to standardize schema \nand measure the health of all applications uniformly. Implemented autocorrelation of telemetry \nevents with SDKs in various languages. \nAs a Software Engineering II,  \n• \ndefined and executed consistency measures for the team's engineering hygiene across the \norganization.  \n• \nExtended the SonarQube AAD plugin for enterprise needs and created data pipelines for builds, \nreleases, and pull request details.  \n• \nExplored and implemented machine learning opportunities in the learning domain such as \nrecommendations and clustering and enhanced the application architecture to integrate with \nmachine learning models.  \n• \nParticipated in integration with SuccessFactors, Pluralsight, LinkedIn Learning, and Orielly. \nJULY 2010 – APRIL 2012 \nSenior Software Engineer/Thomson Reuters, Hyderabad \n• \nPlayed Major Role in Design, Development & Testing phase of implementing Point-in-time \nimport functionality. \n• \nPlayed Major Role in Architecture of the import functionality in Point-in-time. \n• \nWorked on enhancing performance of some of the existing features. \n• \nInteracting with the Business team to gather the new requirements for every release. \n \nNOVEMBER 2006 – JUNE 2010 \nAssociates -"
            ]
        }
    ],
    "work_experience": [],
    "linkedin": "https://www.linkedin.com/in/naveenkandagatla/",
    "github": "",
    "projects": "• \nExperienced complete SDLC  \n• \nWorked with client on business requirements.  \n• \nInvolved in implementing the Replication for a specific project requirement. \n• \nPlayed vital role in Architecture design and implementation of Video Analytics module. \n• \nWas part of Deployment of the application. \n• \nParticipated in internal & CMM Level audits.",
    "certifications": null,
    "extra": "",
    "skills": "• \nProficient in C#, Asp.net, R, Python, Java, JavaScript, and Node.js \n• \nSoftware Design: Experienced in scalable and distributed software product design \n• \nDatabases: Knowledgeable in SQL, DocumentDB, KeyValue datastores, and Azure Data Explorer \n• \nDistributed Systems: Skilled in implementing Microservices, Service Fabric, Rest API, and API \ndesign \n• \nFull-stack Development: Full-stack end-to-end development experience \n• \nMachine Learning: Familiar with machine learning implementations and worked with data \nscientists to scale models \n• \nLive Site Management: Experience in live site management, Continuous Integration and \nContinuous Deployment (CICD), Azure DevOps, and Left Shift Engineering process \n• \nDiagnostics: Proficient in monitoring, diagnostics, and troubleshooting \n• \nExperienced in using Redis, Elastic Search, and Bloom Filter \n• \nArchitecture: Hands-on experience with architecture patterns and design patterns \nLeadership Skills \n• \nStakeholder Management: Adept at managing stakeholders and mentoring teams to achieve \nshared goals. \n• \nModel, Coach & Care Philosophy: Strongly committed to the philosophy of leading by example, \ncoaching, and caring for team members. \n• \nCross-functional & Cross-geo Teams: Experienced in leading and working effectively with \ndiverse, cross-functional, and cross-geographic teams. \n• \nPartner & Stakeholder Relationships: Skilled in building strong relationships with partners, \nstakeholders, and customers to develop a clear product roadmap. \n• \nCustomer-focused: Strong focus on putting the customer first, delivering value, and \ncontinuously improving the customer experience. \n• \nTalent & Vendor Management: Experienced in recruiting top talent, managing vendors, and \nbuilding a high-performing team. \n• \nTeam Building: Successful track record of building teams from scratch and setting a clear vision \nand roadmap for their success. \n \n \n \n \n \n2"
}