{
    "name": "Post-doc",
    "email": "baranwal.neha24@gmail.com",
    "phone": "+919721397457",
    "education": [],
    "work_experience": [
        {
            "company_name": "ML/DS thesis supervisor",
            "job_title": "Senior AI Researcher",
            "dates_worked": "February 2022 - Ongoing",
            "additional_info": [
                "Kaliber Labs, India",
                "Hyderabad, India",
                "Kaliber labs is a U.S. based startup that deals in U.S. healthcare sys-",
                "tems. Here I am working as a senior ai researcher where my work is",
                "to design the architecture of the project and assure its delivery.",
                "To hire more people into the team. Work allocation, monitoring",
                "client deliveries, and identifying the gaps in the current process",
                "ﬂow to propose machine learning solutions.",
                "Out of body segment classiﬁcation in surgery videos: Given the",
                "endoscopy surgery videos, the task is to classify body segments",
                "that are not part of the body using vgg-16 and ResNet-50. Here",
                "we also applied diﬀerent augmentation techniques scaling rota-",
                "tion etc.",
                "Scene change detection: Given the endoscopy video we try to",
                "ﬁnd out where there is a change on the basis of anatomy and",
                "tool. In this, we combined tool, anatomy and bad frame model to",
                "get the proper results.",
                "Pathology Segmentation: Given the endoscopy video we look for",
                "the pathology part and segment it. We used MaskRCNN, U-Net",
                "model to get the proper segmentation."
            ]
        },
        {
            "company_name": "UpGrad, India",
            "job_title": "",
            "dates_worked": "January 2021 - Ongoing",
            "additional_info": [
                "Part-Time",
                "Upgrad is an"
            ]
        }
    ],
    "linkedin": "",
    "github": "https://github.com/Neha-Baranwal",
    "projects": "Taking sessions related to projects.\nSenior Researcher\nMontpellier University, France\n Nov 2020 - December 2021\n Montpellier, France\nI am associated with the electronics lab (LIRMM) and worked on\nseatizen project. As a part of the project, I worked on the classiﬁca-\ntion of marine species and checked the health of the sea.\nEDUCATION\nPh.D. in Human-Robot Interaction\nIndian Institute of Information Technology,\nAllahabad, India\n Nov2011 - Feb2017  CGPI: 9.0\nThesis title: On eﬀective human-robot inter-\naction using multimodel techniques.\nM.Tech. in Computer Science\nKIIT University, Bhubaneswar, India\n Jul2009 - Jun2011\n CGPI: 8.89\nThesis title: Spread spectrum based audio\nwatermarking techniques.\nM.Sc. in Computer Science\nAllahabad University, Allahabad, India\n Jul2007 - Jun2009\n Per: 68%\nCOURSE WORK\nSoft Computing\nImage Processing\nRobotics & Industrial Automation\nComputer Vision\nPattern Recognition\nResearch Methodology",
    "certifications": "Social network analysis (SNAW'12)\nIndian Statistical Institute, Kolkata, India\n 27 June - 28 June 2012\nOccasion: National workshop organized by\nCenter for Soft Computing Research.\nComputing Techniques and Applica-\ntions\nBanaras Hindu University, Varanasi, India\n 1 July - 7 July 2012\nOccasion: National workshop cum training\nprogram organized by Mathematics Depart-\nment.\nMachine Learning\nIndian Institute of Technology, Kanpur, India\n 1 July - 3 July 2013\nOccasion: 1st Indian Workshop organized by\ncomputer science department.\nImage Processing, Computer Vision\nand Pattern Recognition\nNational Institute of Technology Delhi, India\n 18th June - 22 June 2013\nOccasion: Faculty Development Program\norganized by computer science department.\nPDE Modeling and Computation\nIndian Institute of Technology Madras, India\n 21 Oct - 25 Oct 2013\nOccasion: DAAD Supported International\nWorkshop organized by Department of Math-\nematics.\nACADEMIC SERVICES\n  Organizing committee member of “SERB\nsponsored 1st summer school on robotics”,\norganized by IIIT Allahabad.\n  Served as a Publicity Chair in Second In-\nternational Symposium on Women in\nComputing and Informatics (WCI-2014).\n  Singh, Avinash Kumar, Neha Baranwal, Kai-Florian Richter, Thomas\nHellström, et al. (2020b). “Verbal explanations by collaborating\nrobot teams”. In: Paladyn, Journal of Behavioral Robotics 12.1,\npp. 47-57.\n  Baranwal, Neha and Gora Chand Nandi (2017a). “A mathematical\nframework for possibility theory-based hidden Markov model”.\nIn: International Journal of Bio-Inspired Computation 10.4, pp. 239-\n247.\n  - (2017b). “An eﬃcient gesture based humanoid learning using\nwavelet descriptor and MFCC techniques”. In: International Jour-\nnal of Machine Learning and Cybernetics 8.4, pp. 1369-1388.\n  Baranwal, Neha, Gora Chand Nandi, and Avinash Kumar Singh\n(2017). “Real Time Gesture Based Communication Using Possi-\nbility Theory Based Hidden Markov Model”. In: Computational\nIntelligence 33.4, pp. 843-862.\n  Baranwal, Neha, Avinash Kumar Singh, and Gora Chand Nandi\n(2017). “Development of a Framework for Human-Robot inter-\nactions with Indian Sign Language Using Possibility Theory”. In:\nInternational Journal of Social Robotics 9.4, pp. 563-574.\n  Baranwal, Neha, Shweta Tripathi, and Gora Chand Nandi (2014).\n“A speaker invariant speech recognition technique using HFCC\nfeatures in isolated Hindi words”. In: International Journal of Com-\nputational Intelligence Studies 3.4, pp. 277-291.\n Conference Proceedings\n  Singh, Avinash Kumar, Neha Baranwal, and Kai-Florian Richter\n(2020). “A Fuzzy Inference System for a Visually Grounded Robot\nState of Mind”. In: Proceedings of the Europian conference on ar-\ntiﬁcal intelligence, (ECAI 2020), Santiago de Compostela, Spain, 29\nAug-2 Sept 2020. Spain: ECAI2020.\n  Singh, Avinash Kumar, Neha Baranwal, Kai-Florian Richter, Thomas\nHellström, et al. (2020a). “Understandable collaborating robot\nteams”. In: International Conference on Practical Applications of\nAgents and Multi-Agent Systems. Springer, pp. 168-178.\n  Baranwal, Neha, Avinash Kumar Singh, and Suna Bench (2019).\n“Extracting primary objects and spatial relations from sentences”.\nIn: 11th International Conference on Agents and Artiﬁcial Intelli-\ngence, Prague, Czech Republic, 19-21 February 2019.\n  Baranwal, Neha, Avinash Kumar Singh, and Thomas Hellström\n(2019). “Fusion of gesture and speech for increased accuracy in\nhuman robot interaction”. In: 2019 24th International Conference\non Methods and Models in Automation and Robotics (MMAR). IEEE,\npp. 139-144.\n  Baranwal, Neha, Kumud Tripathi, and GC Nandi (2015). “Possibil-\nity theory based continuous Indian Sign Language gesture recog-\nnition”. In: TENCON 2015-2015 IEEE Region 10 Conference. IEEE,\npp. 1-5.\n  Baranwal, Neha, Neha Singh, and GC Nandi (2014). “Indian sign\nlanguage gesture recognition using discrete wavelet packet trans-\nform”. In: 2014 International Conference on Signal Propagation and\nComputer Technology (ICSPCT 2014). IEEE, pp. 573-577.\n  IEEE Professional Student Member.\nLANGUAGES\nHindi\n         \nEnglish\n         \nFrench\n         \nSwedish\n         \nREFERENCES\nProf. G C Nandi\n Indian Institute of Information Technol-\nogy, Allahabad, India\n gcnandi@iiita.ac.in\nProf. Thomas Hellström\n Umeå universitet\n thomas.hellstrom@umu.se\nDeclaration\nI hereby declare that the above mentioned particulars are true to the best of my knowledge and belief.\nDate:\nPlace:\nNeha Baranwal",
    "extra": null,
    "skills": "Machine Learning\n         \nComputer Vision\n         \nDeep Leaning\n         \nNatural Language Processing\n         \nGit\n         \nJira\n         \nSlack\n         \nDocker\n         \n  Marine species classiﬁcation: Given the RGB images and their\nmeta data we classiﬁed marine species such as sea grass, sea cu-\ncumber, ﬁsh, turtle etc. using ResNet-50, DensNet.\n  Deep learning optimization: Given the deep learning algorithm\nwe optimized inferencing upto the level where it can be used in\nmicroelectronic devices.\nAssociate Solution Leader\nBrane Enterprises LLP\n April 2020 - Oct 2020\n Hyderabad\nBrane is a private Indian startup that deals in AI and Robotics prod-\nucts, As a leader my responsibilities were:\n  To hire more people into the team. Work allocation, monitoring\nclient deliveries, and identifying the gaps in the current process\nﬂow to propose machine learning solutions.\n  To design the architecture of machine learning solutions.\n  We had developed a no-code platform that helps user to load\nthe training population, conﬁgure the hyper parameters and then\nallow training and deploy the model without writing a single line\nof code. Here we used LSTM, graph neural network to make the\ncomplete eco system.\nPostdoctoral Researcher\nUmea University, Sweden\n November, 2017 - Jan, 2020\n Umea, Sweden\nDuring the postdoc, I worked on humanoid robots. We train them\nto assist humans in the household scenarios.\n  We designed a dialogue based human robot interaction system\nthat allows humans, to talk to the robot.\n  A dialogue generation system is added to translate robot's action\ninto the natural language so that they would be understandable.\nAssociate Process Manager\neClerx Services Limited\n April, 2016 - August, 2017\n Navi-Mumbai, India\neClerx is an Indian IT consulting and outsourcing multinational\ncompany. I worked there as a full stack developer and my job was\nto design and develop NLP, ML solutions. Here i used word2vec,\nglobe, Spacy parcer, Baye's network, SVM. We used image prepro-\ncessing to improve OCR (tresseract, google) accuracy, further to\nintegrate these solutions with RPA system. I have supervised junior\nmembers of the team.\nRESEARCH PROJECTS\nFusion of gesture and speech for increased accuracy in\nhuman robot interaction\nUmea University, Sweden\nAn approach for decision-level fusion for gesture and speech based\nhuman-robot interaction (HRI) is proposed. A rule-based method is\ncompared with several machine learning approaches. Gestures and\nspeech signals are initially classiﬁed using hidden Markov models,\nreaching accuracies of 89.6 percent and 84 percent respectively. The\nrule-based approach reached 91.6 percent while SVM, which was the\nHeadless servers\n         \nMOST PROUD OF\n\nSeatizen Project (2020-2025)\nSelected for the Post-Doc position on\nhealth monitoring of underwater sea\nspecies at LIRMM Montpellier, France.\n\nPostdoc funding from Kemphe Foun-\ndations, Sweden\nReceived 2.5 years of research fund-\ning to pursue my postdoctoral work\nin Human-Robot Interaction at Umea\nUniversity, Sweden.\n\nSpot Award for project negative news\nanalysis\nSelected for spot award at eClerx, In-\ndia.\n\nDST travel grant, India\nSelected for DST travel grant for at-\ntending 35th IEEE TENCON 2015 con-\nference held in Macao, china, 1-4 Nov.\n2015 at IIITA, India.\n\nBest paper award\nMy publication got selected for best\npaper award in 3rd IEEE International\nConference on Advances in Comput-\ning, Communications, and Informatics\n(ICACCI 2014) at IIITA, India.\n MHRD, India PH.D Fellowship\nSelected for the Ph.D under the\nrobotics and AI lab, IIITA\nPROGRAMMING SKILLS\nPython\n         \nMATLAB\n         \nINVITED TALKS\nAn Empirical Review of Calibration\nTechniques for the Pepper Humanoid\nRobot's RGB and Depth Camera\nIntelligent Systems and Applications.\n 5th Sept 2019\n London, England\nOccasion: Presented conference paper in\nIntelliSys 2019.\nFusion of Gesture and Speech for In-\ncreased Accuracy in Human Robot\nInteraction\nbest of all evaluated machine learning algorithms, reached an accu-\nracy of 98.2 percent on the test data. A complete framework is de-\nployed in real time humanoid robot (NAO) which proves the eﬃcacy\nof the system.\nTechniques: Multi-Layer Perceptron, CNN, DWT\nPlatform: Python, Choregraphe, TensorFlow.\nUnderstandable Collaborating Robot Teams\nUmea University, Sweden\nWe investigate understandability for teams of robots collaborating to\nsolve a common task. We present a novel and ﬂexible solution based\non Cooperating Distributed Grammar Systems and a multi-agent al-\ngorithm for coordination of actions. The solution is implemented and\nevaluated on three Pepper robots collaborating to solve a task while\ncommenting on their own and other robots' current and planned ac-\ntions.\nTechniques: Cooperating Distributed Grammar System, Multi-\nAgent System, Natural Language Generation.\nPlatform: Python, Choregraphe.\nDevelopment of a framework for human-robot interac-\ntions with Indian sign language using possibility theory\nIIIT, Allahabad, India\nThis paper demonstrates the capability of NAO humanoid robot to\ninteract with hearing impaired persons using Indian Sign Language\n(ISL). Principal contributions of the paper are: wavelet descriptor has\nbeen applied to extracting moment invariant shape future of hand\ngestures and possibility theory (PT) has been used for classiﬁcation of\ngestures. Preprocessing and extraction of overlapping frames (start\nand end point of each gesture) are the other major events which have\nbeen solved using background modeling and novel gradient method.\nWe have shown that the overlapping frames are helpful for fragment-\ning a continuous ISL gesture into isolated gestures. These isolated\ngestures are further processed and classiﬁed. During the segmenta-\ntion process some of the geometrical features like shape and orien-\ntation of hand are deformed, which has been overcome by extracting\na new moment invariant feature through wavelet descriptor. These\nfeatures are then combined with the other two features (orienta-\ntion and speed) and are classiﬁed using PT. Here we use PT in place\nof probability theory because possibility deals with the problem of\nuncertainty and impression whereas probability handles only uncer-\ntainty issues. Experiments have been performed on 20 sentences of\ncontinuous ISL gestures having 4000 samples where each sentence\nhaving 20 instances. In this dataset 50\nTechniques: Possibility Theory, Nao Speech Engine, HMM.\nPlatform: Matlab, Choregraphe, NAOqi.\nINDUSTRIAL PROJECTS\nOut of body segment classiﬁcation\nKaliber Labs\nWe designed an algorithm that would classify out-of-body segments\nfrom endoscopy videos. We applied ResNet-50 and CNN+LSTM to\nclassify images. Total 50000 images was used where 60 percent is\nused for training and 30 percent was used for validation and 10 per-\ncent was used for testing. Window based smoothing was used as\npostprocessing to get a better result. To handle the datadrift prob-\nlem we trained the model using semi supervised learning approach.\n25th International Conference on Methods\nand Models in Automation and Robotics\n 24th Aug 2019\n Międzyzdroje, Poland\nOccasion: Presented conference paper in\nMMAR 2019.\nDeep Learning\n3-Day workshop at LIRMM, Montpellier\nUniversity, France\n 22nd July-24 July 2021\n Montpellier, France\nOccasion: Organized 3-day workshop on\ndeep learning.\nUnderstandable human-robot inter-\naction\nComputing science department, Umea Uni-\nversity\n 18th June 2019\n Umea, Sweden\nOccasion: Poster presentation in 31st Swedish\nAI Society Workshop.\nRobotic Manipulator and sketch draw-\ning\nWASP-Wallenberg Foundation\n 11th April 2018\n Stockholm, Sweden\nOccasion: Presented live demo in AI4X- Col-\nlecting Ideas and Identifying Challenges for\nFuture AI Research in Sweden.\nRobotics\nDepartment of Electronics and CSE SUIIT,\nSambalpur University, Burla, Odisha, India\n 30th April 2021\n Sambalpur, India\nOccasion: Delivered talk in International\nworkshop on recent advancements in elec-\ntronica and computer advancement.\nDeep Learning\nLIRMM, Montpellier University, France\n 28th June 2021\n Montpellier, France\nOccasion: Delivered talk at MIC DAY orga-\nnized by Microelectronics department.\nArtiﬁcial Intelligence and the Future\nof Robotics\nCentre for Artiﬁcial Intelligence, Banasthali\nUniversity, Rajasthan, India\n 22nd March 2021\n Rajasthan, India\nOccasion: Delivered talk at Faculty Develop-\nment Programme on Artiﬁcial Intelligence,\nRobotics, and Automation.\nTechniques: Vgg-16, ResNet-50, CNN+LSTM\nPlatform: Python, TensorFlow, Keras.\nScene change detection\nKaliber Labs\nWe are given an endoscopy videos, our task is to identify changes on\nthe basis of tool and anatomy. Here we used 4 models (Inside/outside,\ngood/bad, anatomy and tool) clubbed together and get the ﬁnal out-\nput which we saved in csv ﬁle where each column represents the\nresults of one algorithm. Distance based method is used to identify\nchanges presents in csv ﬁle. Smoothing is also used to remove out-\nliers.\nTechniques: Transfer Learning, MASKRCNN, U-Net\nPlatform: Python, TensorFlow, Keras.\nEmail Classiﬁcation\nCredit Suisse International\nA classiﬁcation system requires two things, features which can rep-\nresent the sample in the feature space (vector form) and classiﬁer\nwho will classify these feature to their respective classes. We have\nused bag of words, nGram, and TF-IDF to deﬁne the features while\nLinear, Naïve Bayes, Support Vector Machines are used to classify\nthese emails to one of the deﬁned classes. Since email signatures,\nImages etc. are not required in email classiﬁcation. A separate pre-\nprocessing module is written for email cleansing.\nTechniques: TD-IDF, Bayes (Multinomial, Unigram), Linear Classi-\nﬁer, SVM.\nPlatform: Python, Scikit, Numpy, Beautifulsoup, NLTK, SQL.\nNegative News Scanning\neClerx Services\nWe need to ﬁnd the relative information about the person/organization\nfrom the given sources(websites) and then estimate that the extract\ninformation is positive or negative. Here the term negative symbol-\nizes that the entity is involved in money laundering or any illegal ac-\ntivity in the past. We used web scrapping to download the informa-\ntion and then applied anaphora resolution to identify the sentences\nrelated to the entity. Later we used sentiment analysis over the col-\nlected samples.\nTechniques: TD-IDF, nGram (unigram, bigram, trigram), Logistic Re-\ngression, SVM.\nPlatform: Python, Scikit, Numpy, Beautifulsoup, NLTK.\nIntent Classiﬁcation\nBrane enterprises LLP\nIntent Detection and Slot Filling is the task of interpreting user com-\nmands/queries by extracting the intent and the relevant slots. HR\ndataset was considered. The slots are labeled in the BIO (Inside Out-\nside Beginning) format (similar to NER). Encoding was extracted us-\ning Bert then these encodings was fed into LSTM model to get the\nintent and slot.\nTechniques: Bert, LSTM.\nPlatform: Python, Tensorﬂow, Keras.\nSELECTED PUBLICATIONS\n Journal Articles\nPossibility Theory based Continuous\nIndian Sign Language Gesture Recog-\nnition\nTENCON a premier international technical\nconference of IEEE Region 10\n 1st Nov 2015\n Macau, China\nOccasion: Presented conference paper in\nTENCON 2015."
}