{
    "name": "Nina Gamble",
    "email": "Ninargamble@gmail.com",
    "phone": "",
    "education": [],
    "work_experience": [
        {
            "company_name": "GOE Wellness, London — Video Editor / Social Media Assistant",
            "job_title": "team in social media strategy. As a social media assistant I supported the",
            "dates_worked": "July 2022 - February 2023",
            "additional_info": [
                "As a video editor my responsibilities include: editing videos for our wellness",
                "platform (such as workout routines and meditation guides), producing and",
                "publishing content for our social media platforms, and assisting our marketing"
            ]
        },
        {
            "company_name": "Polyesterzine, London — Social Media Assistant",
            "job_title": "Giulio Fashion, London— Customer Assistant",
            "dates_worked": "August 2021 - January 2022",
            "additional_info": [
                "marketing team in running social media accounts and solely ran the company",
                "TikTok. I would produce, publish and schedule content in line with events and",
                "product launches, to bring in a larger audience to the growing company.",
                "During this time I worked closely with individual clients, catering the",
                "shopping experience to each one. My role included styling and choosing pieces",
                "from the newest luxury brand collections to present, whilst building a strong",
                "relationship with each client to learn their likes and dislikes."
            ]
        },
        {
            "company_name": "During this time I worked with PolyesterZine to help them get started using",
            "job_title": "",
            "dates_worked": "October 2020 - November 2020",
            "additional_info": [
                "the social media platform TikTok, and carry over the content from other",
                "platforms. Within this I edited videos, planned content uploads and reviewed",
                "what was getting the most engagement on TikTok."
            ]
        }
    ],
    "linkedin": "",
    "github": "",
    "projects": "hone in on the pre production skills I have developed and grow\nprofessionally. I also gained massive experience in sound recording including\ninterviews and foley which helped me in my editing and sound\nShowreel: https://www.youtube.com/watch?v=yL60HebLoQk&ab_channel=NinaGamble\nSKILLS\n -Competent with Microsoft Office and Apple MAC software\n -Competent with Adobe Premiere pro and Audition\n -Competent with varied sound recording equipment and procedures\n -Competent with social media backend navigation and planning",
    "certifications": null,
    "extra": null,
    "skills": "Filmmaking BA graduate with a passion for post production, specifically editing.\nI have a strong interest in current affairs. I am also interested in the role\nthat social media and the media plays in modern life. Within my work I have\nfocus on queer culture, feminist issues and fashion. This focus takes the form\nof the experimental genre, however I have also branched into documentary. Having\nworked in retail and customer based roles since the age of 16 I have a\ndisciplined work ethic, working both independently and within a group setting."
}