{
    "name": "Nina Gamble",
    "email": "Ninargamble@gmail.com",
    "phone": "",
    "education": [],
    "work_experience": [
        {
            "company_name": "GOE Wellness, London — Video Editor / Social Media Assistant",
            "job_title": "",
            "dates_worked": "July 2022 - February 2023",
            "additional_info": [
                "As a video editor my responsibilities include: editing videos for our wellness",
                "platform (such as workout routines and meditation guides), producing and",
                "publishing content for our social media platforms, and assisting our marketing",
                "team in social media strategy. As a social media assistant I supported the",
                "marketing team in running social media accounts and solely ran the company",
                "TikTok. I would produce, publish and schedule content in line with events and",
                "product launches, to bring in a larger audience to the growing company.",
                "Giulio Fashion, London— Customer Assistant",
                "August 2021 - January 2022",
                "During this time I worked closely with individual clients, catering the",
                "shopping experience to each one. My role included styling and choosing pieces",
                "from the newest luxury brand collections to present, whilst building a strong",
                "relationship with each client to learn their likes and dislikes.",
                "Polyesterzine, London — Social Media Assistant",
                "October 2020 - November 2020",
                "During this time I worked with PolyesterZine to help them get started using",
                "the social media platform TikTok, and carry over the content from other",
                "platforms. Within this I edited videos, planned content uploads and reviewed",
                "what was getting the most engagement on TikTok."
            ]
        }
    ],
    "linkedin": "",
    "github": ""
}