{
    "name": "Nitin Sutrakar",
    "email": "nitins2332@gmail.com",
    "phone": "+917390094458",
    "education": [],
    "work_experience": [
        {
            "company_name": "JKIAPT, University of Allahabad",
            "job_title": "07/2018 - 05/2022",
            "dates_worked": "",
            "additional_info": [
                "",
                "Other Skills",
                "Content Creation",
                "Video Editing",
                "Image Editing",
                "Other Projects",
                "Chat Application Project",
                "I built a chat application using the MERN Stack with a user-friendly interface designed with",
                "Material UI. The application allows for easy login through user authentication with Google",
                "API. I also added features such as chat functionality and file sharing to enhance the overall",
                "user experience.",
                "Project files link",
                "Date - Jan/2023",
                "API  Based Project Project files link",
                "I developed a web application using React jS that relied on APIs and designed user interface",
                "components with Material UI. I demonstrated problem-solving skills by efficiently handling",
                "asynchronous data loading and error handling while fetching data from the IMDB API.",
                "Additionally, I learned new skills and technologies as needed to successfully complete all",
                "project tasks.",
                "Date - Nov/2022",
                "Quiz Application Project",
                "Developed a dynamic quiz platform with 22 categories of multiple-choice questions using",
                "ReactJS. Integrated a user registration feature to allow progress saving and score viewing.",
                "Applied best practices code in front-end development, such as responsive design, to ensure",
                "optimal performance on various devices and browsers.",
                "Project files link",
                "Date - Dec/2021",
                "Robotics Workshop -",
                "Participated in a Robotics Workshop and developed a web application to control a robotic",
                "machine using a web interface. Implemented control logic to translate user commands into",
                "actions. Collaborated with team members to improve communication skills.",
                "Date - Dec/2019",
                "Extra Activity"
            ]
        }
    ],
    "linkedin": "",
    "github": "",
    "projects": "nitins2332            \nProfile Link\n  MERN stack E-commerce application        \nI have created an Ecommerce website using MERN Stack, which is scalable and future-proof.\nI utilized React for the frontend & Redux for state management, while Node JS & Express\nwere used for the backend with MongoDB as the database. Users are able to add items to\ntheir cart, and the cart system works similarly to that of the Flipkart website.\nProject files link\n                                                                                                                                                                                 Date - Mar/2023\n      Internship\n  Internship with codesdope    \nAs a React Developer, I contributed to the development of a responsive web user interface\nwith Material UI. I also created reusable UI components with React to speed up\ndevelopment and reduce code duplication. Furthermore, I designed a dynamic navigation\nsystem using routing to improve user",
    "certifications": null,
    "extra": null,
    "skills": "React JS\nRest APIs\nRedux\nRouter\nMaterial UI\nNode JS\nExpress JS\nMongo DB\nGitHub\nPython\nJava Script\n      My"
}