{
    "name": "Tik Tok",
    "email": "nchinoputsa@gmail.com",
    "phone": "+447907715301",
    "education": [
        {
            "university_name": "MSc in Global Marketing Management at The University",
            "course_name": "ber 2021",
            "dates_attended": "September 2022",
            "marks_or_percentage": "",
            "additional_info": [
                "of Sheffield - Septem- September 2022  \n• \nRelevant Modules: International Consumer Behaviour, Global Marketing, Marketing \nCommunications. \n• \nDissertation Topic: A study of how Tik Tok influencers develop consumer and brand relationships \nin the UK context. \nBA (Hons)"
            ]
        },
        {
            "university_name": "International Business with French and a Year Abroad at Bishop’s University",
            "course_name": "ment at Walt Disney World Parks and Resorts Inc.",
            "dates_attended": "September",
            "marks_or_percentage": "",
            "additional_info": [
                ", Canada. \nCompleted an Industrial Place (2:1) –September 2016- \nMay 2020.  \n• \nCertificate in Hospitality and Tourism Management –"
            ]
        },
        {
            "university_name": "The University",
            "course_name": "me",
            "dates_attended": "May 2020",
            "marks_or_percentage": "",
            "additional_info": [
                "of California, Riverside \nExtension (June 2018-January 2019) – Disney’s Academic Exchange Program  \n• \nBBA Business Administration -"
            ]
        },
        {
            "university_name": "Bishop’s University",
            "course_name": "May \n2019",
            "dates_attended": "June 2018-January 2019",
            "marks_or_percentage": "",
            "additional_info": [
                ", Canada (Study Abroad) (January 2019-)."
            ]
        },
        {
            "university_name": "Barnsley Sixth Form College",
            "course_name": "",
            "dates_attended": "January 2019-May \n2019",
            "marks_or_percentage": "",
            "additional_info": [
                "2014-2016  \n• \nA ‘Level Citizenship Studies, Health and Social Care, Sociology."
            ]
        },
        {
            "university_name": "Barnsley College",
            "course_name": "mance",
            "dates_attended": "",
            "marks_or_percentage": "",
            "additional_info": [
                "2014-2015  \n• \nMusic Perfor (QCF) –"
            ]
        },
        {
            "university_name": "Distinction \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nProfessional Work Experience  \nMarketing Assistant at The University",
            "course_name": "marketing activity for Accommodation and Commercial Services.",
            "dates_attended": "",
            "marks_or_percentage": "",
            "additional_info": [
                "of Sheffield (UNICUS Sheffield Ltd) \nPresent Day (Part-Time) \n• \nDelivery of multi-channel  \n• \nCoordinating marketing"
            ]
        }
    ],
    "work_experience": [],
    "linkedin": "",
    "github": "",
    "projects": "print, digital, social and email marketing. \n• \nManaging social media to maximise engagement, including Instagram, Facebook, and Twitter. \n• \nUpdating websites to drive engagement and ensure accuracy and relevance. \n• \nUsing Mail Chimp to create and produce content for e-newsletters. \nAlumni Ambassador for The Internship Experience - The Bright Network UK  \n• \nNetworking and connecting with students.  \n• \nPromoting the internship experience to peer groups on social media channels.  \n• \nSharing sector stream experiences with other students. \n• \nSharing key learnings from my experience on the Internship Experience UK 2020.  \nNCS Assistant Recruitment Coordinator, Sheffield Wednesday Community Programme  \nApril 2021 – July 2021  \n• \nmplementing and coordinating a high quality NCS experience to a team of up to 15 Young People. \n• \nSupporting the Team Leader in engaging with local volunteer centre, community groups and \ncharities for social action project opportunities.  \n• \nUsing salesforce to promote NCS events and to monitor weekly KPIs. \n• \nConsulting with the Education Department to produce and promote social media posts on \nLinkedIn, Facebook, and Instagram through SWCCP Social Media Pages. \nWalt Disney World Cast Member, Walt Disney World Resort, Orlando, Florida, USA.  \nJuly 2018 – January 2019  \nMerchandise Customer Service Assistant   \n• \nDelivered guest services during busy seasons such as Christmas and Thanksgiving.  \n• \nExcellent customer service skills, working on the frontline and proficiently displayed diplomacy in \nhandling and resolving guest queries.  \n• \nDeveloped skills such as teamwork as I worked with other individuals daily, all staff would help \none another to ensure that the business operated smoothly.  \n• \nEffective communication and teamwork were paramount to success. \nFront of House Cast Member  \n• \nAccommodated guests with world-class customer service whilst on the frontline.  \n• \nFulfilled guests' requests, multi-tasking, managing inventory, ensuring that sales targets were met. \n• \nEducated and informed guests about the ethos of the organisation.  \n• \nDeveloped strong interpersonal skills by ensuring that service was delivered to guests on time. \nStudent Representative for BA (Hons) International Business – University of Hertfordshire  \nSeptember 2016 – May 2018.  \n• \nNominated by International Business classmates.  \n• \nAttended Business School meetings, reported and discussed with other business school students \nabout what improvements could be made at the business school.  \n• \nGathered information from the student body about what aspects of the course they enjoyed and \nwhat could be improved.  \n• \nDeveloped skills such as planning and leadership by building rapport with programme leaders.  \nAwards/Achievements  \n• \nFrettwell-Downing Scholarship, 2021  \n• \nCertificate in Hospitality and Tourism Management, 2019 (University of California). \n• \nOrganizational Leadership, American Council on Education, 2018 (University of California).  \nExtra-Curricular Activities  \n• \nCaribbean African Students Association, 2019 (Bishop’s University). \n• \nStudent Representative, University of Hertfordshire, 2017, 2018 (University of Hertfordshire).  \n• \nEntrepreneurs Society 2016-2017 (University of Hertfordshire) – Active Member  \nInterests  \nI enjoy cooking, exploring social media, listening to music, and travelling. I hold a full and clean UK Driver’s \nLicense.  \nReferences \nEmma Chorley – Manager at UNICUS Sheffield Ltd (e.chorley@sheffield.ac.uk)  \nNatasha Khilji – Programme Leader for International Business (g.khilji@herts.ac.uk)",
    "certifications": null,
    "extra": "• \nOrganisation and time management - I enjoy working in a team by working collectively to meet \ndeadlines and targets.",
    "skills": "level marketing, sales, customer-focused and social media marketing roles.  \n \nSkills Profile  \n• \nFirst-Class Honours in my Marketing Dissertation.  \n• \nOutstanding communication and team-building skills developed through networking, hospitality, \nand tourism work experience and study abroad.    \n• \nEnhanced my flexibility, organisational and time management skills by balancing my studies with \nmy work commitments - Overseas experience in the United States of America.  \n• \nDeveloped rapport and relationships with other students and staff members by attending meetings \nregularly at the University of Hertfordshire –"
}