{
    "name": "Languages - Romanian",
    "email": "iacobo@uni.coventry.ac.uk",
    "phone": "",
    "education": [
        {
            "university_name": "project with Bangkok University",
            "course_name": "MANIA",
            "dates_attended": "one month",
            "marks_or_percentage": "5%",
            "additional_info": [
                ", \nfurther developing inter-cultural and collaboration skills;   \n \nALEXANDRU LAHOVARI NATIONAL COLLEGE, RO | Baccalaureate 9.23 | 2016-2020 \nSocial Sciences  \nReceived high school Baccalaureate diploma (Equivalent to GCSE’s and A’ Levels): Romanian Language and Literature (9.23); \nHistory (9.45); Logic (8.60). The main field of study: Social Sciences, including English, French, Geography, History, Core Science, \nArts, Information Technology.  \n   \nRELEVANT EXPERIENCE    \n \nSOCIAL MEDIA OUTREACH INTERN | Free Pads for India | 02/2023- present \n• \nPerforming research on current trends and audience preferences, always being up-to-date with the information.  \n• \nWorking in a team, succeeding to increase the organisation’s number of Instagram followers with 2.5% in one month, \ndeveloping planning and engagement skills. \n• \nCollaborating with influencers or organisations to raise awareness about our mission and setting up online meetings, \ngaining management skills. \n• \nResponding to enquiries regarding organisation insights or collaborations, demonstrating responsibility and \ncommunications skills. \n \nADVERTISING BOARD MEMBER AND VOLUNTEER | Interact Ramnicu-Valcea | 2017-2020  \n• \nJoined the Advertising Board in 2018-2019, taking the opportunity to plan content strategies and create online posts in \norder to promote the club’s social media platforms and services; gained organisation, writing and social media management \nskills and succeeded to grow their audience and improve the reputation.  \n• \nCoordinated a charity event whilst supervising volunteers’ activity and tracking their progress, further building"
            ]
        }
    ],
    "work_experience": [],
    "linkedin": "https://www.linkedin.com/in/oana-iacob-896123200",
    "github": ""
}