{
    "name": "Languages - Romanian",
    "email": "iacobo@uni.coventry.ac.uk",
    "phone": "",
    "education": [
        {
            "university_name": "project with Bangkok University",
            "course_name": "MANIA",
            "dates_attended": "one month",
            "marks_or_percentage": "5%",
            "additional_info": [
                ", \nfurther developing inter-cultural and collaboration skills;   \n \nALEXANDRU LAHOVARI NATIONAL COLLEGE, RO | Baccalaureate 9.23 | 2016-2020 \nSocial Sciences  \nReceived high school Baccalaureate diploma (Equivalent to GCSE’s and A’ Levels): Romanian Language and Literature (9.23); \nHistory (9.45); Logic (8.60). The main field of study: Social Sciences, including English, French, Geography, History, Core Science, \nArts, Information Technology.  \n   \nRELEVANT EXPERIENCE    \n \nSOCIAL MEDIA OUTREACH INTERN | Free Pads for India | 02/2023- present \n• \nPerforming research on current trends and audience preferences, always being up-to-date with the information.  \n• \nWorking in a team, succeeding to increase the organisation’s number of Instagram followers with 2.5% in one month, \ndeveloping planning and engagement skills. \n• \nCollaborating with influencers or organisations to raise awareness about our mission and setting up online meetings, \ngaining management skills. \n• \nResponding to enquiries regarding organisation insights or collaborations, demonstrating responsibility and \ncommunications skills. \n \nADVERTISING BOARD MEMBER AND VOLUNTEER | Interact Ramnicu-Valcea | 2017-2020  \n• \nJoined the Advertising Board in 2018-2019, taking the opportunity to plan content strategies and create online posts in \norder to promote the club’s social media platforms and services; gained organisation, writing and social media management \nskills and succeeded to grow their audience and improve the reputation.  \n• \nCoordinated a charity event whilst supervising volunteers’ activity and tracking their progress, further building"
            ]
        }
    ],
    "work_experience": [],
    "linkedin": "https://www.linkedin.com/in/oana-iacob-896123200",
    "github": "",
    "projects": "Marketing Campaign Planning and Designing | Coventry University | 04/2022  \n• \nThe project consisted of creating a new clothing brand, by developing and designing a campaign plan. I had to implement \ntopics such as: segmentation criteria, communication goals and SMART objectives, strategy and positioning, promotion \nand scheduling. Due to this experience, I developed my skills regarding creativity, design, campaign management, \nteamwork, time management.  \n   \nACHIEVEMENTS  \n• \nParticipated in the English Olympics twice in Highschool.   \n• \nTook part in the CIM’S ‘’The Pitch’’ competition.  \n• \nParticipated in an international English summer camp in 2019, I had the chance to improve my social abilities and written \nskills.  \n• \nTaking dance classes and doing Volleyball in school helped me improve as an individual and it developed my determination \nand sense of community.  \n• \nVolunteering for a sports association and undertaking relevant duties in my free time in Romania.   \n• \nTook part in the organisation of “International Equity, Diversity and Inclusion in Higher Education Conference” 2022, \nwhere I assisted the participants from Europe and USA and developed networking skills. \n• \nBy completing courses on LinkedIn and FutureLearn, I developed several skills regarding Social Media Marketing \nStrategy, SEO, Creative thinking, Online Video Marketing, Video editing, Google Analytics.   \n \nHOBBIES AND INTERESTS  \n• \nPassionate about social media and digital field, currently active on the most popular platforms and always up to date with \nthe trends. I succeeded to become viral on TikTok with one of my videos, having over 200K views and 50K likes, by using \nappropriate hashtags and following the trends. \n• \nPracticing snowboarding enhanced my tenacity and courage and it is a good way to relax and exercise. \n• \nExcited about travelling, recently accepted a position through Worldpackers program and going to volunteer for a    \nguesthouse and restaurant in Portugal for one month.",
    "certifications": null,
    "extra": "and multi-tasking skills.  \n• \nDeveloped my ability to speak in public for different audiences by supporting presentations in schools, sharing leaflets, \nand displaying materials at events in public spaces.  \n• \nCollaborated with volunteers from other cities to manage and organise a national talent contest with participants from all \ncounties, learning how to work under pressure and pay attention to detail.  \n \n WORK AND VOLUNTEERING EXPERIENCE  \n \n  STUDENT AMBASSADOR | Coventry University Futurelets | 09/2021- present  \n• \nGreeting visitors with positive energy and enthusiasm, as well as giving accommodation tours for University Open Days, \ndemonstrating active communication and listening skills.  \n• \nWorking effectively with reception staff members and other student ambassadors to complete various tasks, resulting in \npositive feedback.  \n• \nPromoting the accommodations during university fairs, offering support to prospective students, and further becoming \nconfident in communicating with people from various backgrounds.   \n• \nReceived positive feedback from visitors and supervisors, and successfully undertaking different duties. \n \nCRAFTING SOCIETY MEMBER | Coventry University Students Union | 10/2021- present  \n• \nAttending weekly events and being active in creative activities, such as knitting, sculpting, jewellery making.  \n• \nEnhancing my interpersonal skills by communicating with students from different cultures and backgrounds.  \n• \nLearning new hobbies and developing them.  \n \nSALES ASSISTANT | Nisa retail | 10/2021- 06/2022  \n• \nAssisted customers with a selection of products and services.   \n• \nEnsured that customers were satisfied and their needs are being met.  \n• \nUsed communication and listening skills to successfully respond to customers’ queries in a professional and friendly \nmanner.  \n• \nBuilt attractive displays for merchandise to enhance sales and promoted the products, demonstrating creative skills.  \n• \nAble to communicate possible issues to managers or colleagues with tact and efficiency.",
    "skills": "• \nExcellent IT Skills - European Computer Driving License Certificate, Canva, TikTok and Reels editing skills. \n• \nLanguages - Romanian (native): English (professional fluency); French (beginner);  \n• \nSocial Media Management - I developed these skills while volunteering for an organisation where I managed their social \nnetworks and promotion techniques, as well as being an intern for an NGO and focusing on increasing their reach.  \n• \nCommunication – By constantly interacting with various people during social activities and work duties I enhanced my \nverbal and written communication. \n• \nCreativity – I succeeded to come up with standout ideas while completing academic assignments based on marketing \nstrategies.  \n• \nFlexibility and adaptability - As an international student, I had to quickly adapt to a new lifestyle and get used to the \nonline teaching mode as a result of Covid pandemic."
}