{
    "name": "Pitta Vikash",
    "email": "vikashpitta@gmail.com",
    "phone": "",
    "education": [
        {
            "university_name": "Krishna Sai Junior College",
            "course_name": "mediate",
            "dates_attended": "2015 - 2019",
            "marks_or_percentage": "7%",
            "additional_info": [
                ", Sompeta\n2012 - 2014\nInter (MPC) [91.7%]"
            ]
        }
    ],
    "work_experience": null,
    "linkedin": "",
    "github": "",
    "projects": "Portfolio-Project\nDeveloped a responsive website for the Portfolio of a person where other people like interviewers can\nsee a list of projects, skills, testimonials, contact info\n●\nDesigned page by using HTML structure elements and by using different bootstrap components to\nshow different sections in the website and different Bootstrap classes for responsiveness through the\nmobile-first approach.\n●\nDisplayed testimonials from different people using bootstrap carousel components.\nTechnologies used: HTML, CSS, Bootstrap\nhttps://vick1portfolio.ccbp.tech/#\nE-Commerce-Project\nDeveloped an E-Commerce website where users can go through different products, detailed information about\na product offers, and contact us info.\n●\nDesigned page using following HTML structure elements and footer elements by using different\nbootstrap components to show different sections in the website and different bootstrap classes for\nresponsiveness through the mobile-first approach.\n●\nImplemented product youtube videos by using bootstrap embed and model components and displayed\nmultiple images of offers in a carousel using a bootstrap carousel.\nTechnologies used: HTML, CSS, Bootstrap\nhttps://vikakaecommerce.ccbp.tech/\nVR-Project\nDeveloped a responsive website for VR products where users can see a list of products, detailed information\nabout a product and trending blogs, contact us info\n●\nDesigned page using HTML structure elements, footer elements by using different bootstrap\ncomponents to show different sections in the website.\n●\nImplemented responsiveness by using Bootstrap grid system and flex classes and CSS box model\nproperties through a mobile-first approach.\nTechnologies used: HTML, CSS, Bootstrap\nhttps://vickyvirtualpge.ccbp.tech\nAchievements\n●\nCompleted NCC along with my graduation in the Air Wing.\n●\nCreated an impact on the public by participating in awareness rallies.",
    "certifications": null,
    "extra": null,
    "skills": "Front End: HTML, CSS, Bootstrap, JavaScript, React.js*\nBack End: Python, Express*, Node.js*\nDatabases: SQLite, MongoDB*\n*courses yet to be complete."
}