{
    "name": "Birdseye",
    "email": "piyushkhandelwal1997@gmail.com",
    "phone": "+919672541707",
    "education": [
        {
            "university_name": "Manipal University",
            "course_name": "Member of Organizing Committee for various fests",
            "dates_attended": "Sept 2021",
            "marks_or_percentage": "",
            "additional_info": [
                ", Jaipur, India  \n \n \n \n                Aug 2015 – Aug 2019 \nHighlights: ; Coverage Photographer for key events throughout the years"
            ]
        }
    ],
    "work_experience": [
        {
            "company_name": "business development and key account management of large accounts.",
            "job_title": "",
            "dates_worked": "",
            "additional_info": [
                "KEY ACHIEVEMENTS",
                "",
                "• Certified by Market Research Society, UK in market research with Merit",
                "• Awarded a company sponsored trip to the Maldives in November’2019 for strengthening core business and supply chain",
                "• Headed Sri-Lanka business development and market research at Flynote to jump start a fresh destination in 2 weeks",
                "• Generated over 100,000 USD worth of revenue month on month"
            ]
        }
    ],
    "linkedin": "",
    "github": "",
    "projects": null,
    "certifications": null,
    "extra": null,
    "skills": "• Technical Skills: JMP (Statistical Analysis), NVivo (Qualitative Data Analysis), LinkedIn Sales Navigator, Salesforce, SugarCRM, \nSAS (Statistical Analysis) \n• Management Skills: Microsoft Office, Key Account Management (Large Accounts Ecosystem), Sales & Business Development, \nAdvertising Account Management, A/B Testing, Brand Management & Retailing \n• Language Competence: TOEFL 101/120, CEFR – C1 Equivalent  \n  \nCAREER HISTORY \n \nHenkel Ltd, Hemel Hempstead, United Kingdom                                                                                    \nHenkel is a leading solution provider for adhesives, sealants and functional coatings for consumers, craftsmen and industrial \napplications. It has a market cap of nearly 30 Billion USD with over 52000 employees globally in 79 countries. \n \nDigital Key Accounts Sales Graduate \n \n• Took responsibilities of an Account Based Marketing –\n• Mapped few of the largest accounts of Henkel’s Datacom and Telecom SBUs on LinkedIn Sales Navigator \n• Be the pivotal digital right hand of Global Key Account Managers handing clients like Cisco, Nokia and Ericsson. \n• Analyse key stakeholder networks of Global Key Accounts and cover untapped areas for marketing activation. \n \nHennes & Mauritz H&M, Milton Keynes, United Kingdom                                                                                        Nov 2021 – Aug 2022 \nHennes & Mauritz AB is a Swedish multinational clothing company head-quartered in Stockholm. It is known for its fast-fashion \nclothing for men, women, teenagers, and children. \n      \n   \nMumbai, India / Luton, UK\nSept 2022 – Nov 2022\nSocial Selling Manager as a graduate for large accounts ecosystem\n& Jan 23 - Present\n \n \nSales Advisor \n \n• Performed in-store sales advisory and operations within several apparel departments \n• Achieved a membership score of more than 60% throughout with 40% being store's average \n \nMedia.net, Mumbai, India  \n \n \n \n \n \n \n \n               Aug 2020 – Sept 2021 \nMedia.net is a leading global advertising company with one of the most comprehensive portfolios of advertising technology in \nthe industry across search, native, display, mobile, local, products and video.  \n \nAssociate – Publisher Development \n \n• Managed onboarding for over 400 potential accounts under Activation Vertical (US & UK Based Clients) \n• Leading activation vertical with more than 15% conversion rate of incoming leads \n• Supervised Account management for over 150 accounts in a span of 6 months \n \nUpgrad, Mumbai, India \n \n \n \n \n \n \n \n \n               Mar 2020 – June 2020 \nUpgrad is an online higher education platform providing rigorous industry-relevant programs designed and delivered in \ncollaboration with world-class faculty and industry. Merging the latest technology, pedagogy, and services. \n \nSales Consultant (Admissions Counsellor) \n• Accomplished more than 4000 USD sales in first month of joining \n• Bootstrapped online MBA vertical sales with recognisable success rate of over 12% conversion \n \nFlynote, Bengaluru, India  \n \n \n \n \n \n \n \n                  Jan 2019 – Feb 2020 \nFlynote is a curated marketplace for consumers and agents. It connects consumers with expert agents who design itineraries and \nhunt best deals on flights, hotels, cars among others. \n \nSales Team Lead (Experts Success Manager) \n \n• Applied performance data to evaluate and improve operations, target current business conditions, and forecast needs. \n• Accomplished overall sales growth of 15% quarter on quarter \n• Managed a sales team of more than 10-12 associates for a period of 7 months \n• Initiated and launched Sri-Lanka as a new destination within 14 days of end to end process"
}