{
    "name": "Bihar",
    "email": "ranipratibha@gmail.com",
    "phone": "+19347324583",
    "education": null,
    "work_experience": [],
    "linkedin": "",
    "github": "",
    "projects": "● Oct'18 – March’21: Research Assistant, Data Sciences and Analytics Center, IIIT-H \nTask: Mentoring the project students on various Data Mining topics. \n● Jan’16 – Sep'18: Research Assistant in Computational Core for Plant Metabolomics project, Data \nSciences and Analytics Center, IIIT-H \nTask: Mentored the project development team. \n● Jan’11 – Dec'15: Research Assistant, Language Technologies Research Center, IIIT-H \nTask: Worked in ILMT Treebank project with data preparation and data validation team. \n● Dec’09 – Dec’10: Research Assistant, Infosys SETLabs project, Center for Data Engineering, IIIT-H \nTask: Worked with the development team for healthcare document mining. \n● Aug’09 - Dec’09: Teaching Assistant, Database Systems course, IIIT-H \n● Dec’06 - March’09: Research Assistant, Center for Data Engineering, IIIT-H \nTask: Worked in Data Mining for Bioinformatics application group. \n● July’07 - Dec’07: Teaching Assistant, Numerical Analysis course, IIIT-H \nPROJECTS \n➢ Road Sign Detection (Blaize): In this project a Deep Learning based detection model was created \nusing PyTorch, LabelImg and Python Image libraries as the working tools for detecting road signs \n2 \nfrom images. I handled the data creation annotation maintenance and model performance \nevaluation and documentation tasks and also contributed to the model working code creation. \n➢ License Plate Detection (Blaize): This project created a Deep Learning based detection model for \nidentifying license plates from image data. Python Image libraries and PyTorch were the main tools \nused. I handled the data creation annotation maintenance and model performance evaluation and \ndocumentation tasks and was part of working tool code creation team. \n➢ Face Sentiment Detection (Blaize): This project created a Deep Learning based detection model \nfor identifying emotions from human faces present in the image data. Python Image libraries and \nPytorch were the main tools used. I handled the data creation annotation maintenance and model \nperformance evaluation and documentation tasks. \n➢ Automated Text Annotation Tool (Blaize): This project aimed at making a GUI to be used as an \nannotation tool which can give annotation label suggestions for the text entered by the user based \non existing annotated data. Python and BERT based finetuned model were the main tools of this \nproject. I was involved in the data creation annotation maintenance, model performance evaluation, \nfinal working code delivery and documentation tasks. \n➢ Smart Chat Agent (Blaize): This project involved making an NLP and ML based chat agent which \ncan understand user intention from his query text and guide him with dynamic recommendations \nand answers related to his generic and Blaize Studio related queries. It used Python, Git, Jenkins, \nKubernetes, NLTK, MongoDB, BERT based finetuned model for making the tool to be integrated with \nthe Blaize Studio project. I was responsible for the data creation annotation maintenance, model \nperformance evaluation and documentation tasks and was part of the final working code delivery \nteam. \n➢ Computational Core for Plant Metabolomics (sponsored by DBT, Govt. of India): This project \ndeveloped a web-based platform called Computational Core for Plant Metabolomics (CCPM) to cater \nto the need of a collaborative platform for the storage, analysis and sharing of metabolomics data \nproduced by researchers of this field. Web2py, HTML5, SQLite, R and MySQL are some of the \nimplementation technologies used. (Paper link) \n➢ Extracting knowledge from medical journals (Infosys SETLabs project): This project \ndeveloped methods for automatic extraction of useful knowledge from the medical journal \ndocuments which were unstructured in format. Mainly Unstructured Information Management \nArchitecture (UIMA), Eclipse, MySQL and Perl were used for implementation. The final product of the \nproject was patented by Infosys SETLabs. (Paper link) \n➢ Pro Kabbadi League Hackathon (organized by UpGrad in September 2019): Made models using \ndata cleaning, filtering and analytical concepts to predict various outcomes at the end of Pro \nKabaddi league tournament 2019. (Submitted solution link at Github) \n➢ Data Scientist Hiring Challenge (organized by HackerEarth in June 2019): Built Naive Bayesian \nmodel to classify product samples into product categories using their numeric and textual features \nand handling data sparsity problem while building model. \n➢ Study of Classification and Clustering problems in NLP: This project investigated various NLP \ntasks and the challenges involved with them which can be solved using classification and clustering \nmethods of ML. \n➢ Study of Convolution Neural Network: This project studied CNN as a classifier as well as a \ndimensionality reduction tool and compared its properties with other classifiers and dimensionality \nreduction methods. \n➢ Performance of Pattern Recognition algorithms on various datasets: This project studied \nperformance of various ML algorithms for the task of finding patterns from various datasets. \n➢ Data Cube Analytics: This project focused on finding measures to compare different cuboids of a \ndata cube on the basis of information stored in them. \n➢ Data Mining using Hadoop cloud: The project implemented MapReduce version of SPRINT and \nLinear discriminant function-based classification algorithms using Hadoop cloud framework. \n3 \n➢ Finding Emerging Communities in Web: Cyber communities are groups of content creators \nsharing common interest. The aim of this project was to locate such emerging implicit communities \nusing graph theoretic approach. The implementation was done in Perl and MySQL. \n➢ Statistical Approach to Clustering: This project explored the non-parametric approach of finding \nclusters, which does not require assuming number of clusters. The proposed method first finds seed \nclusters using the statistical distribution and then merges them using shared nearest neighbor \napproach to obtain the final cluster set. The implementation was done using Matlab. \n➢ Study of Correlation between Organizational Roles and Search Queries: This project found \ncorrelation between user's role and their search queries in an intranet environment using association \nrule mining method from intranet log data. The implementation was done in Perl and MySQL. \n➢ Mining Chess dataset to test the existence of a frequent pattern of moves in the games won by \nplayer playing with white pieces. The implementation was done in Perl and Shell. \nPHD THESIS \nTitle: Associative Context Classification in Natural Language Processing of Resource-poor \nLanguages \nAdvisers: Dr. Vikram Pudi, Dr. Dipti Misra Sharma \nIn this research work we found generic methods for Natural Language Processing (NLP) tasks without \nusing domain knowledge and domain resources for resource-poor languages. We developed semi-\nsupervised Data Mining methods using less/moderate size annotated data and proposed Context Based \nList (CBL) concept that groups items of some specific context. Using this concept, we developed novel \nassociative context classification method and used it for part-of-speech tagging (POS tagging) and word \nsense disambiguation (WSD) NLP tasks. Python was used for implementing the thesis work. \nMS THESIS \nTitle: Novel Bayesian Sequence Classifiers Applied on Biological Sequences \nAdviser: Dr. Vikram Pudi \nIn this thesis we studied the biological data analysis problem of predicting the family of a newly \ndiscovered sequence and presented two data mining based generic solutions: RBNBC and REBMEC. \nThese supervised classifiers did not use domain knowledge but performed comparable to the existing \nprobabilistic bio-sequence classifiers and can be applied to other domains. Thesis tasks were \nimplemented in Perl language. \nADVANCED COURSES TAKEN \n● Data Warehousing & Data Mining, Web Data & Knowledge Management, \n● Information Retrieval & Extraction, Cloud Computing, Data Compression \n● Pattern Recognition, Machine Learning, Artificial Neural Networks \n● Coursera Deep Learning Specialization courses on Convolutional Neural Networks \n● Coursera Deep Learning Specialization courses on Sequence Models \n● Python for Data Science, AI & Development course of Coursera \n● Git Essential Training course on LinkedIn Learning \n● Advanced AI: Transformers for Computer Vision course on LinkedIn Learning \n● Natural Language Processing with PyTorch course on LinkedIn Learning \n● TensorFlow: working with NLP course on LinkedIn Learning \nOTHER ACADEMIC ACHIEVEMENTS \n4 \n● Participated and volunteered in organizing BDA 2017 conference at IIIT Hyderabad. \n● Presented research papers in COMAD 2008, DSAA 2014 and ICON 2017 conferences. \n● Attended COMAD 2006, PAKDD 2010, ICON 2014 and VLDB 2016 conferences. \n● Conducted workshop on Data Mining for final year BTech (CSE) students in SVIT College, \nSecunderabad on 28 October 2016. \n● Received travel and registration grant from VLDB’16 conference organizing committee for attending \nVLDB'16 conference at Delhi, India in September 2016. \n● Received Google Travel Grant of RS 90,000 in September 2014 to present paper in DSAA’14 \nconference in Shanghai, China. \n● Participated in R&D showcase 2008-2010 and 2015-2019 at IIIT Hyderabad. \nRanked 1st among girls in the state in 10th board exam. \nPUBLICATIONS \n1. Pratibha Rani, Vikram Pudi. RBNBC: Repeat Based Naïve Bayes Classifier for Biological Sequences. In \nproc. of 8th IEEE International Conference on Data Mining (ICDM 2008), pp 989-994, \nDecember 2008. \n2. Pratibha Rani, Vikram Pudi. REBMEC: Repeat Based Maximum Entropy Classifier for Biological \nSequences. In proc. of 14th International Conference on Management of Data (COMAD \n2008), pp 71-82, December 2008. \n3. Pratibha Rani, Vikram Pudi. Classification of Biological Sequences. In Pattern Discovery Using \nSequence Data Mining: Applications and Studies, pp 111-135, IGI Global, 2012. \n4. Pratibha Rani, Raghunath Reddy, Devika Mathur, Subhadip Bandyopadhyay, Arijit Laha. \nCompositional Information Extraction Methodology from Medical Reports. In proc. of 16th \nInternational Conference on Database Systems for Advanced Applications (DASFAA \n2011), Proceedings, Part II, pp 400-412, April 2011. \n5. Pratibha Rani, Vikram Pudi, Dipti Misra Sharma. TagMiner: A Semisupervised Associative POS Tagger \nEffective for Resource Poor Languages. In proc. of Workshop on Interactions between Data \nMining and Natural Language Processing (DMNLP'14 @ ECML/PKDD 2014), pp 113-128, \nSeptember 2014. \n6. Pratibha Rani, Vikram Pudi, Dipti Misra Sharma. A Semisupervised Associative Classification Method \nfor POS Tagging. In proc. of 2014 International Conference on Data Science and Advanced \nAnalytics (DSAA 2014), pp 156-162, October 2014. \n7. Pratibha Rani, Vikram Pudi, Dipti Misra Sharma. A semi-supervised associative classification method \nfor POS tagging. International Journal of Data Science and Analytics, Volume 1, Issue 2, pp \n123–136, doi:10.1007/s41060-016-0010-5, Springer International Publishing, July 2016. \n8. Pratibha Rani, Vikram Pudi, Dipti Misra Sharma. Semisupervised Data Driven Word Sense \nDisambiguation for Resource-poor Languages. In proc. of the 14th International Conference on \nNatural Language Processing (ICON 2017), pp 503-512, December 2017. \n9. Vikram Pudi, Pratibha Rani, Abhijit Mitra, and Indira Ghosh. Computational Core for Plant \nMetabolomics: A Case for Interdisciplinary Research. In proc. of 2017 International Conference \non Big Data Analytics (BDA 2017), pp. 223-234. Springer, Cham, December 2017. \n \n5 \n10. Sreya Mittal and Pratibha Rani. RUSSE2018: Word Sense Induction And Disambiguation Method \nBased On Context-Based Lists. In proc. of RUSSE2018: A Shared Task on Word Sense \nInduction for the Russian Language@DIALOGUE 2018, June 2018. \n11. Vamshi Krishna Reddy G, Pratibha Rani, Vikram Pudi and Dipti Misra Sharma. Decision Tree \nEnsemble for Parts-of-Speech Tagging of Resource-poor Languages. In proc. of Forum for \nInformation Retrieval Evaluation 2018 (FIRE 2018), December 2018. \nREFERENCES \n● Dr. Vikram Pudi, Data Sciences and Analytics Center, IIIT Hyderabad, vikram@iiit.ac.in \n● Dr. Dipti Misra Sharma, Language Technologies Research Center, IIIT Hyderabad, dipti@iiit.ac.in \n● Dr. Kamlakar Karlapalem, Data Sciences and Analytics Center, IIIT Hyderabad, kamal@iiit.ac.in \n● Deepak Bijalwan, Blaize, Hyderabad, deepak.bijalwan@blaize.com \n● Arun Kumar Nagisetty, Blaize, Hyderabad, ArunKumar.Nagisetty@blaize.com",
    "certifications": null,
    "extra": null,
    "skills": "C, C++, Git, HTML, Jenkins, Jupyter Notebook, Kubernetes, LabelImg, Latex, Linux, Matlab, Matplotlib, \nMongoDB, MySQL, NLTK, NumPy, OpenCV, Pandas, Perl, PHP, PIL, Pycharm, Pytest, Python, Scikit-\nlearn, Shell, SQL, StanfordNLP, Visual Studio Code, Weka"
}