{
    "name": "Vodafone Ghana",
    "email": "",
    "phone": "",
    "education": [],
    "work_experience": [
        {
            "company_name": "• Board member and Audit Review Committee for Vodafone Ghana",
            "job_title": "• Strategy (Portfolio Strategy, Asset Strategy, New Growth Strategy,",
            "dates_worked": "",
            "additional_info": [
                "Partnerships, Business Optimisation, Spectrum auctions, financial",
                "valuations, due diligence for market entry)",
                "• Large scale cost transformation programs (£200 mn savings),",
                "Capex efficiency, Culture change",
                "• Finance controller for 11 opcos (€8bn revenue), Capex and opex",
                "controller for India (£2.0 bn)",
                "• New business launch and business transformation initiatives",
                "• Managing senior stakeholders (including VF Group Exco members)",
                "and large teams",
                "I am an MBA from Indian School of Business and a B.Tech in",
                "Mechanical Engineering from IIT, Delhi. During my term at business",
                "school, I also went on an exchange program to London Business",
                "School. Have done “Digital Transformation – Platform Strategies for",
                "Success” from MIT Sloan.",
                "Consistently rated as the top performer/top talent for 12 years at",
                "Vodafone, trained through global Inspire talent program and Finance",
                "Excellence Program.",
                "Experience",
                "Vodafone",
                "13 years 3 months",
                "Head of Corporate Development & Strategic Initiatives",
                "February 2023 - Present (6 months)",
                "London, England, United Kingdom",
                "Drive planning and integration of proposed merger of VF UK and Three UK",
                "",
                "Page 1 of 4",
                "",
                "",
                "Head of Strategy at Vodafone Group",
                "August 2020 - February 2023 (2 years 7 months)",
                "Finance Executive",
                "September 2018 - August 2020 (2 years)",
                "London, United Kingdom",
                "Finance Executive, Rest of World (SA, Internationals, Egypt, Ghana, Aus, Ken)",
                "(Sep’18-Current)",
                "• Regional"
            ]
        }
    ],
    "linkedin": "",
    "github": "",
    "projects": "viz. Semiconductor, Consumer Electronics, Metals and Apparels \n• Worked in five countries viz Singapore, Malaysia, Germany, USA and India\n• Exceeded client expectations which resulted in securing additional $2M\nproject from a leading semi-conductor client in Malaysia\n• Handled multiple accounts simultaneously, led cross-functional teams and\nmanaged daily operations between onsite and offshore teams\n• Captured business requirements, designed and developed large scale data\nmodels, implemented solution to resolve supply chain issues of material and\ncapacity planning",
    "certifications": null,
    "extra": "Valuations, Spectrum auctions, Capex reviews, Strategic planning, Asset\nmonetisation, Balance Sheet restructuring)\n• Running quarterly, half yearly and yearly IR processes and financial\ncertification process\n• Leading a team of four high-potential country managers and providing\ndecision support to the regional CEO/CFO/RLT. Managing stakeholders\nacross levels including Group CFO, Group Finance controller, Group M&A and\nwithin Opcos ranging from CFO to FP&A team  \n• Budgeting, Planning and reporting – Target setting, budget review,\nnegotiation with Opcos, Exco Ops Review\n• Region Governance including Board papers, Audit committee, Audit Risk\nPaper for board\nVP- Financial Planning & Analysis\nSeptember 2014 - September 2018 (4 years 1 month)\nMumbai Area, India\nResponsible for making investment decisions of > Rs 7,000-10,000 CR capex\nand managing c. Rs12,000 CR opex\nHead, Corporate Strategy\nMay 2010 - September 2014 (4 years 5 months)\nLong term asset investment Strategy (Spectrum, Spring, M&A)\n• Led the development of VIL spectrum strategy and three large scale\nspectrum acquisition programs (£2.7 bn)\n• Proposed the £700m investment plan for a major transformation project (post\nVerizon deal). \n• Developed the M&A strategy for VIL India, conduct first level commercial due\ndiligence for M&A proposals\n• Developed strategy of VIL’s position on Indus- Vodafone's JV company\nBusiness Strategy\n \nPage 2 of 4\n \n \n• Developed VIL long term overall strategy partnering with business operations\nand functions, developed cluster strategy to define strategic objectives for the\n23 circles, which are at different evolution levels and at market position\n•Conducted strategy boards with Indian Exco. Significantly contributed in\ndeveloping VIL strategy and keeping the management focused to identified\npriorities\n•Competitive and financial performance of large competitors \n• Advised the Indian regulatory team on VIL strategic priorities and supported\nthem with arguments to achieve VIL objectives\nSistema Shyam Teleservices Ltd\nProject Manager\nJuly 2009 - May 2010 (11 months)\n• Managed green field launch of voice and high speed data services -\nSuccessfully launched six key circles (Delhi, Mumbai, Karnataka, AP, Haryana\nand Maharashtra) \n• Conducted regular launch meeting with the management committee to\nprovide progress on all commercial areas (Marketing, Sales, Customer\nService, Finance and SCM)\n• Coordinated and liaised with all key stakeholders including CXOs, Circle\nHead, Circle functional heads and  ~40+ people across functions and circles\nfor launch activities for commercial areas\nDiamond Management and Technology Consultants\nSenior Associate\nMay 2006 - June 2009 (3 years 2 months)\n• Served six clients in telecom, new media and financial services across India,\nMiddle East and US\n• Extensive consulting experience in Business Strategy, Program Management\nand Performance Improvement issues\n• Advised clients on core strategy issues like growth strategy, business\nplanning, go/no-go decision for market entry and market assessment.\nHighlights include \n– Financial valuation of 3G and BWA  license as part of auction    strategy for a\nfast growing telecom player in India\n– Long term business planning of 2G business of a leading telecom player in\nIndia\n– Market assessment and business feasibility for a financial information portal\nin India\n \nPage 3 of 4\n \n \n– Customer positioning and marketing strategy for a newly launched business\nnews website\n– Market sizing of printing opportunities in India\n• Consulted clients on program management and process improvement issues.\nHighlights include  \n– Large scale program management of INR 400 M internet portal launch \n– Process Improvement in vendor management and IT service delivery\nmanagement\ni2 Technologies\nSr. Consultant\nJune 2002 - April 2005 (2 years 11 months)\n• Executed large-scale supply chain",
    "skills": "Forecasting\nRelationship Building\nQuarterly Reporting\nNidhi Aggarwal\nHead of Strategy at Vodafone Group, London\nLondon, England, United Kingdom\nSummary\nOver 19 years of"
}