{
    "name": "Blog",
    "email": "",
    "phone": "",
    "education": [],
    "work_experience": [
        {
            "company_name": "• Working on building solutions using Large Language Models and Generative",
            "job_title": "AI capabilities on Google Cloud- GenAI Specialist",
            "dates_worked": "",
            "additional_info": [
                "• Customer-facing Data Scientist, building machine learning solutions for",
                "customer use cases leveraging core Google Cloud AI platform and services.",
                "• Collaborating cross functionally with product team to perform industry",
                "research on machine learning use-cases and",
                "building technical assets for end-to-end pipelines",
                "• Co-leading initiatives for building tools for Responsible AI workflows",
                "• Led a team to develop Data Quality Assessment Framework to be widely",
                "used in Google Cloud AI teams",
                "• Working on demand forecasting models, MLOps pipelines, personalization",
                "models, DocAI, and VisionAI models, across retail, banking and manufacturing",
                "industries (confidential customers)",
                "",
                "Page 2 of 11",
                "",
                "",
                "• 20% – Working as a PM with the product team to develop features in Vertex",
                "AI platform (confidential)",
                "Illuminate AI",
                "Founder | Mentor",
                "March 2021 - Present (2 years 5 months)",
                "California, United States",
                "First of its kind volunteer mentorship platform for folks in Artificial Intelligence!",
                "Illuminate - AI is a platform built to connect people from the Artificial",
                "Intelligence Community.We believe knowledge grows by sharing. We are",
                "driven to connect mentors, who would like to give to the community, to",
                "mentees, who are seeking guidance and motivation. The mentorship program",
                "is not limited to a senior individual mentoring a novice but is it also open to",
                "peer-mentorship.",
                "There is a lot to learn!",
                "A platform is also for sharing thoughts and ideas in the space of Artificial",
                "Intelligence and its applications in real-world use-cases.",
                "Playlists available are Weekend Musings, AI Guild, What's Tuning and",
                "Cracking Data Science Interviews.",
                "O'Reilly Media",
                "Technical Reviewer - Editorial Board",
                "April 2021 - Present (2 years 4 months)",
                "Stanford Deep Data Research Computing Center",
                "Senior Data Scientist",
                "July 2022 - December 2022 (6 months)",
                "Deepchecks",
                "Open Source Developer Advocate",
                "April 2022 - December 2022 (9 months)",
                "AIM Leaders Council",
                "Member",
                "November 2021 - December 2022 (1 year 2 months)",
                "AI for Good Foundation",
                "Advisory Board Member",
                "July 2021 - December 2022 (1 year 6 months)",
                "",
                "Page 3 of 11",
                "",
                "",
                "International Association of Engineers",
                "Member",
                "July 2021 - December 2022 (1 year 6 months)",
                "The AI Education Project",
                "Advisory Board Member",
                "June 2021 - December 2022 (1 year 7 months)",
                "San Francisco Bay University",
                "Advisory Board Member",
                "May 2022 - November 2022 (7 months)",
                "IBM",
                "3 years",
                "AI & ML Innovation Leader - Business Development",
                "April 2021 - January 2022 (10 months)",
                "San Francisco Bay Area",
                "- Building Data and AI capabilities of Cloud Pak for Data, IBM Lead with",
                "offerings and partnerships by building data science and machine learning",
                "models to cater to the broader client, sales, and partner communities.",
                "• Worked cross functionally with product team, data science team and sales",
                "to research AI use-cases for clients by conducting discovery workshops and",
                "building demo assets to showcase the value of IBM Cloud services",
                "- Lead a team to generate new opportunities by proposing new features",
                "for IBM Cloud Data & AI product offerings based on industry research and",
                "fostering broader client, and product analytics",
                "- Leading post-signature activities for CSM, to ensure client"
            ]
        }
    ],
    "linkedin": "",
    "github": "",
    "projects": "quickly and seamlessly.\nData Scientist - Data Science & AI Elite\nFebruary 2019 - April 2021 (2 years 3 months)\nNew York, United States\n-Working on 6-8 week client engagements to implement SoA (state of the art)\nmachine learning models, and integrate them into their organizational workflow\nto put AI into action. \n- Led engagements with clients from multiple industries like health, finance,\nintergovernmental organizations (United Nations), non-profit organizations,\ninternational government bodies. \n \nPage 4 of 11\n \n \n-Managed cross-border client accounts and traveled to London, Dubai,\nIstanbul, Mumbai, and multiple states within the United States.\n-Submitted a patent for building a novel reinforcement learning model for\nmachine trading.\nPyTorch Lightning\nOpen Source Developer Advocate\nOctober 2020 - July 2021 (10 months)\nNew York, New York, United States\nGoldman Sachs\nData Scientist (Capstone)\nSeptember 2018 - December 2018 (4 months)\nGreater New York City Area\nCapstone project via Columbia University (With Jared Peterson @ Goldman\nSachs)\nDeveloping a model for finding the Similarity Indexes of various Medical\nInstitutes based on their clinical trial data using the open source AACT\nDatabase. (Text analytics and exploring alternative data)\nIBM Data Science and Advanced Analytics\nData Science and Machine Learning Intern\nJune 2018 - December 2018 (7 months)\nGreater New York City Area\nDeveloping Reinforcement Learning Model for Long & Short Trading and\nPortfolio Management.\nColumbia University Irving Medical Center\nGraduate Research Assistant\nJune 2018 - December 2018 (7 months)\nGreater New York City Area\nWorking on patient's EHR and time series data of heart rate, blood pressure\nand patient's health response during the operation. The goal is to develop a\nforecasting model to detect the seizure of patients; using multi-level model.\nThe time series data would be analyzed using dynamic time warping methods\ndue to varying lengths and unequal intervals of the data. \n \nPage 5 of 11\n \n \nData Science Institute, Columbia University\n1 year\nScikit Learn Contributor\nApril 2018 - December 2018 (9 months)\nGreater New York City Area\nGraduate Research Assistant\nJanuary 2018 - May 2018 (5 months)\nGreater New York City Area\nAnalysis and extension of scikit- learn ( Guide : Prof. Andreas Mueller)\nScikit-learn is a Python machine learning library containing a large collection\nof machine learning models, as well as evaluation metrics and tools for\nimplementing machine learning workflows.\nThe goal of this project is to analyze the current usage of scikit-learn on a large\nscale (i.e. the scale of all open-source code, even all public code), and extend\nthe library based on the findings; to identify usage patterns, problematic use\ncases, and ways to improve the interface. \nColumbia Business School\nResearch Assistant\nSeptember 2017 - January 2018 (5 months)\nGreater New York City Area\niTech Mission Pvt. Ltd.\nData Scientist Intern\nMay 2017 - June 2017 (2 months)\nNew Delhi Area, India\nDuring my internship as a Data Scientist I accomplished the following tasks:\n- Data collection and extraction using various websites like World Bank, UNDP,\nUNICEF etc.\n- Data filtering \n- Data visualizations using D3js predominantly along with Microsoft Power BI,\nTableau and Adobe Photoshop for Info graphics.\n- Writing tech blog correlating topics like GST, BRICS Meet, Ocean\nConference, Planet 50-50 with SDGs.\n- Extensive reading and research on data and whitepapers in SDG 13 and 14:\nClimate Change and Life below water respectively.\n \nPage 6 of 11\n \n \nWhilst my term, we worked on the project of 'The Ocean Conference\nChallenge' as well, for data analytics and visualization, for which we were\nawarded by the UN-DESA.\nMereex Services Pvt Ltd - India\nMachine Learning Intern\nDecember 2016 - May 2017 (6 months)\nNew Delhi, Delhi, India\nMicrosoft\nMachine Learning Intern\nMay 2016 - July 2016 (3 months)\nHyderabad Area, India\n- Worked with the Bing Team for Machine Learning and NLP.\n-  Worked on developing a Skype ChatBot for Redmond Campus, fulfilling 6\nbroad criteria.\n-  Coordinated with the Redmond team for understanding the functional and\ntechnical requirements.\n-  Worked with BotFramework in Microsoft Visual Studio (C#) on Azure,\nCognitive services, Bing Maps, NLP, luis.ai, REST APIs and machine learning.\nInternational Management Institute - IMI\nData Analyst Intern \nJanuary 2016 - February 2016 (2 months)\nNew Delhi Area, India\n-  Did extensive research on capacity utilization of goods and Index of\nIndustrial Production.\n-  Read many research papers and company white papers to gain knowledge.\n-  Made theoretical hypothesis regarding the IIP growth, and to prove the\nhypothesis, did data analytics.\n-  The analytics included Time Series and Wharton Index of Growth for\nCapacity Utilization of Goods in Indian Industry using Index of Industrial\nProduction.\nNational Informatics Centre - India\nData Research Analyst Intern\nDecember 2015 - February 2016 (3 months)\nDelhi\n \nPage 7 of 11\n \n \n- Data set of a restaurant-customer ratings was collected through internet\nsources. (data.gov.in)\n- The analysis had to be done to find the dependent factors which influence the\noverall rating, food rating and service rating of the restaurant. \n- Predictive analysis needs to be applied to find response of customer in a\ndifferent scenario. \n- In the pre-processing of the dataset, qualitative information was converted\nto quantitative data; including data cleaning.The dataset was converted into\nmultiple table using the database approach- entity relationship diagram.\n- Supervised learning methods of correlation, linear regression and\nANOVA was done. Later, unsupervised learning method was also applied.\nUnsupervised learning does not use previously known results to train its\nmodels. Rather, it uses descriptive statistics to examine the natural patterns\nand relationships that occur within the data and does not predict a target\nvalue. \n- Another data set of Mutual Fund Performance for 8 years was collected.\n- The growth rates of the mutual fund are influenced by various factors, which\nare mostly indirect, like the technological development in industries, industrial\ngrowth, gross profit margin in the industry etc. in which the mutual fund\ncompany has invested its bonds. For the customer to buy a mutual fund bond,\nthe Net Value of the bond should be high, so as the person who is investing\ngets higher returns.\n- For the purpose, predictive and time series analysis was applied for model\ngeneration.\nEY\nSocial Media/Business Analyst Intern\nJanuary 2015 - August 2015 (8 months)\nVirtual\nThe company hired me for social media and business analytics- highly\nconfidential.\n- The dataset was entirely generated by extracting information from the Twitter\nprofile of the clients for whom the analytics was performed. For the purpose,\nTwitter Streaming API (text mining) was used.\n- The data was wired to the RStudio using twitteR library and the analytics was\ncoded using R language. \n- Various analytical methods were applied, namely, word cloud where an\nimage composed of words used in a particular text or subject, in which the size\n \nPage 8 of 11\n \n \nof each word indicates its frequency or importance; sentiment analysis which is\na process of computationally identifying and categorizing opinions expressed\nin a piece of text, especially in order to determine whether the writer's attitude\ntowards a particular topic, product, etc. is positive, negative, or neutral.\n-  Later User Activity Monitoring (UAM) was also performed to visualize the\nactiveness of the user in making posts, sharing posts, liking and commenting\nusing info graphics.\n- All the data inferences were converted into one-sliders which consisted of all\ninformation as graphics for each client being inspected.\nInternational Management Institute - IMI\nMarket Data Analyst Intern\nJune 2015 - July 2015 (2 months)\nNew Delhi Area, India\nI did the project with Dr. Neena Sondhi, who has a diverse 20+ years of\ndiverse experience of teaching, research and consultancy. An alumnus and a\nmerit holder from the Faculty of Arts, University of Delhi, she has successfully\nmanaged senior administrative roles in the organization.  \nThe project was co-mentored by Dr. Chhavi Mehta who is a professor in IMI.\nShe has completed her PhD from IIT, Delhi and has done Empirical Financial\nand Accounting Research Program from IIM, Calcutta.\n- A survey was conducted among various Stock market investors to analyse\ntheir investment behavior.\n- The data collected was converted from qualitative to quantitative for ease in\nanalysis. Data cleaning  and pre-processing was performed.\n- The aim of the project was to analyse and build models for Customer\nSatisfaction and Profit Prediction & Enhancement for Stock Market.\n- The analysis was done using IBM SPSS.\nTata Consultancy Services\nMarket Data Analyst Intern\nMarch 2015 - May 2015 (3 months)\nChennai\n- Data from NSE and BSE websites of Sensex and Nifty was collected. \n- Data values of various parameters like gold rates, industrial production, textile\nrates, mining etc were extracted.\n- The purpose was to find a relationship, as to how the growth or decline in\nvarious industries can effect the Sensex and Nifty rates to go up or down.\n- Predictive modeling using regression and time series analysis was applied.\n \nPage 9 of 11\n \n \n- The analysis was done in IBM SPSS.\nTata Consultancy Services\nResearch And Development Intern- Cloud Computing \nDecember 2014 - January 2015 (2 months)\nNew Delhi Area, India\n- I worked for the client DirecTV, USA for modeling their transmission via cloud\nplatform.\n- Extensive research was done to understand the encryption algorithms, video\nstreaming, real time transmission using cloud computing etc.\n- A cloud architecture was designed to do receive data from satellite, perform\nvideo encryption and transmit it in real time to the receiver set top boxes.\nDelhi University\nResearch And Development Intern- MATLAB development \nJune 2014 - July 2014 (2 months)\nNew Delhi Area, India\n- Extensive research on forensic science and handwriting analysis was done.\n- Handwriting features and their dependency with the human personality was\nstudied. \n- A survey was conducted where uniform handwriting samples of families were\ncollected, father, mother, grandparents, kids and siblings; in order to analyse\nupon the characteristics of handwriting that are inherited.\n- Later, a software was developed using MATLAB, where handwriting text can\nbe recognized, similar to OCR and handwriting features like slant, kurtosis,\nskewness, margin gap, inter-word and inter-line spaces were analysed.\n- Our research and the results were well-appreciated by a lot of researchers,\nand we got our work published in International Refereed Journal of\nEngineering and Science.\nHP\nStudent Internship\nFebruary 2014 - March 2014 (2 months)\nChennai, Tamil Nadu, India\n#Internship in finance and management as a core subject\n# Software application and working techniques involving business strategies.\n# Focus on social entrepreneurship and cash flow during profit and loss in\nbusinesses.\n \nPage 10 of 11\n \n \n# Other aspects like conducting interviews, communication techniques and\ninventory management.Preparation of excel sheets for break-even point\ncalculation, cash flow, energy auditing and income statement.\nEducation\nColumbia University in the City of New York\nMaster of Science - MS, Data Science  · (2017 - 2018)\nVellore Institute of Technology\nBachelor of Technology (B.Tech.), Computer Science and\nEngineering · (2013 - 2017)\n \nPage 11 of 11",
    "certifications": "Professional Certification: Level 1 -\nCertified Data Scientist\nIBM Intellectual Capital/ Intellectual\nProperty Creator\nIBM Recognized Teacher/ Educator\nEnterprise Design Thinking\nPractitioner\nGoogle Cloud Certified Professional\nMachine Learning Engineer\nPublications\n\"Data Science as a Service on cloud\nplatform\"\n\"Inheritance of handwriting features\"\nReinforcement Learning - The\nBusiness Use-cases\n\"Hybrid cloud for",
    "extra": null,
    "skills": "Personal Branding\nResponsible AI\nData Science\nLanguages\nMalayalam\nTamil\nEnglish\nHindi"
}