{
    "name": "ahmedessamshelbaya",
    "email": "",
    "phone": "",
    "education": [],
    "work_experience": [
        {
            "company_name": "CEO at Vodafone UK",
            "job_title": "Proud to lead Vodafone in its home nation, keeping the UK",
            "dates_worked": "than 17 years of industry",
            "additional_info": [
                "Strategy",
                "Ahmed Essam Shelbaya",
                "London, England, United Kingdom",
                "Summary",
                "connected. Commercially astute Chief Executive Officer with more"
            ]
        }
    ],
    "linkedin": "",
    "github": "",
    "projects": null,
    "certifications": null,
    "extra": "Middle East and Africa.\nI have extensive experience in customer care, financial planning, and\nsales & marketing gained during my time as Vodafone Group Chief\nCommercial and Strategy Officer; CEO, Vodafone Europe Cluster;\nand CEO of Vodafone Egypt. \nI have particular expertise in global brand and marketing strategy,\nbig data and analytics and the delivery of new products and services,\nsuch as our new Consumer IoT range, Vodafone Smart Tech.\nLooking forward to making Vodafone UK an even greater British tech\nsuccess story.\nExperience\nVodafone\n17 years 10 months\nCEO Vodafone UK\nFebruary 2021 - Present (2 years 6 months)\nGroup Chief Commercial Operations & Strategy Officer\nOctober 2018 - February 2021 (2 years 5 months)\nCEO Europe Cluster\nSeptember 2016 - September 2018 (2 years 1 month)\nChief Executive Officer\nJuly 2014 - August 2016 (2 years 2 months)\nGroup Commercial Management Director\nApril 2013 - June 2014 (1 year 3 months)\n \nPage 1 of 3\n \n \nLondon, United Kingdom\nDevelop the Consumer Marketing strategic agenda, propositions and Go To\nMarket\nDevelop and deploy Customer Value Management capabilities and best\npractice across markets aimed at value management, retention; CVM, Pricing\nand Prepay capability in an integrated approach\nDefine and work with markets on strategic pricing. Provide best practice\nguidance on propositions and services pricing. Define and Manage the\nwholesale pricing framework. Ensure consistency of execution across\noperating companies\nDevelop and roll out customer profitability models, ensuring optimisation\nof the use of A&R investments for better profitability. Managing New A&R\nPropositions\nDefine Group Commercial strategy on key topics and trends (Roaming, Over\nThe Top [e.g. Skype, whatsapp], convergence) through working with different\ncommercial areas and markets.\nRegional Commercial Director - AMAP Africa, Middle East, Asia, Pacific\nRegion\nJanuary 2012 - March 2013 (1 year 3 months)\nLondon, United Kingdom\nWork closely with operating countries commercial teams to develop and\nexecute on commercial & brand strategy and specific commercial initiatives/\nchallenges \nLead for the Region on business development activity with small/medium\ntargets and in support of the Regional CEO on major business cases\nProactively drive commercial best practice sharing across the region and/\nor Europe; target and track execution of commercial practice with tangible\nbusiness impact\nLead and support the execution of Group Commercial priorities across the\nregion; identifying and coordinating Group resources and expertise to deliver\nspecific initiatives\nLead for Group Commercial on the assessment and upgrade of commercial\ntalent within the OpCos\nConsumer Business Unit Director\nMarch 2010 - December 2011 (1 year 10 months)\nDirect report to CEO, Responsible for Consumer Sales and Marketing as well\nas Marketing shared services\nCustomer Care Director\n \nPage 2 of 3\n \n \nJune 2007 - June 2010 (3 years 1 month)\nDirect report to CEO\nManaged more than 3000 employees in 5 Contact Centres and 43 Retail\nStores.\nOverall Responsible for Customer Service, Retail and Consumer Credit and\nCollections\nHead of CRM\nOctober 2005 - May 2007 (1 year 8 months)",
    "skills": "Mobile Communications\nCustomer"
}