{
    "name": "Malware Analysis",
    "email": "",
    "phone": "",
    "education": [
        {
            "university_name": "Banaras Hindu University",
            "course_name": "",
            "dates_attended": "2015",
            "marks_or_percentage": "",
            "additional_info": [
                "National workshop cum training program on Computing Techniques\nand Applications (NWCTP-CTA) during J, Computing Techniques and\nApplications · (2012 - 2012)\n \nPage 5 of 5"
            ]
        }
    ],
    "work_experience": [
        {
            "company_name": "Brane Enterprises Pvt Ltd",
            "job_title": "Senior Solution Leader",
            "dates_worked": "May 2020 - Present (3 years 3 months)",
            "additional_info": [
                "Hyderabad, Telangana, India",
                "I am working with Brane enterprises since May 2020, I helped my team to",
                "build various solutions in the domain of computer vision and deep learning. I",
                "am part of vision for visually impaired people. We developed smart glasses",
                "that can help visually impaired people to recognize objects, their colour and",
                "the distance from the person. Further, we fused the Geo spatial data and",
                "the vision to help them in navigation and to avoid obstacles. Together we",
                "developed solutions for face recognition for low resource devices, object",
                "detection for the large scale objects (>5000) and scene understanding etc.",
                "University of Montpellier",
                "Postdoctoral Researcher",
                "November 2020 - November 2021 (1 year 1 month)",
                "Montpellier, Occitanie, France",
                "I have recently joined the robotics division at LIRMM (University of",
                "Montpellier). I will be working on the European  Project (H2020) SOPHIA. As a",
                "part of the project I would be working on activity recognition that will be useful",
                "in the human robot collaboration.",
                "Intain - Building Intelligent Blockchains",
                "Lead Consultant",
                "January 2018 - May 2020 (2 years 5 months)",
                "",
                "Page 2 of 5",
                "",
                "",
                "Sweden",
                "At Intain innovation lab, we work on different aspects of artificial intelligence.",
                "We work on  deep neural network, computer vision, machine learning and",
                "natural language processing. We are streamlining the process of digitization",
                "using all these components. The major problem of digitization process is to",
                "handle the unstructured data source. The non linearity present in terms of",
                "different document layout, nomenclature, diversity in scanning, alignment,",
                "document quality, resolution, etc. we try to mitigate these risks using our",
                "state of the art algorithms. Our product In-D can address these challenges",
                "and mitigate the risk. Apart from the product division, we do have patent and",
                "publishing section in Intain where we encourage people to publish their work in",
                "global forums such as in renewed conferences, journals and patents.",
                "Umeå University",
                "Postdoctoral Research Fellow",
                "February 2018 - January 2020 (2 years)",
                "Umea, Sweden",
                "I am working on Human Robot Interaction. We have a family of Pepper Robot",
                "which are used as the testbed for our demonstrations. We are training them",
                "to understand their own limitations and ask human to collectively solve the",
                "problem. We are designing their cognitive model in such a way that they will",
                "learn from human demonstrations/examples",
                "HCL Technologies",
                "Deputy Manager at HCL Technologies",
                "February 2017 - January 2018 (1 year)",
                "Noida Area, India",
                "I worked with HCL Innovation Lab, Noida for almost one year. I lead",
                "the Artificial Intelligence division and executed several projects such as",
                "Information Extraction from the unstructured data sources, Document",
                "Classification and Information Localization, Object Detection, Face & Signature",
                "Verification System, etc.",
                "eClerx",
                "Associate Process Manager",
                "November 2015 - February 2017 (1 year 4 months)",
                "Mumbai Area, India",
                "At eClerx services limited, I worked as a full stack developer for machine",
                "learning based solution. As a developer, I deployed two solutions such as",
                "email classification where I used Bayes, ANN, SVM, KNN, etc. to train the",
                "",
                "Page 3 of 5",
                "",
                "",
                "system, on the other hand in the email information extraction, I used natural",
                "language processing specially named entity recognition to extract information",
                "from the mail communication.",
                "Indian Institute Of Information Technology",
                "Research Scholar",
                "November 2011 - November 2015 (4 years 1 month)",
                "Allahabad, Uttar Pradesh",
                "I pursued my Ph.D in Human Robot Interaction under the supervision of prof.",
                "G C Nandi from Indian Institute of Information Technology, Allahabad, India.",
                "Here is the sort description of my work.",
                "This thesis addresses four problems such as face recognition, face liveness",
                "detection, criminal",
                "identification and sketch drawing by humanoid robot. All these problems are",
                "solved with",
                "respect to the human robot interaction. The existing face recognition problem",
                "has been tackled",
                "with our proposed component based fragmented face recognition framework.",
                "The proposed",
                "framework uses only a subset of the full face such as eyes, nose and mouth to",
                "recognize a",
                "person. It’s less searching cost, encouraging accuracy and ability to handle",
                "various challenges",
                "of face recognition offers its applicability on humanoid robots. The second",
                "problem in face",
                "recognition is the face spoofing, in which a face recognition system is not able",
                "to distinguish",
                "between a person and an imposter (photo/video of the genuine user). The",
                "problem will become",
                "more detrimental when robots are used as an authenticator. A depth analysis",
                "method has been",
                "investigated in our research work to test the liveness of imposters to",
                "discriminate them from",
                "the legitimate users. The implication of the previous earned techniques has",
                "been used with",
                "respect to criminal identification with NAO robot. An eyewitness can interact",
                "with NAO",
                "through a user interface. NAO asks several questions about the suspect, such",
                "as age, height,",
                "",
                "Page 4 of 5",
                "",
                "",
                "her/his facial shape and size etc., and then making a guess about her/his face.",
                "A rough set based",
                "reasoning approach has been proposed to map the eyewitness imprecise",
                "knowledge to the",
                "existing criminal database. If the facial description is not matched inside the",
                "database, it is",
                "assumed that there is no previous information about criminal face exists. In all",
                "such cases NAO",
                "help Police sketch artist to create portrait of the criminal."
            ]
        }
    ],
    "linkedin": "",
    "github": ""
}