{
    "name": "Afaaf Adam",
    "email": "",
    "phone": "",
    "education": [
        {
            "university_name": "INTI International University",
            "course_name": "May 2012",
            "dates_attended": "April",
            "marks_or_percentage": "",
            "additional_info": [
                "& Colleges\n · (2020 - 2023)\nCentre for Higher Secondary Education\nA-levels, Science · ( - July 2014)\nHiriya School \nO'levels, Science · (2009 - 2011)\n \nPage 3 of 3"
            ]
        }
    ],
    "work_experience": [
        {
            "company_name": "MarComms Maldives",
            "job_title": "What began as a marketing assistant for Taste Magazine - a bi-monthly",
            "dates_worked": "November 2022 - Present (9 months)",
            "additional_info": [
                "skills over time while on the job.",
                "Experience",
                "Rashu.mv",
                "Producer + Host",
                "Malé, Maldives",
                "Southpaw Malaysia",
                "Videographer",
                "April 2022 - Present (1 year 4 months)",
                "Malaysia",
                "Freelance",
                "Content Writer",
                "2018 - Present (5 years)",
                "Raajje TV",
                "Video Journalist",
                "September 2019 - April 2020 (8 months)",
                "Malé, Maldives",
                "Staff Writer",
                "August 2017 - April 2018 (9 months)",
                "Male' City, Maldives",
                "Page 2 of 3"
            ]
        }
    ],
    "linkedin": "",
    "github": "",
    "projects": null,
    "certifications": null,
    "extra": null,
    "skills": "Campaign Management\nFundraising\nJournalism\nAfaaf Adam\nStudent at INTI International University & Colleges, Copywriter,\nVideographer at Southpaw MY & Host of This Week in Maldives\nPodcast\nSubang Jaya, Selangor, Malaysia\nSummary\nWHO AM I?\nBorn and bred in the tiny island nation of Maldives, I moved to the\nbig city of Kuala Lumpur in 2021 in order to pursue my passion for all\nthings creative. I am a self-proclaimed film buff, who loves to crochet,\ncosplay and play 8-ball pool.  \nWHAT DO I DO? \nCurrently, I host and produce a weekly podcast titled \"This week in\nMaldives\" for the news portal known as Rashu.mv. I also work part-\ntime as a videographer for Southpaw Malaysia - a Youtube channel\ncovering the local MMA scene in Malaysia. \nPrior to arriving in Malaysia for my studies, I joined Raajje TV as\na junior video journalist in the English News department; Later, I\nbecame a news anchor for the local news in English. During my time\nat the TV station, I learnt how to create news content under pressure\nbut I also realised my true passion lies specifically in creative story-\ntelling, whichever form it may take. \nWHAT YOU REALLY NEED TO KNOW ABOUT ME. I AM:\n1) A HARD WORKER - I have made good use of every semester\nbreak since I arrived in the country, taking every opportunity that\ncame my way to work in this field from copywriting to online content\ncreation.\n2) A PEOPLE-PERSON - To get a story, I have to talk to lots\nof people. I also enjoy making people laugh and feel fulfilled by\nvolunteer work. After high school, I joined the local Rotaract Club\nwhere I organised fundraisers and community service events such\n \nPage 1 of 3\n \n \nas weekly beach cleanups. During my time there, I served one term\neach as Treasurer and Secretary. \n3) CREATIVE - On a semester break, I interned in the pre-production\nand production phase of the Malaysian TV series \"Murder By\nMoonlight\". Working under the art & costume department, I had to\nimprovise with the tools and materials provided and create props\nwithin a time limit. Never had I been happier and more excited to\nhear the words \"figure it out yourself\"\n4) FAST-LEARNER: When I began most of my various jobs, I often\ndid not have relevant"
}