{
    "name": "Shubham Bhatt",
    "email": "shubhambhatt.jan18@gmail.com",
    "phone": "+919024367646",
    "education": [
        {
            "university_name": "Bachelor of Commerce\nRajasthan University",
            "course_name": "merce \n2015\nB. L. Public Senior Sec. School",
            "dates_attended": "",
            "marks_or_percentage": "",
            "additional_info": [
                "12th  Com, Rajasthan\n10th\n2015\nB. L. Public Senior Sec. School, Rajasthan\nCourses\nUser Experience Design"
            ]
        }
    ],
    "work_experience": [
        {
            "company_name": "Adobe Illustrator",
            "job_title": "",
            "dates_worked": "User Experience Designer with 2+ years of experience and a collaborative mindset,",
            "additional_info": [
                "Product Designing",
                "User Interface Designing",
                "Graphic Designing",
                "Tools",
                "Figma",
                "Adobe XD",
                "Adobe Photoshop",
                "Profile",
                "solving design problems in a user-centered and innovative way to create product",
                "and experience solutions based on business goals and user requirements.",
                "Brains Valley IT",
                "I work on a variety of"
            ]
        }
    ],
    "linkedin": "",
    "github": "",
    "projects": "creating user interaction touch points, identifying user needs, and executing all \nvisual design stages from concept to final hand-off to the developer.\n\nkey Responsibility : \nExperience design starting from discovery, delivery, and design evaluation Conduct \nuser interviews, develop personas, user journeys, task flows, wireframes, rapid \nprototyping, usability testing, and create user interfaces.\nFreelancing UI/UX\nkey Responsibility : \nProduct Design, Experience design, User Interface design, User journeys, Task \nflows, Wireframes, IA, Prototyping, and usability testing, User interview, AB testing.\nThe Design Trip\nWork with the user experience team in The Design Trip. The work involved creating \nproblem-solving high-quality designs starting from wire frames to visuals; \nGenerating concepts on basis of User research and creating workflows, \nstoryboards, and prototypes to communicate them, and dealing with the product \nmanagement and developer's teams for the implementation of the designs.\n\nkey Responsibility :\nExperience design, user journeys, task flows, wireframes, IA, rapid prototyping, and \nusability testing, User Interface design.",
    "certifications": null,
    "extra": null,
    "skills": "User"
}