{
    "name": "Sachin Sasi",
    "email": "sachnsas@gmail.com",
    "phone": "+918140811899",
    "education": [
        {
            "university_name": "National Institute",
            "course_name": "Bachelor of Design",
            "dates_attended": "Jan. 2018",
            "marks_or_percentage": "",
            "additional_info": [
                "Of Design\nJan. 2018\n (B.Des), Film/Video Production and Communication\nAhmedabad\n▪\nCompleted 2 short films, 2 documentaries, and 2 advertisements from script to screen\n▪\nAcquired hands-on experience and improved technical proficiency in film-making and production processes\nAWARDS,"
            ]
        }
    ],
    "work_experience": [
        {
            "company_name": "Sr. Creative Specialist, Brand Creative Strategy & Design",
            "job_title": "Achieved exceptional lead generation and click-through rates, resulting in conversions",
            "dates_worked": "Sep. 2018 - Mar. 2023",
            "additional_info": [
                "screenwriting, cinematography, video editing and sound design. My passion for storytelling drives me to constantly",
                "find new and creative ways to bring a story to life on screen. Currently, I oversee the entire video project process,",
                "including pre-visualization, indoor/outdoor and VFX shoots, working with animators and directing to ensure",
                "maximum output. I am confident in my ability to bring your vision to life.",
                "BYJU'S Think & Learn Pvt Ltd",
                "Bengaluru",
                "▪",
                "Overseeing project management and creative direction for all video formats",
                "▪",
                "Taking client brief and utilising a metric-based approach for ideation and content delivery",
                "▪"
            ]
        },
        {
            "company_name": "National Institute Of Design",
            "job_title": "Design Associate",
            "dates_worked": "May. 2018 - Jun. 2018",
            "additional_info": [
                "▪",
                "Experience in creating narrative videos, explainers, and testimonial interviews",
                "▪",
                "Expertise in film direction, cinematography, editing, and digital intermediate"
            ]
        },
        {
            "company_name": "Somfy India Pvt. Ltd",
            "job_title": "Associate Cinematographer",
            "dates_worked": "Mar. 2018 - Apr. 2018",
            "additional_info": [
                "Ahmedabad",
                "▪",
                "Developed a comprehensive story for sustainable textiles in the form of a short documentary",
                "▪",
                "Conducted interviews with artisans and weavers in remote locations of Ahmedabad and Kutch",
                "▪",
                "Gathered information to comprehend the collaboration between students and artisans",
                "▪",
                "Arranged and managed equipment, crew and shoot plan from pre-production to delivery",
                "Video Creator",
                "Ahmedabad",
                "▪",
                "Developed concept and screenplay for a promotional video",
                "ZR Productions",
                "May. 2016 - Jul. 2016"
            ]
        }
    ],
    "linkedin": "",
    "github": "",
    "projects": null,
    "certifications": null,
    "extra": "▪\nExcellerators Award - BYJU'S Achievers' Club, for consistent high quality across work products\nMar. 2022\n▪\nCinema Experimenta - Signs Film Festival, Federation of Film Societies of India-Keralam\nOct. 2015\no\n'Magic Print' (Design film) won John Abraham National Awards for cinema experimenta\n▪\nProfessional Skills: Creative direction; strategy; film direction; casting; recruiting; photography; cinematography;\nscreenplay; storyboard; research; content development; art direction; lighting; project management; sound design; video\nediting; colour correction; colour grading; director of photography\n▪\nSoftware Skills: Adobe Premiere Pro; Da Vinci Resolve; Adobe Audition; Adobe After Effects;\n▪\nInterests: Motorcycling; travelling; coffee; clubbing; exercise; film buff",
    "skills": ""
}