{
    "name": "ML",
    "email": "ryangilberttt@gmail.com",
    "phone": "+918459242358",
    "education": [
        {
            "university_name": "Master's in Computational Linguistics \nEnglish And Foreign Languages University",
            "course_name": "bad",
            "dates_attended": "01/10/2021 - 01/05/2023",
            "marks_or_percentage": "",
            "additional_info": [
                "[ 01/10/2021 - 01/05/2023 ] \nAddress: Hydera (India) \nWebsite: https://www.eﬂuniversity.ac.in \nPhonetics, Morphology, Syntax, Mathematical Linguistics, NLP 1 and 2, Psycholinguistics, Formal Language and\nAutomata Theory, Corpus Linguistics, Language acquisition, Human sentence processing, Semantics, HPSG,\nTagging and parsing, The Joy of Computing using Python.\nGoogle Data Analytics \nGoogle [ 18/10/2022 - Current ] \nAddress: (India)"
            ]
        },
        {
            "university_name": "Certiﬁcate course in Computational Linguistics \nDeccan College",
            "course_name": "",
            "dates_attended": "09/06/2021 - 09/08/2021",
            "marks_or_percentage": "",
            "additional_info": []
        },
        {
            "university_name": "Post Graduate and Research Institute",
            "course_name": "ber of credits",
            "dates_attended": "",
            "marks_or_percentage": "",
            "additional_info": [
                "[ 09/06/2021 - 09/08/2021 ] \nAddress: Pune (India) \nFinal grade: A \nNum: 2 \nOther language(s):"
            ]
        },
        {
            "university_name": "German \nLISTENING A1  READING A1  WRITING A1  \nSPOKEN PRODUCTION A1  SPOKEN INTERACTION A1  \nHindi \nLISTENING C2  READING C1  WRITING B2  \nSPOKEN PRODUCTION C2  SPOKEN INTERACTION C2  \nBachelor's In English Language and Linguistics \nSavitribai Phule Pune University",
            "course_name": "",
            "dates_attended": "",
            "marks_or_percentage": "",
            "additional_info": [
                "[ 01/07/2018 - 01/06/2021 ] \nAddress: Pune (India) \nWebsite: http://www.unipune.ac.in \nFinal grade: A \nLANGUAGE"
            ]
        }
    ],
    "work_experience": [
        {
            "company_name": "NLP .",
            "job_title": "functioning language based on visual icons, collaborate with developers and linguist consultants to produce rule-",
            "dates_worked": "Nord A1 [ 22/05/2023 - Current ]",
            "additional_info": [
                "Computational Linguist Intern",
                "Country: Sweden",
                "Main responsibilities: Working on integrating the feature to auto-detect the most important, least important and",
                "ordinary notiﬁcations and messages in an AI-watch.",
                "Activities:-",
                "1. Data Annotation: Accurately label and annotate data based on predeﬁned guidelines for pre-processing for",
                "2. Guideline Development: Reﬁne annotation guidelines and improve clarity.",
                "3. Collaboration and Communication: Work closely with the ML team and communicate eﬀectively.",
                "4. Documentation: Maintain records of decisions and issues encountered during the NLP tasks.",
                "5. Feedback and Improvement: Provide feedback to enhance annotation processes.",
                "6. Continuous Learning: Stay updated with linguistic , NLP and annotation techniques.",
                "7. Text cleaning with the help of NLP techniques.",
                "8. Crucial role in creating high-quality labeled datasets for machine learning models.",
                "Computational Linguist(Part-time)",
                "KomunIKON [ 29/04/2023 - Current ]",
                "Country: Switzerland",
                "Responsibilities: Use NLP techniques wherever required, help a team in developing the world's ﬁrst fully"
            ]
        },
        {
            "company_name": "NLP and Computational Linguistics expertise.",
            "job_title": "NLP Analyst",
            "dates_worked": "Service Pack Software Technologies Private Limited India [ 01/02/2023 - 01/05/2023 ]",
            "additional_info": [
                "based linguistic models and codes that improve the KomunIKON app's ability to eﬀectively suggest an",
                "appropriate vocabulary to users, enabling a motivated retrieval of icons starting from verbal input based on",
                "similarity and other semantic relations using Word-embedding NLP technique. Work with the IT team to",
                "implement ideas in the best way possible and conduct research and stay up-to-date with the latest advancements",
                "in computational linguistics. Provide insights and recommendations on linguistic aspects of the project based on",
                "Activity:- Working on generating a feature that automatically identiﬁes the synonyms of the user input and",
                "displays the relevant icon based on the description given in the database."
            ]
        },
        {
            "company_name": "annotation, Transcription, Diarization, Data preparation, Data Analysis, Group-work, Machine learning Models,",
            "job_title": "ML experts and developers to ensure compliance with relevant regulations and guidelines, emphasizing the",
            "dates_worked": "Nationality: Indian  Date of birth: 26/12/1999  Gender: Male",
            "additional_info": [
                "City: Hyderabad",
                "Country: India",
                "1.Responsibilities:- NLP Models and Techniques using NLTK, , Reinforcement learning, AI solution, Data",
                "Artiﬁcial Intelligence, Quality assurance, Speech analysis, etc.",
                "Ryan Gilbert",
                " Phone number: (+91) 8459242358",
                "Email address: ryangilberttt@gmail.com",
                "",
                "LinkedIn: https://www.linkedin.com/in/ryan-gilbert-579055196/",
                "",
                " Home: Hyderabad (India)",
                "2.Activities:- I actively collaborated with interdisciplinary teams to develop AI-based solutions for audio calls/",
                "Conversation moderation. primarily worked on Text cleaning, Text Analysis , Pre-processing for NLP tasks. I was",
                "responsible for supervising the team of interns who were working on data annotation and I played a crucial role",
                "in helping the ML team design and implement algorithms to improve customer acquisition. I worked closely with"
            ]
        }
    ],
    "linkedin": "https://www.linkedin.com/in/ryan-gilbert-579055196/",
    "github": "",
    "projects": "Rating the pronunciation quality of Indian users on a scale of 1 to 10 based on the given phonological parameters\nbased on British English for a developing AI tool. Book editing, Content writing (YouTube videos' transcription,\nsubtitles, and writing description for adult websites, setting academic questions papers on trending technical\njobs, script-writing for a short-ﬁlm on Covid-19,etc) Copy-writing, Conversation designing for an Al tool and more\nJunior Data Analyst \nForIT Media Networks [ 08/10/2021 - 10/12/2022 ] \nCity: Hyderabad \nCountry: India \nMain Activities:- Data Visualization, Data transformation, Data Analysis, Storytelling, Decision-making, Team-work.\nResponsibilities:- \n1. Collecting and organizing data from various databases, spreadsheets, and web analytics tools. \n2. Cleaning and preparing data for analysis, which may involve removing duplicates, correcting errors, and\nensuring consistency across data sets. \n3. Analyzing data using statistical and data visualization tools, such as Excel, Tableau, Google Spreadsheet,\nPowerBi. \n4. Creating reports and presentations to communicate ﬁndings and recommendations to stakeholders. \n5. Collaborating with other team members to develop and execute data-driven strategies.",
    "certifications": null,
    "extra": null,
    "skills": "Mother tongue(s): Marathi |  English(US Accent) \nDIGITAL SKILLS \nPython Programming /  R-programming /  Organizational and planning skills /  American Accent /  Analytical\nskills /  Written and Verbal skills /  Decision-making /  Critical thinking /  Strategic Planning /  Strong-\ncommunication /  google spreadsheets /  SQL /  Artiﬁcial Intilligence /    Machine Learning /  Python Libraries\n(numpy, pandas, scikit-learn, gensim, surprise, spaCY, NLTK, PyTorch, ...) /  Microsoft Oﬃce /  GUI frameworks /\nData Science | Data Collection, Data Processing, Data Analysis, Data Visualization /  Microsoft Excel /\nReinforcement Learning \nPROJECTS \nEXPERIMENT ON THE AMBIGUITY IN SENTENCE PROCESSING USING DMDX( a Windows-based\nprogram designed primarily for language-processing experiments.) \n[ 02/12/2022 - 07/12/2022 ] \nConducted this experiment with 10 native speakers of diﬀerent dialects of Marathi(an Indian language) with the\nhelp of linguistics analysis (Socio-linguistics, Psycho-linguistics, Syntax, Semantics and Stylistics).\nA project on NLP tools and Corpora in the mother tongue named \" Marathi\". \n[ 10/06/2021 - 10/08/2021 ] \nWorked on NLP techniques, NLP libraries, NLP tools, Corpus Analysis Tools like Concord module, and AntConc\nCorpus Linguistics and theoretical Linguistics approaches. \n[ 22/06/2022 - 22/07/2022 ] \nworked a text dataset to analyze and identify the patterns in the corpus with the help of a corpus analysis tool,\nConcordance."
}