{
    "name": "PRASHANT RAMESH",
    "email": "f20180332@goa.bits-pilani.ac.in",
    "phone": "+17038170634",
    "education": [],
    "work_experience": [
        {
            "company_name": "WhistleBlower - Web3 / Full Stack Blockchain",
            "job_title": "",
            "dates_worked": "Dec 2021 - Present",
            "additional_info": [
                "CareQuest - Web Development",
                "Jun 2020 - Aug 2020",
                "Handlr - Web Development",
                "Jan 2020 - May 2020",
                "",
                "WhistleBlower : Defending facts on the web | Github | A Web3 application that allows users to expose facts anonymously.",
                "Technologies Used : Solidity, Web3.js, IPFS, Truffle, Material-UI, MERN stack.",
                "Ranked #2 in Web3 Hacks organized by QuestBook.",
                "",
                "CareQuest : A load balancing platform for medical services aimed at bringing order to the chaos caused by COVID-19 | Github",
                "Technologies Used : IBM Watson, HERE Maps, Tesseract, PushBot, SendGrid, Firebase, mongoDB, nodeJS, Bootstrap, Heroku.",
                "Ranked Asia #2 in Programmer's Date - Asia's largest community-backed hackathon, shortlisted among top 32 teams for the preliminary",
                "global finals of the Better Health Hackathon: #CodeForCovid19, and Best use of Google Cloud in SigmaHacks 2.0 .",
                "",
                "Handlr : An interactive platform that displays semester wide timetable, exam schedule, details of the courses opted by the student,",
                "professor's contact info, and all other academic details in a personalized manner for all students of BITS Goa | Github",
                "Technologies Used : HTML, CSS, Bootstrap, JavaScript, Node.js, mongoDB, Scrapy, Excel.",
                "Used by over 2000 students across the campus on a regular basis.",
                "PROJECTS",
                "Rank 1 in Crack the COVID-19 Crisis Hackathon",
                "Jun, 2020",
                "Rank 9 in Cisco SecCon APJC CTF 2020",
                "Oct, 2020",
                "AIR 50 in National Engineering Olympiad 3.0",
                "Apr, 2020",
                "",
                "Built prototype for an AI based healthcare virtual assistant to reduce load on helplines, and provide accurate data during the pandemic.",
                "Team Rank #1 in the national finals of Crack the COVID-19 Crisis : The National Online Hackathon organized by IBM and NASSCOM",
                "",
                "Secured Team Rank 9 in the final round of Cisco SecCon APJC CTF 2020",
                "",
                "Secured an All India Rank 50 in Second Year Engineering category of National Engineering Olympiad 3.0",
                "COMPETITIONS",
                "Network Representative - Council for Student Affairs (Extended)",
                "Sep 2018 - Aug 2019",
                "",
                "Maintained network related grievances for my hostel as elected for the post of Network Representative",
                "POSITION OF RESPONSIBILITY",
                "Center for Technical"
            ]
        }
    ],
    "linkedin": "",
    "github": ""
}