{
    "name": "Andhra Pradesh",
    "email": "nagapooja.pendli@gmail.com",
    "phone": "+918498082259",
    "education": [
        {
            "university_name": "VR Siddhartha Engineering College",
            "course_name": "",
            "dates_attended": "2016-2020",
            "marks_or_percentage": "",
            "additional_info": [
                "(2016-2020). \n \nDate of birth: 15-Aug-1999"
            ]
        }
    ],
    "work_experience": [],
    "linkedin": "",
    "github": "",
    "projects": "• \n Hands-on experience in Front end Development with efficiency in Requirement Gathering, \nDocumentation, Development, Testing and Production support.  \n• \nMotivated, punctual and open-minded, adapts easily to various environments. \n• \nAbility to perform as an individual as well as in team by sharing knowledge and",
    "certifications": null,
    "extra": null,
    "skills": "• \nProficient in interpersonal skills including planning and execution to ensure smooth delivery throughout \nthe entire sprint.  \n• \nGood experience of working in Agile DevOps methodology.  \n  \nPROFESSIONAL EXPERIENCE  \n• \nOrganization: Tata Consultancy Services   \n  \n   TECHNICAL SKILLS  \n  \n1. JavaScript Frameworks(Vue Js, Angular) \n2. HTML, CSS \n3. Core Java, Java 8  \n4. Database MySQL \n5. Agile development \n \n  \n   Project  Experience  \n  \n Project #1: Find In Cainz (FIC/MPOS)   \n  \nOrganization : TCS Client: CAINZ \n       \nJava8, GitHub, Agile.  \n  \nDescription: The purpose of this project is to serve merchandising department (CAINZ Stores) to provide \nUser Interface application functionalities.  \n \n \n \n \n \nDesignation: Assistant System Engineer\nEnvironment & Tools : JavaScript Framework- Angular, HTML, CSS, Ionic, MySQL,\n6.   GitHub\n7.   AWS, Python - Basics\nExperience: 1.10 Years (March 2021 to Till Date)\n, PostGre\nRoles and Responsibilities:   \n• Developed User Interface Applications functionalism. \n• Worked as Front-End developer and designing applications as per the user free perspective. \n• Handled Zero Defect Delivery without any quality issues. \n• Pro- Active in fixing production issues. \n• Increased Client Satisfaction as it resulted in good design view and user free interface. \n• Involved in code modifications as per Changes Requests received. \n• Involved in Unit Testing support. \n• Prepared documents like Business Requirement Document, Solution Design Document, Process Flow \nStructure, etc. \n• Significant completion of tasks before the deadline. \n• Experienced in all stages like Requirement gathering, Documentation, Development, Unit testing and \nDeployment. \n• Participated in Daily Scrum meetings to monitor the progress, resolve issues and provide quick fixes. \n• Maintained Good Communication in team and Support Team. \n  \n Project #2: CORE SYSTEMS  (Development and Migration)  \n  \nOrganization: TCS  \nClient: CAINZ \nEnvironment & Tools: JavaScript Framework (VUE-JS), Python, AWS, Agile. \n  \nDescription: The purpose of this project is to serve merchandising department (CAINZ Stores) to provide \nUser Interface application functionalities. \n \nRoles and Responsibilities:  \n• Designing the screen layouts and functionalities as per User interface. \n• Developed user interface functionality applications. \n• Experience in developing code for designing screens in Vue-js. \n• Experience in writing jest utils test cases in Vue-js. \n• Worked in Implementing Axios Integration in Front-end. \n• Responsible for Handling all negative scenarios. \n• Involved in Requirement analysis and feasibility check. \n• Supporting Team in all activities to enhance best performance. \n \n   \n \n• \nProblem Solving Skills- This skill helped me to determine the source of a problem and effective solution.  \n• \nTime Management– It helps me to plan and organize activities in order to enhance performance.  \n• \nTeam Work – It is one of the Sought-after skills in the workspace and helps me for academic and \nprofessional success.  \n• \nResourcefulness- It helps me to find best and clever ways to overcome difficult situations.  \n• \nAdaptability – It helps me to able to adjust to new conditions.  \n \n   WAYS OF WORKING  \n• \nAdopted Secure Software Development Life Cycle model for the Projects.  \n• \nDaily Scrum calls for monitoring progress, expediting Backlog items and resolving Blockers.  \n \n \n   \n            \nMy SuperPowers\nACHIEVEMENTS\n• \nSecured Best Team Award from CAINZ account Onsite for successfully completing transition and \ndelivering more than estimated User stories on time and also has provided value adds which delighted \nthe customer. \n• \nReceived Appreciation Note from One Team CAINZ for the Best Performance in the Team. \n• \nTrained the resources in Front-End Technologies \n• \nGave KT sessions and Code Work Through Sessions for freshers in Team. \n   \n    PERSONAL DETAILS \n• \n• \nAddress: Plot No 411, Green Towers Apartments, Guntur-522 426. \n•"
}