{
    "name": "linkedin.com/in/hastak-desai",
    "email": "desaihastak2406@gmail.com",
    "phone": "+917041292196",
    "education": [
        {
            "university_name": "The Maharaja \nSayajirao University",
            "course_name": "Baroda",
            "dates_attended": "Month/Year",
            "marks_or_percentage": "6%",
            "additional_info": [
                "of \n, Vadodara \nThe Maharaja Sayajirao \nUniversity of Baroda \n \nApril 2019 \n \n85.6% \n \nSSC \nRaghuvir Vidhya Vihar, \nAhmedabad \nGujarat Secondary and Higher \nSecondary Education Board \n \nMarch 2016 \n \n88.17% \n \nPERSONAL INFORMATION \n \n \n \n \n \n \n \n \n \n \n \n \n \nDECLARATIONS \nI hereby declare that the above-mentioned information is correct up to my knowledge and I bear the responsibility for \nthe correctness of the above-mentioned particulars. \n \nHastak Desai \nDate: - 25th April 2023 \nFull Name \n: Hastak Arvindbhai Desai \nDate of Birth \n: 24th June 2001 \nLanguages Known \n: English, Hindi, and Gujarati \nAddress \n: A-404, Kavya Residency, Nr. Thakkarbapanagar Canal Road, \nNava Naroda, Ahmedabad-382350, Gujarat (India)"
            ]
        }
    ],
    "work_experience": [],
    "linkedin": "",
    "github": "",
    "projects": "Algorithmic \nCryptocurrency Trading \nPlatform \n As a member of a product development team for company's own product, I have \nbeen tasked with working on various aspects of the project, including frontend and \nbackend development, cryptocurrency data streaming, containerization, and \ndeployment. \n Our main aim is to utilize machine learning algorithms to assist cryptocurrency \ntrading for inexperienced individuals, providing an accessible platform that \nsimplifies the process for all levels of expertise. \n Project Technology stack includes:  \n Frontend: Antd Pro, dva, css, Typescript \n Backend: DjangoREST  \n Data streaming: RabbitMQ \n Containerization: Docker, Docker Compose, Kubernetes, Skaffold \n Deployment: GitHub Actions, AWS \n \nAI Cover Letter \nGenerator \n Working on the development of client’s project enables users to create customized \ncover letters based on a job listing they have found on LinkedIn. \n The project aims to streamline the job application process by developing a user-\nfriendly platform that automatically generates tailored cover letters based on \nspecific job requirements, saving users time and increasing their chances of getting \nhired. \n Integrated Open API and LinkedIn API to enhance the functionality of the \napplication \n Project Technology stack includes:  \n Frontend: React, CSS, MUI \n Backend: DjangoREST  \n Deployment: GitHub Actions, AWS \n \n \nFinancial calculator \n \n This client project is focused on developing a centralized repayment calculator for \nasset finance brokers, which will require minimal inputs to produce accurate \nresults. \n The calculator will generate an exact repayment amount if all necessary details are \nprovided, and a range of repayment amounts if some details are missing. \n The system will be adaptable to include other types of retail finance in the long \nterm. \n The financier settings will be adjustable, enabling users to make rate changes \neasily. \n Ultimately, the software will provide an efficient and user-friendly solution for \nstakeholders in the finance process. \n Project Technology stack includes:  \n Frontend: React, Redux, Tailwind CSS, Typescript \n \nACHIEVEMENTS & TRAINING \n Currently doing course ‘Learn React Router 6’ on Scrimba. \n Successfully completed course of ‘Front-End Web UI Frameworks and Tools: Bootstrap 4’ from The Hong Kong \nUniversity of science and Technology on Coursera.",
    "certifications": null,
    "extra": null,
    "skills": "organization. Willing to work as a key player in a challenging and creative environment. \n \nSKILLS \n \n \nArea of Interest \nFull stack Developer \nFrontend Technologies \nBackend Technologies \nLanguages \n HTML \n CSS \n Javascript \n Typescript \n Python \nFrameworks/ Libraries \n React \n React-Redux \n Tailwind CSS \n MUI \n Django \n DjangoREST \n \nOther Packages/ Tools/ \nTechnologies Known \n Git \n GitHub \n Jira \n Django Scheduler \n Django ORM with MySQL \n Cron Jobs \n RabbitMQ \n Redis \n Postman \n Docker \n Docker Compose \n Kubernetes \n Skaffold \n AWS \n \nSUMMARY \n Have 1.5+ years of industry experience in developing responsive and dynamic web applications using front-\nend technologies such as HTML, CSS, TypeScript, JavaScript, React, React-Redux, MUI, and Tailwind CSS. \n Strong programming skills, especially with python. \n Proficient in back-end development using Django, DjangoREST, and Django ORM with MySQL, and \nknowledgeable in containerization using Docker, Kubernetes, Skaffold, and Docker Compose. \n Familiar with various tools including Django Scheduler, Cron Jobs, RabbitMQ, Redis, Postman, and AWS \ninfrastructure maintenance and improvement. \n Utilizes Git and GitHub for version control and collaborating with cross-functional teams, and manages \nproject tasks and timelines using JIRA. \n \n \n \n \nEXPERIENCE \n \n \nF(x) Data Labs PVT LTD. \nSoftware Engineer \nJan 2022 to Apr 2023 \n(Includes 6 months \ninternship from JAN 2022 \nto JUN 2022) \n Developed responsive and dynamic web applications using a range of front-end \ntechnologies including HTML, CSS, TypeScript, JavaScript, React, React-Redux, MUI, \nand Tailwind CSS, combined with the power of back-end development using \nDjango and DjangoREST. \n Proficient in Django Scheduler, Cron Jobs, RabbitMQ, and Redis, utilizing these \ntools to schedule and manage tasks, efficiently handle messages and events, and \noptimize performance. \n Gained experience in containerization by working with Docker, Kubernetes, \nSkaffold, and Docker Compose for development and deployment purposes. \n Contributed to the maintenance and improvement of AWS infrastructure, making \nbug fixes and minor changes as needed, while ensuring scalability, security, and \nreliability of the cloud infrastructure. \n Leveraged Django ORM with MySQL to efficiently manage data models and interact \nwith databases, optimizing performance and ensuring data integrity. \n Demonstrated proficiency in utilizing the Postman tool to effectively test and \nvalidate REST APIs, ensuring optimal communication between front-end and back-\nend systems. \n Worked with cross-functional teams to design, develop, and deploy web \napplications. \n Conducted code reviews and provided feedback to team members. \n Proficient in version control using Git, including various features for managing \nsource code and collaborating with team members, and experienced in using \nGitHub as a platform for hosting repositories, managing code reviews, and \ncollaborating with other developers. \n Managed project tasks and timelines using JIRA \n \n \nRECENT"
}