{
    "name": "Photoshop",
    "email": "skalkiipwork@gmail.com",
    "phone": "+18549991202",
    "education": [
        {
            "university_name": "June 2014\nAmity University",
            "course_name": "Mechanical & Automation",
            "dates_attended": "June 2014",
            "marks_or_percentage": "",
            "additional_info": [
                "- B. Tech.\n\n– Noida"
            ]
        }
    ],
    "work_experience": [
        {
            "company_name": "Features and Support for CoCreate Product - React Frontend, Node and Django",
            "job_title": "Microservices.",
            "dates_worked": "Senior Software Engineer (Full Stack) at Clipboard Health (Feb ‘22 - May ‘22)",
            "additional_info": [
                "▪",
                "Migrated Ionic-Capacitor-React Frontend to capacitor upgrade and",
                "third-party-api integration through capacitor plugin..",
                "▪",
                "Worked on features and migration of monolith node services to Nest Js",
                "microservices.",
                "Technical Lead (Front-End) at Cerebry (Jan ’22 - Feb ‘22)",
                "▪",
                "Worked on the Preact (server side React) framework front-end.",
                "Senior Software Engineer at Pyxis one (Sep ‘20 - Dec ‘21)",
                "▪",
                "Single handedly Architected, Planned and Executed Scalable, Flexible and",
                "Modular Solution to DAM (Data & Asset Management) of Brands and Resizing",
                "Ads Creatives as a Creative Cloud Plugin of Adobe Photoshop developed with",
                "UXP. https://adobe.com /go/cc_plugins_discover_plugin?pluginId=d21f7166&",
                "workﬂow=share",
                "▪",
                "Delivered Algorithmic Solution to Automated Resizing of Ads Creatives as",
                "Artboards in Photoshop to any number of sizes with ease. https://adobe.com",
                "/go/cc_plugins_discover_plugin?pluginId=b733b9a5& workﬂow=share",
                "▪",
                "Single Handedly Architected & Delivered POC Solution to Create Animated Ads",
                "Creative on Web Platform just like Adobe After Effects (Image, Video, SVG Layers",
                "moving on customizable Bezier Curves with customizable Ease functions) and",
                "Solution to Render Video of the same at Backend to integrate with existing Web",
                "App.",
                "▪",
                "Lead and Mentor Entire Team to deliver Web App Solution to DAM Access and",
                "Image Editor from scratch. https://app.pyxiscocreate.com/",
                "Consultant at Absentia Virtual Reality Pvt Ltd (Jun ‘20 - Sep ‘20)",
                "▪",
                "Hired and Mentored Team to deliver Web App Solution to Asset Management for",
                "Brands at one place as extension to existing Solution to Targeting based on",
                "Performance Marketing.",
                "▪",
                "Architect and Delivered POC Solution to Image Editor as Web App and",
                "Resizing/Editing of Creatives made by same.",
                "Contract Software Engineer at Homelane (May ‘19 - Jun ‘20)",
                "▪",
                "Architect and Executed Solution to Migrate Internal Web App to Manage Order",
                "and Finances from Rigid PHP Frontend to Flexible and Modular React/Redux",
                "Frontend to integrate with existing PHP Frontend.",
                "▪",
                "Worked with Lead 3D Engineer to Architect POC Solution to Export Automated",
                "PDF Floor Plan for vendors from 3D Plan of Spacecraft App.",
                "Trainee at MountBlue Technologies (Mar ‘19 - May ‘19)",
                "▪",
                "Completed and helped colleagues complete high paced MERN Stack training and"
            ]
        }
    ],
    "linkedin": "",
    "github": ""
}