{
    "name": "Sachin Sasi",
    "email": "sachnsas@gmail.com",
    "phone": "+918140811899",
    "education": [],
    "work_experience": [
        {
            "company_name": "including pre-visualization, indoor/outdoor and VFX shoots, working with animators and directing to ensure",
            "job_title": "maximum output. I am confident in my ability to bring your vision to life.",
            "dates_worked": "",
            "additional_info": [
                "WORK EXPERIENCE",
                "BYJU’S Think & Learn Pvt Ltd",
                "Sep. 2018 – Mar. 2023",
                "Sr. Creative Specialist, Brand Creative Strategy & Design",
                "Bengaluru",
                "▪",
                "Overseeing project management and creative direction for all video formats",
                "▪",
                "Taking client brief and utilising a metric-based approach for ideation and content delivery",
                "▪",
                "Achieved exceptional lead generation and click-through rates, resulting in conversions",
                "▪",
                "Experience in creating narrative videos, explainers, and testimonial interviews",
                "▪",
                "Expertise in film direction, cinematography, editing, and digital intermediate",
                "National Institute Of Design",
                "May. 2018 – Jun. 2018",
                "Design Associate",
                "Ahmedabad",
                "▪",
                "Developed a comprehensive story for sustainable textiles in the form of a short documentary",
                "▪",
                "Conducted interviews with artisans and weavers in remote locations of Ahmedabad and Kutch",
                "▪",
                "Gathered information to comprehend the collaboration between students and artisans",
                "▪",
                "Arranged and managed equipment, crew and shoot plan from pre-production to delivery",
                "Somfy India Pvt. Ltd",
                "Mar. 2018 – Apr. 2018",
                "Video Creator",
                "Ahmedabad",
                "▪",
                "Developed concept and screenplay for a promotional video",
                "ZR Productions",
                "May. 2016 – Jul. 2016",
                "Associate Cinematographer",
                "Ahmedabad",
                "▪",
                "Created a hyperlapse music video for a Gujrati feature film."
            ]
        }
    ],
    "linkedin": "",
    "github": ""
}