{
    "name": "Clarisa Díaz Bernasconi",
    "email": "clarisadb@gmail.com",
    "phone": "",
    "education": [],
    "work_experience": [
        {
            "company_name": "Postproduction - Campaigns, Backstages, Storytelling, Youtube, Instagram and Facebook Ads",
            "job_title": "Video Editor in Chief",
            "dates_worked": "",
            "additional_info": [
                "Buenos Aires City Government",
                "Jan 2009 - Jan 2020 (11 years 1 month)",
                "Management of a group of editors and post-producers who made institutional videos and published",
                "them in the media.",
                "Editor - Post Production Coordinator",
                "Linead Camd S.A.",
                "Jan 2008 - 2020 (12 years)",
                "Post-production coordination in television campaigns (Government organizations and companies)",
                "Tasks performed: Editing (Adobe Premiere and Final Cut) and post production coordination.",
                "Preparation and monitoring of budgets",
                "Post Production Coordinator",
                "Documental \"Aventureros, soñadores, locos\" for INCAA Instituto de Cine y Artes",
                "Audiovisuales",
                "Jan 2011 - Dec 2011 (1 year)",
                "From the pre-production of the 8 chapters of the documentary to post-production, I coordinated the work",
                "teams at all stages, meeting the delivery deadlines in a timely manner. Monitoring of the budget at each",
                "stage of production.",
                "Clarisa Díaz Bernasconi - page 1",
                "Editor In Chief",
                "Rincones de mi tierra",
                "Mar 2007 - Feb 2008 (1 year)",
                "Coordinate editors and post producers of documentary segments for TV and video in the Mexican",
                "tourism promotion production company \"Rincones de mi Tierra\". www.rinconesdemitierra.com",
                "Tasks performed: Editing and post-production in Final Cut.",
                "Team Production (Mexico D.F.)",
                "Viacom",
                "Aug 2007 - Oct 2007 (3 months)",
                "I was part of the production team in the broadcast of \"Los Premios\" of Mtv Latinamerica in 2007",
                "Media Production Coordinator",
                "Acitron S.A.",
                "Mar 2007 - May 2007 (3 months)",
                "Post-production coordination in the final phase of the assembly of the documentary \"Havanyork\"",
                "Post Production Assistant",
                "America TV",
                "Jan 2007 - Mar 2007 (3 months)",
                "Coordinación de postproducción y en el área de Videotape durante la transmisión de los segmentos en",
                "vivo.",
                "Producer - Journalist",
                "Greenpeace",
                "Jun 2006 - Dec 2006 (7 months)",
                "The first Tv Show for Greenpeace in Argentina host by Celebrities. Search and contact 13 Argentine",
                "Celebrities.",
                "Coordination of outdoor recordings, arranging interviews for each report, search and selection of",
                "archive material, and coordination in the post-production of each program.",
                "Journalist - Content Producer",
                "Canal 7 Argentina",
                "Apr 2000 - Jul 2006 (6 years 4 months)",
                "Production of guests, coordination of the journalistic team, Coordination of the live broadcast.",
                "Production of special news reports, general interest and shows.",
                "Coordination of the mobile unit outdoors.",
                "Producer",
                "Canal A",
                "Jan 1999 - Apr 2000 (1 year 4 months)",
                "Production and realization of programs in the cultural channel \"Canal a\" for Álvarez y Asociados S.A.",
                "(currently \"Tranquilo Producciones\")",
                "Completed tasks:",
                "Clarisa Díaz Bernasconi - page 2",
                "Arrangement and production of interviews with figures of Latin American culture. Search and selection",
                "of archive material, coordination of event recordings and live broadcasts. Among the outstanding cycles",
                "are: \"Profiles, the faces of Latin America today...\", International Independent Film Festival, Special",
                "Program for the University of Buenos Aires: \"Why is Buenos Aires flooded\", Special programs for the",
                "signal \"I -Sat”: “Jack the Ripper and “Freemasonry”"
            ]
        }
    ],
    "linkedin": "",
    "github": "",
    "projects": null,
    "certifications": null,
    "extra": "Clarisa Díaz Bernasconi - page 3",
    "skills": "After Effects   •   Adobe Premiere Pro   •   Content Marketing   •   Online Marketing   •   Social Media Marketing   •\n  English   •   Video Post-Production   •   Video Marketing   •   Team"
}