{
    "name": "Specializing",
    "email": "dpkmarathe@gmail.com",
    "phone": "+918088936848",
    "education": [],
    "work_experience": [
        {
            "company_name": "Co-Founder/CTO, DFacto.AI (Dec 2022 - Present)",
            "job_title": "Developed a Fully Functional No-Code Analytics Fullstack Web Application for",
            "dates_worked": "",
            "additional_info": [
                "Business Owners featuring Generative A Integration, Scalability, Security, Payments",
                "Integration, Social Login Integration : https://dfacto.ai",
                "Generative AI : OpenAI/GPT3",
                "Backend : Java, Spring, Hibernate, MySQL",
                "Frontend : HTML5, CSS, Javascript, React",
                "Deployment : AWS Elastic Beanstalk, AWS Amplify, AWS RDS, AWS ACM",
                "Domain : GoDaddy, AWS Route53",
                "Payments : Stripe",
                "Social Login : Google Firebase",
                "Security : ACM/HTTPS, GWT for API",
                "Achievements : Raised infrastructure credits from AWS for $1000.",
                "Raised infrastructure credits from Microsoft for OpenAI/GPT3 for $2500.",
                "Co-Founder/CTO,Web3Works.in (Sep 2022 - Present)",
                "Developed a Fully Functional Fullstack Web3 DAO on Ethereum Blockchain, on an",
                "Enterprise grade Network from Alchemy.",
                "https://www.web3works.in",
                "Backend : Solidity(0.8.1), Remix, Truﬄe, Ganache, Metamask, Alchemy, Geth",
                "Frontend : Web3.js, Node, React",
                "Deployment : AWS S3, AWS Amplify, AWS Cognito",
                "● Developed Contracts in Solidity 0.8.1 and Deployed to Goerli Test Network.",
                "● Migrated the Contracts written in Solidity 0.8.1 (using Remix Web IDE) onto",
                "Solana, a Layer 1 Third Generation Blockchain network to yield Performance",
                "and Cost Eﬃciency for Write Operations and Lookups on Contracts between",
                "any 2 Veriﬁed Entities.",
                "● Governance : Provided Identity management and Veriﬁcation.",
                "● Product Demo can be found here :",
                "#SmartContracts On #Ethereum #Blockchain",
                "https://www.youtube.com/watch?v=ADIlOWXp9Pw&ab_channel=Web3Works",
                "Deepak Marathe",
                "Industry Experience",
                "Founder, Jnyana Consultancy [GST:29AXXPD1681J1ZU]",
                "(Feb 2020 - Present)",
                "Independent Consultant, remote post pandemic",
                "Roles/Designations :",
                "Unravel Data/USA/Remote : Chief Architect, Observability.",
                "A5 Labs/USA/Remote : Product Owner, Bonus Engine",
                "Indeed/USA/Remote : Lead, Big Data Migration",
                "● Invented a theorem in Data Engineering involving Consistency, Availability and Partitioning",
                "for a Data System that works on Polling to update the State. (Unravel Data Systems INC, Dr Shivnath",
                "Babu)",
                "● Implemented Case-Insensitive Search on ElasticSearch for majority of Attributes in Gaming",
                "Domain.",
                "● Designed and Delivered a DataLake product on top of Google Cloud BigTable using a",
                "Geographically Distributed, Remote team of 7 data engineers. (Python, Flask, Google Cloud Bigtable)",
                "● Migrated Data Warehousing ETL Workﬂows from Hive-SQL to Spark (Python, Scala) on AWS",
                "EMR/Azure DataBricks Infrastructure. Used Airﬂow/Google Cloud Composer/Azure Data Factory for",
                "Orchestration.",
                "● Assisted in Data Migration from an On-Premise Data Platform onto AWS. (Spark, Pig,",
                "MapReduce)",
                "● Optimized the Computation Time on AWS Athena by distributing the processing using the",
                "ppss tool in python.",
                "● Helped Migrate the Data from AWS S3 Data Lake to GCP BigQuery.",
                "● Developed Distributed Application to perform Window Based Aggregation on Streaming",
                "Data using Flink using data from Kafka and Visualised using Inﬂux Time Series Database and Grafana",
                "for Visualisation.",
                "● Developed and Deployed a Web Application to host the Blogs.( Django, Python, Heroku)",
                "● Developed NanoCube - Scalable, Distributed, Spatio Temporal DataCube",
                "Abstraction for Time Series Datasets Along with an Event Based Framework for Real",
                "Time Visualisation of Rolling, Additive Aggregation.",
                "● RESTFul Microservices APIs for Distributed Multi-Dimensional Spatio Temporal Time Series",
                "DataCube supporting Ingestion, Search, Scan Operations on GDelt Event Dataset.",
                "● Query Interface modeled on CNF implemented using Sparse BitSets.",
                "● Point and Range Queries over time, all/subset of dimensions with Pagination for Results.",
                "● Supports Interactive Aggregations over 10 years worth of gdelt data at current content",
                "generation pace. (dropwizard, java, gcp, docker,git)",
                "● MemoryMapped Files are used to eﬃciently retrieve data on disk, supporting 100 ms",
                "response time over 10 million data points, with a result page size of 100.",
                "● InMemory Index Periodically Persisted to Disk/Cloud Storage Object.",
                "● Distributed Processing for Machine Learning Production Pipelines Using Apache Beam on",
                "Google Cloud DataFlow, PubSub.",
                "Deepak Marathe",
                "Senior Software Engineer at Rippling, a YC",
                "Company (Dec 2021 - May 2022)",
                "● Developed APIs for Reporting, Analytics (Python, Django, MongoDB)",
                "● Improved Code Coverage to 95% by Systematic Refactoring to make the modules Unit",
                "Testable.",
                "● I quit my full time employment to pursue my Entrepreneurship ventures in Generative AI.",
                "Staff Software Engineer at Quartic.ai (Nov",
                "2019 - March 2020)",
                "● Optimized Distributed Rule Engine by 8X (Kafka, Drools, Scala, Spark,Postgres)",
                "● Improved Code Coverage to 90% by Systematic Refactoring to make the modules Unit",
                "Testable.",
                "● Implemented Data Retention Policies on ElasticSearch (Python, Django, Airﬂow)",
                "● Onset of Covid affected my Full-Time Employment with Quartic. I moved on to Freelancing",
                "working Remote.",
                "SDE3/Lead Software Engineer at Halodoc (Dec",
                "2018 - Dec 2019)",
                "Developed and Deployed Features in the Halodoc Backend System.",
                "Developed RESTful Microservices(Java, Dropwizard, Hibernate), Domain modeling on",
                "MySql, API development (Go-Lang) and deployment on Serverless Architecture (AWS",
                "Lambda).",
                "●",
                "Doctor Referral - Domain Modeling, implementation(java, dropwizard), stage and",
                "production deployment(AWS). Objective was to enable patients to have a second",
                "opinion with other doctors or the ability of consulting doctors to refer the patient to a",
                "specialist doctor.",
                "●",
                "Recent Doctors - For the users that have consulted with doctors via tele-consultation,",
                "recent doctors have to be shown to the user. The objective was to increase",
                "engagement with doctors. Used Go-Lang with AWS Lambda to generate the recent",
                "doctor list and store it as users' attributes.",
                "●",
                "Doctor Categories - Grouping the available doctors with categories - helps the user of",
                "the app search doctors in relevant categories.",
                "●",
                "Actively involved in debugging and resolving bugs in production.",
                "Deepak Marathe",
                "Product Engineer / SDE3 - Data",
                "Engineering at GO-JEK/Halodoc (Dec 2016 – Dec 2018)",
                "Worked towards building a Self-Serve Data Platform scaling to Millions per day of",
                "Transactional data in an Agile Environment adhering to Pair Programming and Test",
                "Driven Development.",
                "●",
                "Framework for Data Consumption from Kafka, ﬁltering based on data, and relaying it to",
                "pluggable sinks[console, database, http server] and evolved to plug dynamic sinks based on",
                "application conﬁguration from Consul. Fault tolerance and recovery using retry with",
                "Exponential Backoff semantics. Monitoring using Datadog/Statsd/JMX.",
                "●",
                "Data archival to cold storage(GCS/Secor) and analysis(Spark/Zeppelin).",
                "●",
                "Streaming",
                "Data",
                "Aggregation",
                "using",
                "[Kafka,Flink/Yarn,Inﬂux,Grafana].",
                "Creation",
                "and",
                "management of HA Flink cluster on Google DataProc Service. Remote submission/launch of",
                "data aggregators on ﬂink/yarn cluster.",
                "●",
                "Microservices: Customer Wallet Suspension Service for Fraud.",
                "Java/spark, consul/HashiCorp for conﬁguration, gradle as build tool, gitlab as version",
                "control and CI/CD. Used Hystrix dashboard/turbine for latency and fault tolerance, guava rate",
                "limiter",
                "for",
                "rate",
                "limiting",
                "with",
                "Instrumentation(Newrelic),",
                "monitoring(datadog)",
                "and",
                "alerting(slack/pagerduty).",
                "Senior Data Engineer at Intuit (Apr 2015",
                "– Nov 2016)",
                "Learned and Contributed to major"
            ]
        }
    ],
    "linkedin": "",
    "github": "https://github.com/deepakmarathe",
    "projects": "through Unit Tests, Functional Tests, Code Coverage.\nDeveloped Voice Capabilities to Intuit's ﬂagship product - QuickBooks Online using\nAmazon Voice Service/Alexa API on Amazon Echo hardware.\n●\nDistributed Conﬁguration Management Service\no\nClient using Archaius from Netﬂix. Guice dependency injection, testable code- code\ncoverage, unit test, integration test, mocking.\no\nREST server for conﬁguration service using AWS-EC2, Dropwizard framework,\nAWS-DynamoDB.\n●\nDragline: data copy tool from HDFS/Hive to Vertica.\no\nFeature implementation – conﬁguration validator, logging improvements, bug ﬁxes,\ncode refactor for code quality.\no\nKerberos, HP Vertica,\no\nUnit/Functional Tests for dragline: Improved code coverage numbers from 20% to\n80%.\no\nCI/CD for the project using Jenkins + Sonar.\n●\nTest Framework - API to generate Mock data for testing.\no\nData Source and Data Sink abstraction, extensible/pluggable data sources (Local FS,\nHDFS, S3, Vertica, Hive). Random data preparation using schema deﬁnition supplied\nvia conﬁguration and pluggable schema adapters. Support for Vertica data types.\n●\nSangria Console: Web Application for admin to blacklist/whitelist EINs\no\ndeveloped using Spring java + hibernate ORM tool. App deployed on tomcat.\nDeepak Marathe\no\nSSO integration and login module.\n●\nExtra contributions:\no\nHackathon - develop speech capabilities to Intuit's ﬂagship product - QuickBooks\nOnline using amazon voice service API to run QBO skill on Amazon Echo device.\nHost a rest server in AWS using Elastic Beanstalk.\nQBO Virtual Personal Assistant\nID: amzn1.echo-sdk-ams.app.caef4128-7866-4e4f-8f32-c7234f27e8d4\nhttps://developer.amazon.com/edw/home.html#/skill/amzn1.echo-sdk-ams.app.caef4\n128-7866-4e4f-8f32-c7234f27e8d4/en_US/info\no\nDevelop plugins to Intellij IDEA :\nhttps://github.com/deepakmarathe/EditorOpenFilesCountPlugin\no\nHome Audio System using Raspberry Pi : install VLC player, use LUA HTTP interface\nto control the home theater connected to raspberry pi, using a handheld device\nwhich has VLC player installed in it. (VLC remote).\nData Engineer/Senior Data Engineer\nat InMobi (March 2012 - March 2015)\nDeveloped ETL Pipelines for Batch Systems. Helped the team scale from handling a\nfew GB of data to a few hundred TBs contributing to a user base of hundreds of\nmillion. Built visualization tools for easy onboarding, analyzed large amounts of data\nto get insights on user patterns and helped business by building products atop\nthose.\n●\nData Ingestion and Curation:\no\nBuilt, deployed and managed data pipelines to ingest data from multiple sources.\nUsed HBase/HDFS for storage, Thrift-LZO for data modeling, and MR/Pig for ETL.\nAlso did some ad hoc analysis using Pig and Hive.\no\nAugmented and automated data pipelines using in-house workﬂow scheduler (now\nApache Falcon) built on top of Oozie. Conﬁgured a dashboard to collect and monitor\nmetrics using Graphana.\no\nWas on pager duty to maintain SLA of service.\n●\nAnalytics and Products:\no\nUnderstanding user interactions using data analysis:\n▪\nImproved\nability to target ads by extracting user visit patterns and\nsegregating users by devising scoring mechanisms to infer key metrics like\nDaily Active Users, Monthly Active Users over large data sets. Evolved it to a\nframework for custom Syntax Validations and Rule Based Classiﬁcation.\no\nUser Targeting suite: Interest targeting, Retargeting, Segment/Persona targeting).\n▪\nImplemented user classiﬁcation into various Personas - depending on\nbusiness decisions. Addressed challenges involved in User Proﬁle Creation,\nShipping to Local Data Centers, and Online-Cache population for ad serving.\n●\nExtra:\no\nParticipated in Hackathon conducted by InMobi: Developed a Data Pipeline Designer\nto address the needs of product analysts. Self-Serve is a Web based visual data ﬂow\ndesigner capable of performing data discovery and code generation for apache pig.\no\nParticipated in InMobi sports day and won Runner up trophy in Table Tennis men’s\ndoubles category.\nDeepak Marathe\nSystem Software Engineer at Hewlett\nPackard, STSD Bangalore (Aug 2010 – March 2012)\no\nApplication for Manageability of servers, named Replication Manager\n-\nActive/Passive Management of HP storage servers/ control the replication.\n-\nWeb Application, Java.\no\nPart of the Open Storage (OST) plug-in team.\n-\nOST plug-in implementation for HP D2D storage servers, to work with Symantec\n‘NetBackup’ solution, C/C++\n-\nIntegration of client side deduplication.\n-\nSetup and Maintained build system and Automation for HP OST.\no\nHudson as the CI tool for build automation.\no\nBuilds automation on windows using visual studio command line utilities, ant,\nwith code coverage tools integrated.\no\nLinux – rhel, suse build automation-using make.\n-\nIn charge of maintaining thread related features and common code base.\nACADEMIC PROJECTS\n●\nDesigned an Animation Package (in Java language) as part of a Computer Graphics project in the 4th\nsemester.\n●\nDesigned a project on database technologies (in java language) as a part of Database Systems,\ncomprising basic functionalities of a typical database system.\n●\nWorked on a mobile application “m-Bank” to mobilize the banking process with the help of j2ME.\n●\nWorked on the Web Application ‘Online Chess Club’ as a part of my curriculum project.\n●\nDesigned ERP software for “Adlabs Foto Fast”.\nINTERNSHIPS\n●\nSuccessfully completed a project on web-technologies involving Struts framework\n(MVC) at Tavant Technologies, Bangalore.\n●\nWorked on HTML, AJAX, Reporting Tools at iNAT Technologies located at NITK Campus, Surathkal.",
    "certifications": null,
    "extra": "●\nGenerative AI, GPT-3, GPT-4\n●\nWeb3 : Blockchain, Hyperledger, Tokens, SmartContracts\n●\nDistributed Computing : Data Processing at Scale, Streaming Data Processing, Complex Event\nProcessing, Real Time Analytics\n●\nDesign and Analysis of Data Structures and Algorithms.\n●\nObject Oriented Programming.\n●\nSpatial Sound Processing (VST, Spatial Workstation/Facebook Audio 360)\nHOBBIES\n●\nSoftware Development : https://github.com/deepakmarathe\n●\nEntrepreneurship, Angel Investor\n●\nVedic Astrologer\n●\nMusician\no\nInstrumental : Rumba Style Flamenco Music on a Nylon String Guitar :\nhttps://www.dailymotion.com/video/x4qmuke\no\nElectronic Music Production : Artist on Apple Music and Spotify, 2K\nShazams : https://open.spotify.com/artist/7u4oOi5IhlW4qHpsJghKih\nPERSONAL INFORMATION\n▪\nName\nDeepak Marathe\n▪\nPhone Number\n+918088936848\n▪\nE-mail\n▪\nDate of birth\n▪\nLinkedin\ndpkmarathe@gmail.com\nDecember 08, 1988\nhttps://www.linkedin.com\n/in/deepak-marathe/",
    "skills": "Technical Skills\n▪\nProgramming Languages : Solidity, SQL, Java, Python, Bash, Go-lang, NodeJS, Scala,\nC, C++, Ruby.\n▪\nFullStack\nSoftware\nDevelopment\n: Java(Spring, Hibernate, Dropwizard, Spark,\nMySQL), Python(Flask, Django, Postgres), Node(NodeJS, Mongo, Express, ReactJS),\nWeb3.js, Ajax, JQuery, HTML, CSS, Javascript, ReactJS\n▪\nBig Data Platform Engineering : Apache Kafka, Apache Flink, Apache Spark, Apache\nMapReduce, Pig, Hive, HBase, Cassandra, ElasticSearch/OpenSearch, Airﬂow, Oozie,\nDocker, Kubernetes, Helm, Chef, TICK (Grafana), ELK (Kibana)\n▪\nCloud Solution Architecture : AWS : (Lambda, Amplify, Beanstalk, DynamoDB, RDS,\nS3, Route 53, ACM,\nAthena, EC2, EMR, SQS, Cognito), GCP (BigQuery, DataProc,\nBigTable, FireBase), Azure (Azure Data Factory and Azure DataBricks), Databricks,\nHeroku, Netlify.\n▪\nArtiﬁcial Intelligence / Machine Learning : Generative AI(GPT-3, 4), Natural Language\nProcessing(spacy.io,OpenAI),Text-To-Speech(pyttsx3),Speech-To-Text(SpeechRecog\nnition), Time Series Forecasting (prophet, pandas, matplotlib), Classiﬁcation (numpy,\nscipy, sklearn),\n▪\nWeb3/Blockchain/SmartContracts\n:\nSolidity(0.8.1),Remix,\nTruﬄe,\nGanache,\nMetamask, Web3.js, Alchemy, Geth (Private Ethereum Blockchain).\n▪\nRule Engine : Drools\n▪\nAndroid : Optical Character Recognition Application\nto Extract Aadhar ID from\nImage.\n▪\nPlugin Development : EditorOpenFileCount Plugin for IntelliJ IDEA IDE\n▪\nSpeech Technologies : Alexa Skill for Intuit QuickBooks (Alexa Voice Services)\n▪\nAutomation : Spotify Music Streaming Platform Automation using Selenium.\n▪\nOperating System : Macintosh, Linux and Windows.\n▪\nSource Version Control : Gitlab, Github, Bitbucket\n▪\nContinuous Integration : Jenkins/Hudson, Sonar.\n▪\nUnit Testing : JUnit, TestNG, Mockito/PowerMock, PyTest\n▪\nDatabase : Postgresql, MySQL, DynamoDB, HBase/BigTable, MongoDB, Cassandra,\nElasticSearch, InﬂuxDB\n▪\nElectronic Music Production : Ambisonic Music (Spatial 360), Ambient Noise\nCancellation, Ableton Live, Reaper\nDeepak Marathe\nEntrepreneurship"
}