{
    "name": "Pottiyapuram",
    "email": "yoganathan781@gmail.com",
    "phone": "+919994113161",
    "education": null,
    "work_experience": [],
    "linkedin": "",
    "github": "",
    "projects": "Design and fabrication of Pin on Disc Wear Test \n In this project work an attempt to design and Fabricated the Pin on Disc Wear test used to \ncheck the disc surface condition.\nDesign and fabrication of Windshield Wiper Mechanism \n To design and fabricate a new mechanism to cover the completearea of the wind screen.\nDesign and fabrication the Interactive Hoverboard For Personal Needs \n A small Hoverboard with GPS tracking System used to buy and Deliver the Products Without any \nmanual efforts from one place to another place.\n \nFINAL YEAR PROJECT \nInvestigation on mechanical properties of Al 6061 Metal matrix composites \n In this project, made a study on composition of aluminium. which is lighter than regular grade \naluminium. Resulted with Hybrid metal matrix composition in Aluminium, Grade : Aluminium \n6061. Patent rights registered on this project.\n \nJOURNAL PUBLISHED \nJournal name : Investigation on mechanical properties of Al 6061 Metal matrix composites. \nSite : Scopus.com \nINDUSTRIAL EXPOSURE \n \nCompleted two weeks In-plant Training in Steel Power Plant, Salem.\n \nCO-CURRICULAR ACTIVITIES \n \nParticipated in Rally car design challenge (RCDC), Designed and fabricated a custom made \nQUAD BIKE and won prices under the category of Overall Championship in Quad category, \nCAE, Maneuverability, Acceleration, Overall Static and Dynamics.\nEXTRA CURRICULAR ACTIVITIES \n \nVolunteer work and community service\n \nPlaying football\n \nBoard games\n \nABOUT ME \n \nA good team leader as well as a team player.\n \nCan adapt to any kind of environment.\n \nCan handle any situation.\n \nPERSONAL DETAILS \nDate of Birth \n: 06/01/2000 \nAge \n23 \nBlood Group \n: O -ve \nLanguages known \n: English, Tamil (speak, read, and write) \nFather's name / Occupation \n: Arjunan. S / Farmer \nMother's name / Occupation : Sagunthala. A / Homemaker \n \nDECLARATION \nHereby, I declare that all the above given information are true to the best of my knowledge and belief. \n \nPLACE \n: \nDATE \n: \nSIGNATURE",
    "certifications": null,
    "extra": null,
    "skills": null
}