{
    "name": "https://www.linkedin.com/in/rishabh-kumar-35690533/",
    "email": "rishabh.hit@gmail.com",
    "phone": "+918892430039",
    "education": [
        {
            "university_name": "2011\n \nMaster of Technology in Data Science from International Institute",
            "course_name": "mation Technology",
            "dates_attended": "2014-2016",
            "marks_or_percentage": "",
            "additional_info": [
                "of Infor,\nIndia\n \nBachelor of Engineering in Computer Science Engineering from Maulana Abul Kalam Azad\nUniversity of Technology, India\nINTERNSHIP\nCisco System, India | Intern | Jan 2016 - Jun 2016 |"
            ]
        }
    ],
    "work_experience": [
        {
            "company_name": "Software Development in IT Industry",
            "job_title": "Senior Machine Learning Engineer",
            "dates_worked": "Jan 2019 - Present",
            "additional_info": [
                "Strong exposure to data science and analytics including statistical analysis, predictive modelling,",
                "machine-learning, clustering/classiﬁcation techniques and algorithms as well as analysis",
                "/manipulation of large data sets",
                "Expertise in Natural Language Processing for extracting content from discussions and messages",
                "End2end development of ML/DL models, starting with data tagging to deploying to model in live",
                "product using docker.",
                "Attained proﬁciency at Data pre-processing and text extraction, building robust Machine",
                "learning, Deep learning models, Neural Networks using Tensor Flow, Pytorch",
                "Deep knowledge of math, probability, statistics and algorithms",
                "Familiarity with AWS services like S3, DynamoDB, EC2",
                "Adroit in E2E SDLC with using languages, tools, and technologies like Node.js, C, Python, Mat",
                "Lab, Octave, Java, SQL, etc.",
                "TECHNICAL FORTE",
                "Programming Languages:",
                "C, Python, Matlab, Octave, Java",
                "Analytics Software Tool",
                "Scikit Learn, DataFrame, Numpy, Pandas, Matplotlib, Keras",
                "Web Development",
                "Node.js",
                "Database systems",
                "Mongo DB, Neo4J, SQL, MySQL, ElasticSearch",
                "Deep Learning Algorithms",
                "Transformers, LSTM, CNN, BERT, Attention Models, gpt-3",
                "Others",
                "Probability and Statistics, Linear Algebra, AWS",
                "SKILL SETS",
                "Data Extraction & Analysis | Natural Language Processing | Data Modelling | Machine Learning",
                "Techniques | Deep Learning | Artiﬁcial Intelligence | Neural Networks | Software Development Life",
                "Cycle | Team coordination | Query Management",
                "| Requirement Gathering & Analysis | Project",
                "Management |"
            ]
        },
        {
            "company_name": "Bert model, BRAT, light tag, neo4j, Attention Networks, Flair model, Flair word embedding,",
            "job_title": "Machine Learning Engineer",
            "dates_worked": "Aug 2016 - Jan 2019",
            "additional_info": [
                "Organization",
                "CloudSEK, India",
                "Technologies used",
                "Attention Networks, glove word embedding, Keras, tensor board, gpt3",
                "Key Result Area",
                "Created a model from scratch to extract custom entities related to our use case. The model can",
                "extract 8 key entities from text and is deployed and working in the live product.",
                "Create a model to detect Fraud and hacks mentioned in open world discussion and message",
                "data. The role of the model is to identify impactful cases for our clients and bring them to their",
                "knowledge.",
                "Created a model to segregate diﬀerent text into diﬀerent buckets and provide them as a tag for",
                "user to easily identify diﬀerent categories of threat impacting them.",
                "Created models for social media monitoring, checking and reporting proﬁles that are try to",
                "impersonate our clients on social media platforms."
            ]
        }
    ],
    "linkedin": "https://www.linkedin.com/in/rishabh-kumar-35690533/",
    "github": "",
    "projects": null,
    "certifications": null,
    "extra": "Assisted for a recommendation system in an Idea submission portal where the industrial\nproblems are given solutions, idea is built into a product, users can post and follow other\nideators, etc.\n \nPredicted potential client data to renew licenses for Cisco Products, de-normalized data from\ndiﬀerent systems, cleaned and pre-processed for applying Machine Learning algorithms\nFeb 2012 - Jun 2014\nSoftware Engineer | Technologies used: SQL, shell script\nOrganization\nTCS, India\nKey Result Area\n \nWorked for Deutsche Bank Support Project in the Testing Environment Service (TES) team\n \nWorked on the product which was helpful to analyse Market data, and make future predictions\n \nConﬁgured application data to be used by Volumetrix application to showcase categorized data\nbased on various parameters, and user requirement standards\n \nAutomated manual application tasks through batch and PL/SQL scripts for reduction in manual\nerrors, and decrease in work load\n \nAutomated the Web Logic environment setup by using Web Logic Scripting Tool (WLST)",
    "skills": null
}