{
    "name": "Rotana Alsharif",
    "email": "RotanaAlsharif11@outlook.com",
    "phone": "+447496968533",
    "education": [
        {
            "university_name": "Royal Holloway University",
            "course_name": "Bachelor of Arts in mass communication",
            "dates_attended": "2017",
            "marks_or_percentage": "",
            "additional_info": [
                "2017 – 2021  \n (Radio &TV) Excellent-First Honor -"
            ]
        },
        {
            "university_name": "king Abdulaziz University",
            "course_name": "",
            "dates_attended": "",
            "marks_or_percentage": "",
            "additional_info": [
                "References are available upon request"
            ]
        }
    ],
    "work_experience": null,
    "linkedin": "",
    "github": "",
    "projects": null,
    "certifications": null,
    "extra": "§ \nCollaborative Working \n§ \nBilingual (Arabic & English) \n§ \nAttention to detail \n§ \nRisk Assessment \n§ \nScript report \n§ \nScript analysis \n§ \nProblem solving \n \nSkills \nv Directed a radio program, whilst editing audio (Inc. Music). \n \n2021 - Script writer for an episode of The Banat Program - Al Majid Channel \nNotable Achievement: \nv My production was selected to air live on a the renowned Al Majid TV channel. \nResponsibilities: \nWritten the script and the dialogue of Banat tv program  \n \n2020 - Create Elephant in the room podcast - Apple Podcasts, YouTube & Soundcloud \nResponsibilities: \nv written and co-hosted the podcast which garnered over 5000 views. \n2019 - Member of the Programs and Activities Unit of the Photography and Production Club \nResponsibilities: \nv organised many events for university students with the photography and production club",
    "skills": "communication, interpersonal, and collaboration skills. Committed to producing high-quality content that \nmeets business objectives. \n \n \nCareer Summary \n \n2023 - Producer in a short film “Wishful Thinking”   \nResponsibilities: \nv Pre-production (hired the writer and worked with multiple drafts on the script) \nv Pre-production (hired the director and helped with the casting process and rehearsal)   \nv Pre-production (successfully organised and raised funds within our crowdfunding campaign) \nv Pre-production (social media management)   \nv Production (manging all the crew and cast while fixing all the problems during shoot days)  \nv Post- production (Making sure everyone is on the same vision for the final result)  \n2022 - First Assistant Director in pilot web series “Opps Baby” - Royal Holloway university    \nResponsibilities: \nv Pre-production (schedule, call sheet)  \nv Production (making sure the cast and the crew are on time, working with the director to make sure everyone is rolling, \nstarting the shoot from A-C (Action & Cut)  \n2021 - Red Sea international film festival organizer - Majid Al Futtaim Vox cinema \nResponsibilities: \nv Providing excellent customers service (tickets concession, cinema inspections)  \nv Worked in red sea film festival as an organiser and in the theatre operation. \n2021 - Trainee broadcasting director - Jeddah Radio station \nResponsibilities: \nv Curated and directed a mock program, which was assessed and complimented by a reputable director of Jeddah radio \nstation (Sultan alroqui). \n 2021 - Voice Over Artist for the short film (Saydat Kol Al Modon) - King Abdulaziz University \nResponsibilities: \nv Creating a high-quality voice over recording which graded distinction level. \n \n2021 - Program Director for “Between the hall and the radio” - Jeddah radio station \nResponsibilities: \n§ \nAdobe Premier  \n§ \nMovie Magic \n§ \nAudacity \n§ \nOffice Suite \n§ \nCanva \n§ \nTime management \n§"
}