{
    "name": "Ruth Uchechi - page",
    "email": "sharonruth457@gmail.com",
    "phone": "",
    "education": [],
    "work_experience": [
        {
            "company_name": "demonstrated my ability to enhance UX/UI and increase customer retention rates. My",
            "job_title": "focus is on creating effective solutions that are relevant and leveraging data to tackle",
            "dates_worked": "",
            "additional_info": [
                "intricate design challenges.",
                "",
                "Experience",
                "UX Researcher",
                "Montret",
                "Jan 2020 - Mar 2023 (3 years 3 months)",
                "• Led the UX design and research efforts for a number of"
            ]
        }
    ],
    "linkedin": "",
    "github": "",
    "projects": "• Worked closely with cross-functional teams, I conducted user research, \ndeveloped user personas, created wireframes and prototypes, and \nfacilitated user testing sessions \n• Conducted competitor analysis, creating design guidelines, and ensuring \nthat all designs aligned with the brand's identity. \n• Worked closely with developers to ensure that all design specifications \nwere met, and collaborated with the marketing team to develop a launch \nstrategy for the app. \n• Communicating research findings, creating reports, presentations, to share \nresearch findings with stakeholders, including developers, and product \nmanagers. \nRuth Uchechi - page 2 \n \n \n Mid-Senior UX Designer \nVebKard \nJan 2017 - Jan 2019 (2 years 1 month) \n• Stayed up to date with industry trends and emerging technologies to \ninform design decisions and improve processes \n• Led design sprints and facilitated workshops to generate and prioritize design \nideas. \n• Developed high-fidelity prototypes and conducting user testing to validate \ndesign solutions. \n• Created user personas, user journeys, and wireframes to communicate design \nsolutions. \n• Conducted user research and usability testing to gather insights and inform \ndesign decisions. \n• Advocated for user-centered design principles and processes across the \norganization.",
    "certifications": "Creative Problem Solving and Decision Making - Alison - Empower Yourself \n3896-24528812",
    "extra": null,
    "skills": "Problem Solving • Emphathy • User Research • Information Architecture • \nInteraction Design • Collaboration • Teamwork • Miro • Adobe Photoshop • \nUser Interface Design"
}