{
    "name": "Saumya Gupta",
    "email": "saumyagupta170400@gmail.com",
    "phone": "+19305244821",
    "education": [
        {
            "university_name": "BML Munjal University",
            "course_name": "BTech in Computer Science",
            "dates_attended": "2019-2023",
            "marks_or_percentage": "",
            "additional_info": [
                "Gurugram\n,\n2019-2023"
            ]
        }
    ],
    "work_experience": [
        {
            "company_name": "automated configuration files from excel sheet itself using Ruby on Rails. Getting hands-on in AWS, Postman, JIRA, Git, ROR",
            "job_title": "Software Engineer Intern",
            "dates_worked": "Nov 2022-May 2023",
            "additional_info": [
                "Yubi",
                "Chennai",
                "Building APIs from scratch for clients. Performing different levels of testing of the APIs. Building a platform ”Blitz-Scale” to generate the"
            ]
        },
        {
            "company_name": "Individually designed a Social Media Web Application for the company. Web UI framework used ReactJS, Backend was done using NodeJS,",
            "job_title": "",
            "dates_worked": "May 2021-July 2021",
            "additional_info": [
                "Coding Blocks",
                "WFH",
                "Web Development Intern",
                "ExpressJS, Storing and fetching the user's data and CRUD functionality was managed using MongoDB, GraphQL.",
                "DoEarn",
                "Varanasi",
                "Founder and CEO",
                "Apr 2020-Dec 2021",
                "Founded a web platform to help children earn their pocket money while studying by helping their peers in solving their doubts and enhancing",
                "their problem-solving. Used Digital Marketing to advertise the company. Helped 50+ students."
            ]
        }
    ],
    "linkedin": "https://www.linkedin.com/in/saumya-gupta-3b26491a5/",
    "github": "",
    "projects": "Digital Bank:\n- Built a Decentralised Web Application using Ethereum Blockchain. Implemented functionalities to Deposit, Withdraw, and take\nEthers as Loan. Language used for making smart contracts Solidity. Test Environment Ganache. Development Environment and Testing\nframework Truffle.\n  Music AnyTime:\n- Built a Web Application using Reactjs, Redux Toolkit, Tailwind CSS, API Integration.A fully-fledged music player where you can\nsearch,find lyrics, song exploration features, search popular music around you, worldwide top charts, and much more with better UI than\nSpotify.\n  Cryptoverse:\n- Built a cryptocurrency web application, showcasing all the information about known cryptocurrencies. State Management using Redux\nToolkit, Web UI using Ant Design, creating charts using Chart.js, and fetching data from multiple sources using RapidAPI.Application\nSoftware deployed on Vercel.\n  Meme Generator:\n- Built a web application that helps user to generate their own memes. Frontend using Reactjs.\nUseful Courses\nOperating systems, Database and Management Systems, Web Development, Understanding Business, Software Engineering, Remote\nSensing and Data Structures and Algorithms,Design and Analysis of Algorithms, Object Oriented Programming .\nHighlights\nBlitz-Scale - Lead and built an internal product (Software) of the company single-handedly which enables single-click integration and focuses\non reducing the developer efforts to zero by automating the entire configuration generation for each APIs. Technology hands-on Ruby-on-Rails,\nGoogle Appscript, API development, Frontend integration, Postgres",
    "certifications": null,
    "extra": null,
    "skills": "Technical Skill: Java, Python, JavaScript, HTML, ReactJS, Redux Toolkit, NodeJS, MySQL, DSA,Cloud Deployment (e.g. vercel),\nRuby on Rails, JIRA, aws-Face-Recognition, aws-Speech-Recognition, aws-ChatBot, aws-Lambda.\n  General Business Skills: Works well in a team, good at content writing, digital content creation, persistent problem-solver,\ninquisitive nature to drive improvements, innovative thinking, initiative-driven, communication skills,copywriting abd copyediting,\nreading books and have tried playing 3 to 4 different sports."
}