{
    "name": "M.Sc",
    "email": "sejalsanadi@gmail.com",
    "phone": "+447799159547",
    "education": null,
    "work_experience": null,
    "linkedin": "",
    "github": "",
    "projects": null,
    "certifications": null,
    "extra": "➢ Studied business administration, payroll, budgeting, and accounting. \n➢ Trained diligently in different operational areas to improve business knowledge. \n➢  Helped leadership develop and implement strategic action plans to achieve performance and \noperational    objectives. \n➢ Assisted with identifying qualified applicants, conducting interviews, and providing feedback to \ninform hiring decisions. \n➢ Generated sales and labour reports as part of daily operations. \n➢ Enforced adherence to company standards related   to   performance and attendance. \n➢ Handled administrative, operational, and sales need to support senior management. \n•     Operations Intern at Tasco Petrochem (December 2020 - September 2021). \n➢ Ensured all standard operating procedures are followed including cash handling, inventory \nmanagement, and loss prevention procedures. \nSEJAL SANADI   \nMobile:  +44-7799159547     \nE–Mail: sejalsanadi@gmail.com \n  \nLinkedIn: Sejal Sanadi \n  \n \n London, UK  \n      \n    \n➢ Completed all other assigned tasks and duties as directed by department leadership. \n \nC E R T I F I C A T I O N S  \n \n• \nData Science                                                                                                                                                                                      \n• \nDigital Marketing             \n• \nBusiness Analytics           \n• \nNext Generation Sequencing (NGS) \n \n \nSkills Set \n \n• \nAdaptable Communication Style \n• \nStrong Delegation & Leadership \n• \nAbility to Work in a Dynamic & Changing Environment \n• \nPlanning & Organisational Management Skills \n• \nTime management \n \n• \nCross Functional Collaboration \n• \nGoal Oriented Approach \n• \nProductive Enhancement \n• \nDigital Marketing \n• \nBusiness Analysis \n \nS O C I A L  E N G A G E M E N T S  \n \n• \nActive member of Khalsa College – Beach Cleaning Initiative \n• \nActive Member of Khalsa College – Orphanage Aid \n \nE X T R A C U R R I C U L A R  A C T I V I T Y  \n \n• \nTook part in college fest and assisted in conducting the fest \n \nH O B B I E S  \n \n• \nReading   Travelling   Yoga & Meditation",
    "skills": "• \nTeam player with the ability to work in multicultural environments; ability to thrive under tight deadlines and high-pressure \nsituations \n• \nAn ambitious & hardworking individual with excellent relationship management skills and the ability to manage time \neffectively; capability to work effectively in a fast-paced, cross functional, and sometimes highly pressured. \n \nE D U C A T I O N  \n \n• \nMBA Global Business, Coventry University, London Campus                                                                            ongoing \n• \nPGDM-International Business, L.N. Welingkar Institute of Mgmt. Research & Development \n \n2020 \n• \nM.Sc. (Bioinformatics), Guru Nanak Khalsa College of Arts, Science & Commerce (Autonomous) \n2020 \n• \nB.Sc. (Chemistry), Mumbai University \n \n \n \n \n \n \n \n2018 \n \nP R O F E S S I O N A L  E X P E R I E N C E  \n \n• \n Management Trainee at Piramal NextGen (October2021 –March 2022) \n \n➢ Learned aspects of business by shadowing senior management through daily functions. \n➢ Contributed to customer service"
}