{
    "name": "Davinci Resolve",
    "email": "ks.shamanth1701@gmail.com",
    "phone": "+918951816294",
    "education": [],
    "work_experience": [],
    "linkedin": "",
    "github": "",
    "projects": null,
    "certifications": null,
    "extra": null,
    "skills": "Video Editing:  More than three years of experience in editing . \nTools : premiere pro, Davinci Resolve. \n  \nMore than three years of experience with Blender in VFX and motion graphics creation \n  \nMore than three years of experience in Motion graphics creation in After effects  \n  \nDynamic typography and 2D VFX: After effects. \n  \nDirector of photography (DOP)/cinematographer (camera operating and lighting): \nI am aware of exposure technique, lighting units, grips, electricity requirement, diffusion materials \nand various way to control light to achieve desired result. \n  \nDigital intermediate (D.I) - Davinci resolve:  \nI am equipped with various techniques available in Davinci resolve to achieve desired result. \n  \nI have thorough knowledge of colour management in Davinci resolve \n  \nSound design: Pro tools, Fairlight- resolve \n  \nScript Writing \n  \nVisual effects. \n  \n \nEXPERIENCE \n \n  I have worked in an audio studio called Aarohana in Mysore as assistant sound engineer \n  I have handled end to end video productions be it live action shooting, Stock footage video \nproduction, graphic animation videos.  \n  I have worked as a cinematographer and editor and DI colourist in corporate videos \nand short narratives \n  I have experience in VFX production and VFX cinematography, as I have worked with \nAfter Effects and Blender for 3D VFX and learnt the ins and outs of VFX at a director \nlevel. \n  I have experience working with storyboard artists to translate ideas into storyboards, for \neffective communication and smooth workflow between people involved at different \nstages of video production. \n  I have experience in handling and overseeing sound designing, dubbing, sync sound \nrecording for many short narratives and know the importance sound in cinema. \n  I am currently working as a Video producer in Goodworker  \n \n \n \nWORK \n \n  \nThe Corporate video shot, edited and produced by me for TVS  :  https://vimeo.com/665212997 \n  \nVideo I produced and edited using original 3d and 2d  motion graphics I created :  \nhttps://vimeo.com/812443685 \n  \nTypography Ad for the services I provide: https://vimeo.com/696547994 \n  \nVideo I conceptualized and produced for an NGO using Stock footage and 2D AND 3D animation: \nhttps://vimeo.com/755088727 \n  \nMy Cinematography showreel: https://vimeo.com/499883466"
}