{
    "name": "Shreeyanshi Gupta",
    "email": "shrynshigupta06@gmail.com",
    "phone": "",
    "education": [
        {
            "university_name": "Abdul Kalam Technical University",
            "course_name": "Bachelor of Technology in Computer Science\nAug 2016",
            "dates_attended": "2016",
            "marks_or_percentage": "",
            "additional_info": [
                "KIET Group Of Institutions\n – Oct 2020"
            ]
        }
    ],
    "work_experience": [],
    "linkedin": "",
    "github": "",
    "projects": "Shopkart\n* Shopkart is an application which integrates our online and offline shopping experience through its website and\nmobile application.\n* Technologies Used: Node.js, MongoDB, React.js, Flutter\n* Team Project | Role: Backend Developer\nDSC KIET Website\n* The website includes detailed information about the events (boot camps, hackathons, coding contests, etc)\norganized by the team for the community and opportunities (internships, meetups) for them.\n* Technologies Used: HTML, CSS, Bootstrap\nCampus Dost\n* A guide built for the college campus which includes all the relevant information for campus members.\n* Technologies Used: Node.js, MongoDB",
    "certifications": null,
    "extra": null,
    "skills": "technical skills, collaborate with like-minded individuals, and further my career goals.\nTECHNICAL SKILLS\nLanguages\n: JavaScript, TypeScript, C, C++\nFrameworks\n: Node.js, Angular\nDatabases\n: MongoDB, MySQL\nFrontend Dev\n: HTML, CSS, Bootstrap, Tailwind CSS, Angular Material\nEXPERIENCE\nSoftware Engineer\nNov 2020 – Present\nDLT Labs\n• Designed and developed dynamic and responsive websites using HTML, CSS, Tailwind, and Angular Material.\n• Extensively worked on developing and integrating REST APIs and databases into the client-side applications.\n• Collaborated with different teams on multiple products that provide a one-stop solution to blockchain enthusiasts.\n• Actively participated in end-to-end product delivery, collaborating with cross-functional teams from initial\nplanning and development to testing, debugging, and deployments..\nSoftware Engineer Trainee\nFeb 2020 – Oct 2020\nNewgen Software\n• Worked on a hybrid mobile application for the client.\n• Troubleshoot issues and fixed bugs in the backend as well as integrate new functionalities to the existing\napplication."
}