{
    "name": "Sophia Bonser",
    "email": "sbonser14@gmail.com",
    "phone": "",
    "education": [
        {
            "university_name": "Heanor Gate Science College",
            "course_name": "Maths. \n \nObjective \nI am a highly motivated and ambitious individual",
            "dates_attended": "",
            "marks_or_percentage": "",
            "additional_info": [
                "• \nA-Levels: Physical \nEducation, Psychology \nand History (ABB). \nGCSE’s: 9, including B’s in \nEnglish and , passionate about \npursuing a meaningful career in marketing. Since graduating from the \nUniversity of Nottingham with a 2.1 in History, I have worked within \nsports, HR and most recently, marketing. \nAlongside my professional work, I am an active third division football \nplayer for Loughborough Lightning, with previous"
            ]
        }
    ],
    "work_experience": [
        {
            "company_name": "for Nottingham Forest, Derby County and Aston Villa.",
            "job_title": "With a quick learning ability and a determination to succeed, I thrive in",
            "dates_worked": "",
            "additional_info": [
                "a team setting and consistently exceed expectations. My friendly",
                "nature, exceptional communication"
            ]
        }
    ],
    "linkedin": "",
    "github": "",
    "projects": null,
    "certifications": null,
    "extra": "pressure situations and am adept at solving problems creatively and \nproviding effective solutions. My hard work both on and off the field \nhas instilled in me the confidence that I can bring value to any team \nfrom the very beginning. \n \nExperience \nThink Tutors, Junior Marketer \n• \nManaging all aspects of the marketing strategy, including \nplanning, execution, and analysis. \n• \nResearching and building relationships with external brands, \nwebsites and pages, to evaluate who could be beneficial to the \ncompany. \n• \nPlanning, creating and posting social media (Facebook, LinkedIn, \nInstagram and Twitter) to target high-net worth clients. \n• \nCreation of different Social Ad campaigns (LinkedIn and \nFacebook MetaSuite) to drive new and past website visitors to the \ndesired page. \n• \nRewrite of the website pages, ensuring that the page has a good \nSEO, relevant images that represent the pages information well. \n• \nCollaborating with various contractors, ensuring that Google Ads, \nwebsite implentation and reports are running smoothly. \n• \nCreating client-facing documents, such as weekly and monthly \nreports of students progress, tuition plans, and tutor proposals. \n• \nEnsuring that all tutors documentation and tuition agreements are \nup to date and in line with the most current legislation. \n \n \nLoscoe Chilled Foods, HR Assistant \n• \nAnalysing risk assessments, Standard Operation Procedures, \nemails, contracts and spreadsheets. \n• \nConducting research on the most recent health and safety \nrequirements and self learning new HR information. \n• \nPreparation and conduction of audits. \n• \nHandling confidential files and data and drawing up files for third \nparty clients. \n• \nInterviewing candidates for positions within the company. \nFootball Fitness, Coach \n• \nI have accrued over 70 hours of sport related volunteering, \nachieving a sports leaders qualification in the process.  \n• \nWithin the role I assisted the head coach with planning, organising \ndrills, player development and encouraging other pupils to join in. \n• \nEnsured that SEND children received individualised attention \nduring practices. \n• \nTeaching children the basic football skills and techniques, in \naddition to developing teamwork, sportsmanship and resilience. \nKey skills \n• \nSocial Media \n• \nResearch \n• \nReports and Analysis \n• \nCopywriting \n• \nExternal Marketing \nQualifications \n• \nDigital Marketing, Level 2 \n• \nHubSpot Academy, Social Media Marketing \n• \nMental Health First Aider \n• \nFirst Aider \n• \nIOSH, Managing Safely \n• \nLevel 7 FA Qualified Referee \n \nInterests \nSports \n• \nI possess extensive experience playing football at an elite level, \nhaving competed for renowned teams such as Aston Villa, Derby \nCounty, Loughborough Lightning, and Nottingham Forest. \n• \nI was also a football referee for many years, officiating local, \ncounty and national matches at academy level. \n• \nIn addition to my passion for football, I also find pleasure in \nrunning, cycling, swimming, and hiking. \nMusic \n• \nSince the age of 6, I have played the piano, achieving a Grade 5 \nin the instrument. \nTravel \n• \nI am a keen traveller and attempt to visit new places, cultures and \ncountries whenever possible. This summer, I look forward to \nbackpacking and hiking in Triglav National Park, Slovenia. \nCooking \n• \nI enjoy cooking as often as I can, with a particular love for Yotam \nOttolenghi, Sabrina Ghayour, and Gordon Ramsey.",
    "skills": "positive \"can-do\" attitude, enable me to tackle any challenge that \ncomes my way. \nDrawing from my past experiences and"
}