{
    "name": "SUNITA GHALE",
    "email": "sunitaghale55@gmail.com",
    "phone": "",
    "education": [
        {
            "university_name": "Harrow College",
            "course_name": "Medium School",
            "dates_attended": "2021 - 2022",
            "marks_or_percentage": "",
            "additional_info": [
                ", UK  \n \n \n \n \n      (2011 - 2014) \nHigher\nSchool Leaving Certificate - Graded English , Nepal \n \n      (2001 - 2009) \n \nOther Tools:  \nSEO Software Tools:  SEMRUSH, SE Ranking, Google search console, Yoast SEO, Ahrefs, Serpstat, \nSEOptimer, Screaming Frog, Ubersuggest, Keyword Hero \nSocial Media Management platform: Hootsuite, Sprout Social   \nOther: Canva, HubSpot, Mailchimp, Microsoft Word, Microsoft Excel, Microsoft PowerPoint \n \nReferences available on request."
            ]
        }
    ],
    "work_experience": [
        {
            "company_name": "",
            "job_title": "▪ Guest Relations Manager",
            "dates_worked": "(17th Jan 2023 - Present)",
            "additional_info": [
                "Trainee - Broadway Infosys, Nepal",
                "Analysing latest digital marketing trends and utilising those trends to create a marketing campaign.",
                "Built a website (eventskhoji.com) using WordPress and published blogs into it.",
                "Performed both On- page & Off- page SEO to boost visibility & traffics to the website, while continuously",
                "improving user accessibility.",
                "Created a Digital Marketing Hub 2023 Facebook page and promoted social media advertisement contents",
                "focusing on targeted audience group. Personal accounts for Instagram/ LinkedIn/ Twitter/ YouTube were",
                "utilized for social media optimisation.",
                "Monitoring website performance via Google analytics and using those analytics for strategic planning.",
                "Crowne Plaza & Holiday Inn Express T4, London",
                "(Jan 2019 - Nov 2020)",
                "Dual IHG branded property in London Heathrow T4 - 761-bedroom property (Crowne Plaza 304) & 457",
                "Holiday Inn Express T4.",
                "(Dec 2019 - Nov 2020)",
                "Oversee and coordinate all arrivals and departures of special guests (VIPs, Sas, etc) whilst",
                "ensuring they receive an outstanding, seamless, 5-star service in all interactions with the team",
                "members.",
                "Coordinate and manage communication between guests and staff and follow up to ensure we",
                "resolve customer concerns.",
                "To motivate, drive and monitor the FOH team with regards to all up-selling opportunities, IHG",
                "enrolments and customer success Stories - always going the ‘extra mile'.",
                "Regularly analyse IHG Heartbeat score (CSM Metrics) and leverage the reports to achieve highest",
                "guest satisfaction level.",
                "Monitor and respond to TripAdvisor, Bookings.com, Hotels.com, IHG booking customer",
                "feedback.",
                "Skills: Excellent communication skills, problem solving, multitasking,"
            ]
        }
    ],
    "linkedin": "https://www.linkedin.com/in/sunitaghale/",
    "github": "",
    "projects": null,
    "certifications": null,
    "extra": "▪ Reception Supervisor                                                                                       (July 2019 - Nov 2019) \n  \nLeading the reception team on shift to enhance guest's stay experience by welcome, check in, \ncheck out, special requests, room allocations and informing the team of any special events or VIP \nGuests in the hotel.  \n  \nEngaging with guests to ensure they are made to feel comfortable and addressing any of their \nneeds/complaints promptly. \n  \nCoordinating with other departments to ensure consistent standards are maintained. \n  \nMonitor the appearance, standards, and performance of receptionists with an emphasis on \ntraining and teamwork to achieve their objectives/ targets and development goals. \n  \nWorking as a duty manager in an allocated shift when required. \nSkills: People management, Interpersonal skills, Multitasking, Attention to detail, Team player, \norganisational skill \n \n▪ Front desk Receptionist \n \n \n \n \n \n   (Jan 2019 - June 2019) \n  \nPerform all check-in and check-out tasks adhere to IHG brand standard. \n  \nProvide information about hotel, available rooms, rates, and amenities. \n  \nLiaise with housekeeping staff to ensure all rooms are clean, tidy, and fully functional. \n  \nEnrol guest in IHG loyalty programme and upsell additional services. \n  \nDealing with special requests, such as room service, taxi bookings or wake-up calls. \n \nCustomer Service Supervisor at Wasabi Sushi & Bento \n \n \n  (April 2017 - Dec 2018) \nTeam leader at Mr Chan's Chinese Restaurant \n \n \n \n    (July 2011 - Feb 2017)",
    "skills": "planning and executing successful marketing campaigns across numerous digital channels. Capable \nof conducting market research and an audit that results in strategic planning for boosting website \ntraffic, generating leads, and improving ROI with good understanding of Google Analytics, AdWords, \nand other marketing tools. Good communication, teamwork, management, and the ability to \noperate under pressure are all acquired through academic and hospitality"
}