{
    "name": "Suraj Prakash",
    "email": "surajprakash.goodwill@gmail.com",
    "phone": "+917488181685",
    "education": [],
    "work_experience": null,
    "linkedin": "",
    "github": "",
    "projects": "∗ − − > Employee Management System | Core Java (Swing and AWT), MySQL, JDBC\nMajor  Link\n  Employee Management System Java Project allows us to manage all employee information in a database where you can\ncheck and update and view employee details and can delete them in case an employee leaves the company.\n  For a further and deeper understanding, I even referred to some articles, creators, websites and blogs.\n  Technologies Used: Core Java, net beans, concepts of swings and applets\n  Database Used: MySQL\n∗ − − > Quiz-Application | Java, Desktop Based Application\nMinor-1  Link\n  It is a Desktop Based Application with the help of Java Swing, core Java and Abstract Window Tool-kit.\n  UI and frame is built with the help of swing and awt, Core Java concept used like OOPs, method overloading,\noverriding, Inheritance, Abstract Class, Graphics Class etc.\n  Here 4 class I made respective to its frame i.e login, Rules, Quiz Interface with ongoing graphics class timer with lifeline\nand Scoreboard frame at last to show the result.\n∗ − − > Private-Messenger | Java, Apache Netbeans, Socket Programming, Multicasting\nMinor-2  Link\n  It is a simple chat application between a server and a client. The application is a desktop-based application and is\nimplemented using Swing and AWT. The project is developed in Java SE language and executed on a single stand-alone\njava across a network using the Loopback address concept.\n  It is a Desktop Based chatting application with the help of Java Swing to make the frame, Socket programming to\ntransfer messages from server and Client.\n  I tried to make frame, looks, working similar to whatsApp chatting window.\nWorkshops/Projects(Electrical)\nUAV(Hexacopter DRONE) | Multi-Rotor,APM 2.8 flight Controller, autopilot Software\nGD : Link\n  Weight-3.5kg, Rotor-8, Endurance-25min, Payload-2kg.\n  Sensors: Gyroscopes, Magnetometers, Accelerometer, GPS, Barometer Pressure Sensor, Compass, Lidar\n  Tasks with limited budgets, time and large area coverage with hard-to-reach places having difficult terrains can be\ncounter easily with UN-Manned Aerial Vehicles remote access control and safety of a pilot onboard.\nAUTO CAD ELECTRICAL | Indo Danish Tool Room(MSME), Jamshedpur\nCertificate : Link\n  Electrical computer-aided design (ECAD) software systems are used to design and develop electronic systems such as\nprinted circuit boards (PCBs) and integrated circuits (ICs).\n  ECAD software enables electrical engineers to create as well as modify diagrams and layouts including 2D and 3D\nmodels.",
    "certifications": null,
    "extra": null,
    "skills": "\nLanguages: Java, HTML/CSS, SQL, Matlab.\nDeveloper Tools: Apache Netbeans, Atom, BootStrap, Eclipse, Azure.\nTechnologies/Frameworks: Linux, GitHub, Bitbucket, WordPress."
}