{
    "name": "Surya Prabha",
    "email": "prabhagolthis@gmail.com",
    "phone": "+17658952747",
    "education": [
        {
            "university_name": "Shri Vishnu Engineering College",
            "course_name": "men",
            "dates_attended": "2019",
            "marks_or_percentage": "",
            "additional_info": [
                "for Wo,\nBhimavaram\n2014 – 2018\nCGPA: 7.51\nIntermediate (MPC) | Sri Chaitanya Jr. College, Bhimavaram\n2012 – 2014\nPercentage: 91.1\nSSC | Aditya English medium School, Bhimavaram\n2012\nGPA: 9.2\nSOFTWARE PROFICIENCY",
                "Decent Programming Knowledge in Python",
                "Good hands-on in writing SQL Queries and QA Testing",
                "Good knowledge in Agile methodology & JIRA",
                "Good Knowledge in MS Excel\nSKILLS",
                "Self-Motivated",
                "Good levels of Communication Skills",
                "Problem solving skills",
                "Good Team Player",
                "Hard Worker",
                "Competent\nPROJECT WORK\nSeismic Analysis & Design of (G+3) Building by using ETABS and STAAD.Pro\nDescription: The objective of our project is to conduct complete seismic analysis and designing\nof the main structural elements of multi-storey building such as Slabs, Beams, and Columns. The\nvarious structural elements of multi-storey building need to be designed taking the strength and\nstability factors into consideration. The building was designed by considering dead load and live\nload according to standards and by considering seismic force to ensure the safety and keeping\ncareful balance between economy and safety. Structural members of the project analyzed and\ndesigned by using the software’s like STAAD.Pro and E-Tabs. The building should sustain all the\nloads and deformation of normal construction and have adequate desirability and resistance to\nthe effects of seismic force.\nINDUSTRIAL VISITS",
                "An Industrial Visit to ceramic tiles factory near Mandavilli in 2015.",
                "A visit to the multi-purpose National project “Polavaram Project” on the Godavari River in\nthe West Godavari District and East Godavari District in Andhra Pradesh.",
                "Visited multiple paper industries in Andhra Pradesh.",
                "Specifically, I have a good knowledge in Effluent treatment plants in paper industries.\nACHIEVEMENTS & PARTICIPATIONS",
                "Student Coordinator for “MEDHA MILAN” (National Student Symposium for Women) at\nSVECW 2017.",
                "Volunteered for “Vishnu E-Moto Championship” at SVECW 2016.",
                "Participated in the event “WEALTH FROM WASTE” conducted by Eco friendly association at\nSVECW.",
                "Won in the event “Quiz” & “EXTEMPORE” conducted by ISTE STUDENT CHAPTER at SVECW.",
                "Participated in the event “INTERSTELLAR” conducted by Amateur Astronomy Association” at SVECW.",
                "Skilled in Basics of Music and Dance.\nLANGUAGES KNOWN",
                "English, Telugu, Hindi\nHOBBIES",
                "Reading books",
                "Yoga and Meditation",
                "Watching Movies and Shows",
                "Blogging",
                "Surfing Internet\nDECLARATION\n- I hereby declare that the information furnished above is true to the best of my knowledge.\nSurya Prabha, Golthi\n2"
            ]
        }
    ],
    "work_experience": null,
    "linkedin": "https://www.linkedin.com/in/prabha2997",
    "github": ""
}