{
    "name": "Tarun Sharma",
    "email": "tarunshrm768@gmail.com",
    "phone": "+18318919787",
    "education": [
        {
            "university_name": "United College",
            "course_name": "Management",
            "dates_attended": "",
            "marks_or_percentage": "",
            "additional_info": [
                "of Engineering & , Allahabad\n05/2015 – 03/2016\nPrayagraj, India\nSenior Secondary (XII) With ISC Board, \nMary Lucas School & College, Allahabad\n04/2013 – 03/2014\nPrayagraj, India\nSecondary (X) With ICSE Board, Mary Lucas School & College, Allahabad"
            ]
        }
    ],
    "work_experience": [],
    "linkedin": "",
    "github": "",
    "projects": "Airline, Admin Panel\nRoles and Responsibilities:\n•Led the development of an admin panel for an airline company using \nNodeJS, allowing staff to manage flight schedules, bookings, and customer \ninformation.\n•Develop new user-facing features using React.js.\n•Worked closely with the client to identify requirements and translate them \ninto functional specifications.\n•Designed and developed the application architecture, ensuring scalability, \nsecurity, and performance.\n•Developed backend code to handle complex queries and data manipulation, \nensuring efficient and secure data transfer.\n Task Management\nRoles and Responsibilities:\n•Designed and developed a web application from scratch using NodeJS and \nMongoDB to perform CRUD operations on a database.\n•Write well-designed, efficient, and testable code using React.js and related \nframeworks.\n•Implemented a user-friendly interface with HTML, CSS, and JavaScript that \nallowed users to add, view, edit, and delete data.\n•Wrote backend code to handle incoming requests and queries to the \ndatabase, ensuring secure and efficient data transfer.\n•Used Git for version control and collaborated with a team of developers to \nintegrate new features and fix issues.\n•Conducted thorough testing to ensure the application was robust and \nreliable.\n•Provided ongoing maintenance and support to ensure the application \nremained up-to-date and bug-free.\nREST API Integration\nRoles and Responsibilities:\n•Worked on a project that involved integrating a third-party REST API with a \nNode.js application.\n•Developed a custom module that made HTTP requests to the API, processed \nthe response data, and returned it to the application.\n•Implemented authentication and error handling to ensure secure and \nreliable API communication.\n•Technologies used included Node.js, Express.\n04/2020 – 08/2020\nRemote, India\nCoding Instructor, SkillSanta\n•Teaching coding concepts and programming languages to students of \nvarious skill levels.\n•Preparing and delivering lessons, assignments, and projects that are \nengaging, challenging, and informative.\n•Providing constructive feedback and guidance to students to help them \nimprove their coding skills.\n•Creating and updating curriculum materials and lesson plans based on \nindustry trends and feedback from students.\n•Collaborating with other instructors, staff members, and stakeholders to \nensure the program's success.\n•Courses are Java, Javascript, HTML, CSS, and Bootstrap, NodeJS.",
    "certifications": null,
    "extra": null,
    "skills": "Rest APIs\nCSS\nReact\nMongoDB\nHTML5\nMYSQL\nNode JS\nJavascript\nLanguages\nEnglish\nHindi\nProfessional Experience\n03/2021 – 03/2022\nPune, India\nProgrammer Analyst, Cognizant"
}