{
    "name": "Jaipur",
    "email": "sravya.undavalli11@gmail.com",
    "phone": "+19256906088",
    "education": [
        {
            "university_name": "Manipal University",
            "course_name": "mance",
            "dates_attended": "2017",
            "marks_or_percentage": "",
            "additional_info": [
                "Jaipur\nEnrolled in computer science and engineering with a strong academic \nperfor, maintaining a CGPA of 8.73. Anticipated completion of Program by \n2024.\n2020 – 2024\nJaipur, Rajasthan\nHigh school diploma\nSasi junior college\nCompleted intermediate education with a remarkable CGPA of 9.84. Specialized in \nMathematics, Physics, and Chemistry (MPC) subjects.\n2018 – 2020\nEluru\nSecondary school of education\nSasi English Medium school\nAchieved a perfect cumulative grade point average (CGPA) of 10.00\n2017 – 2018\nEluru, Andhrapradesh"
            ]
        }
    ],
    "work_experience": [],
    "linkedin": "",
    "github": "",
    "projects": "Monkey pox detection using Deep learning\nAccomplished deep learning professional in developing and implementing CNN image recognition models for \nmonkeypox virus detection. leveraging advanced convolutional neural networks to accurately identify and \nclassify monkeypox virus images, contributing to effective disease control strategies. Demonstrated expertise \nin image processing and delivering impactful results.\nBank loan status prediction using machine learning\nExperienced machine learning practitioner adept at utilizing random forest algorithms for bank loan status \nprediction. \nOnline library management system\nOnline library management system is a comprehensive web-based solution designed to streamline and \nautomate library operations. It enables efficient management of library resources, including book cataloging, \nuser management, borrowing and returning books, reservation management, fine calculation, and reporting. \nsoftware engineering project which includes Unified modelling language.\nWeather forecast using React\nWeather forecast application developed using React, providing users with real-time weather information and \nforecasts. The application leverages React's component-based architecture to deliver an interactive and \nresponsive user interface.\nSKILLS\nPython\nProficient in Python programming language, with experience in developing scalable and efficient \napplications. Skilled in utilizing Python libraries and frameworks for various purposes, data analysis (NumPy, \nPandas).\nMachine Learning\nStrong understanding of machine learning concepts and algorithms. Experience in developing and \nimplementing machine learning models for tasks such as classification, regression, and clustering. Familiarity \nwith popular machine learning libraries like TensorFlow.\nDeep Learning\nProficient in deep learning techniques and frameworks, with a strong understanding of neural networks and \ntheir architectures. Skilled in designing and training deep learning models for various tasks, such as image \nclassification, object detection, and natural language processing. Experienced in working with popular deep \nlearning libraries like TensorFlow. Convolutional Neural Networks In-depth knowledge of CNNs, a powerful \nclass of deep learning models widely used for computer vision tasks. Experienced in applying CNNs for tasks \nsuch as image recognition and feature extraction.\nWeb Development\nFront-End Development: Good front-end web development, with expertise in HTML, CSS, and JavaScript. \nSkilled in creating interactive and user-friendly web interfaces using modern web standards and best \npractices. \nJavaScript Frameworks/Libraries:  working with JavaScript frameworks and libraries such as React. \nBack-End Development: Familiarity with back-end development concepts and technologies, including server-\nside programming languages like Node.js.\nFlutter\nGood in Flutter, a cross-platform framework for building mobile applications. Android and iOS platforms \nusing Flutter's reactive UI framework. \nDart: knowledge of the Dart programming language, which is the primary language used for Flutter \ndevelopment.\nMySQL\nKnowledge of MySQL database management system, including database design, querying, and optimization.\nMicrosoft Azure Cloud\nFamiliarity with Microsoft Azure cloud platform and services.\nC Language\nPROFESSIONAL EXPERIENCE\nData Engineer Trainee Intern\nCelebal Technologies\n05/2023 – 07/2023\nJaipur, Rajasthan\nWorked on a team to develop and deploy cloud-based solutions using Azure Cloud \nplatform.\nImplemented and optimized database solutions using MySQL for efficient data \nstorage and retrieval.\nTroubleshot and resolved issues related to Azure Cloud services, MySQL database, \nand Python programming.\nWictrenship AI/ML Intern\nWictronix\nVadodra, Gujarat\nCollaborated with a team to gather and analyze data, identify patterns, and derive \nactionable insights.\nContributed to the evaluation and selection of appropriate algorithms and \ntechniques for various tasks.\nConducted experiments and performed model evaluation, optimization, and \nvalidation.\nDocumented findings, methodologies, and results in technical reports and \npresentations.\nKept up-to-date with the latest research and advancements in AI/ML, attending \nrelevant workshops or conferences.\nSales force virtual Internship program\nParticipated in a virtual internship program focused on Salesforce CRM (Customer \nRelationship Management) platform.\nDeveloped a solid understanding of Salesforce architecture, objects, and \ncustomization capabilities.\nParticipated in virtual training sessions and workshops to enhance knowledge of \nSalesforce best practices.\nCERTIFICATES\nDatabase Foundations, Oracle \nacademy\nCCNAv7: Introduction to \nNetworks, CISCO\nRed Hat System \nAdministration, Red Hat \nAcademy\nPYTHON Essentials 1, CISCO\nCCNAv7: Switching, Routing, \nand Wireless Essentials, \nCISCO\nThe Design and Analysis of \nAlgorithms, UDEMY\nAWARDS\nTMA PAI MERIT SCHOLARSHIP (Manipal University Jaipur)\nAwarded with one of the MUJ Scholarship Scheme of 50 percent Fee Reimbursement .\nLANGUAGES\nEnglish\nHindi\nTelugu\nCOURSES\nRelational data base management systems\nObject oriented programming language\nComputer Networks",
    "certifications": null,
    "extra": "content writing | Travel | Reading",
    "skills": "Excels in fast-paced environments and thrives on challenges that require creative thinking. Seeking an\nopportunity to apply academic knowledge and gain practical"
}