{
    "name": "Digitial Marketing",
    "email": "shivikaprakash2008@gmail.com",
    "phone": "",
    "education": [],
    "work_experience": [
        {
            "company_name": "The SEO Media                                                                                                                                      Dublin,Ireland",
            "job_title": "Part time (UX designer)",
            "dates_worked": "September 2021 – Present",
            "additional_info": [
                "●",
                "Generate reports on market analysis for the project I’m working on deriving features and define the",
                "usability testing and developing the prototyping, problems solving in the field of the UX research",
                "●",
                "Collaborate with senior management including marketing lead to solve problems related to the interaction",
                "design and make it more easy for the user to use the digital products and LinkedIn accounts, implementing",
                "posting schedules for popular content which increased followers to 100k+",
                "●",
                "Provide recommendations to enter a niche market for career tips, conducting market research on Qualtrics",
                "for 100+ infographics and video content on TikTok",
                "●",
                "Utilize CRM platforms including Customer Centric design approach and conducting surveys for the",
                "usability testing and to service clients daily, working with sales team to identify pain points and marketing",
                "opportunities for success stories",
                "Edelytics",
                "Delhi, India",
                "UX Designer (associate)                                                                                                     January 2020 -January 2021",
                "●",
                "Analyzed financial statements, business summary reports, and dashboard recaps to attain data based on",
                "product comparable percentages and penetration rates for district managers which increased store efficiency",
                "by 16%.",
                "●",
                "Collaborated with senior management on multiple functions including customer success and finance,",
                "increasing survey submissions from 60% previous month to 75% by identifying the pain points of customer",
                "feedback.",
                "●",
                "Created wireframes, prototyping, user flows, affinity mapping, card sorting and develop user experience",
                "with proven research with the help of surveys. Working on the design strategies and also work in the design",
                "system.",
                "Vrozart",
                "Delhi, India",
                "UX Designer (Junior)",
                "April 2019 – September 2020",
                "●",
                "Presented recommendations for seasonal sales, and develop the strategies of designs, solving problems that",
                "occurred in the website.",
                "●",
                "Reviewed data visualization charts and develop the better user experience with the help of the wordpress",
                "interface with the help of HTML,CSS and javascript, work with the front end developers",
                "●",
                "Maintained and built relationships with 10+ customers daily, providing exceptional customer service and",
                "efficient product deliveries daily which translated to a customer satisfaction rating score of 97%",
                "Stagkart",
                "Delhi, India",
                "UX Designer (Inter/Junior)                                                                                                April 2016 – September 2018",
                "●",
                "Worked in the area healthcare, ecommerce and developed the website with the HCI design.",
                "●",
                "Design the solutions for the digital product for the clients as well as the stakeholders, developing the",
                "workflows and improving the existing designs for the company.",
                "●",
                "Develop the high fidelity designs, low fidelity designs, user flows, empathise (mapping), and develop",
                "feedback."
            ]
        }
    ],
    "linkedin": "",
    "github": "",
    "projects": null,
    "certifications": null,
    "extra": "Association of Student body (Head of Student department)\nIndore, India\nDirector of student body\nApril 2011 – May 2015\n●\nPartner with 100+ professionals and recruiters in various firms and organizations, bringing out 10+\ncompanies including Deloitte, KPMG, Vanguard, and Kohl’s for our Professional Networking Dinner with\n150+ attendees.\n●\nSpearhead events for weekly meetings regarding resumes, cover letters, and LinkedIn workshops,\npresenting research in  RGPV region.\nSecond Harvest\nDublin, Ireland\nLeader of Techonology & design Society                                                                                  March 2022 – May 2022\n●\nCoordinated 3 events with team members regarding design challenges at local businesses, generating 50\nparticipants and help them compete with each other in the competitive manner.\n●\nProvided participants with the proper guidance on the technology and design, calling mentors (college\nalumni.",
    "skills": "Skills: Microsoft Office | Adobe photoshop | Adobe XD | Figma |  | CRM | Problem Solving skills | Prototyping |\nWireframing | Data Visualization\nInterests: Marketing & Operations, Public Speaking, Reading books,, Speaking at Universities, yoga"
}