{
    "name": "ML",
    "email": "dhage.vijay678@gmail.com",
    "phone": "",
    "skills": [
        ": Jira, Postman, Excel, Windows,",
        "Linux.",
        "Project understanding & Co-ordination",
        "Strong decision maker",
        "Quick Learner",
        "Adaptability",
        "Honest",
        "Domain : Finance",
        "In this project our aim is to find the claim made by insured is fraudulent or not. To find",
        "this we build a model with the help of Machine Learning technique which saves time",
        "and get information about fraud claim . So that the correct insured claim will get the",
        "money in less time and fraud claim will be caught easily and dismissed also.",
        "Roles and Responsibilities :",
        "PROJECT 3 : SENTIMENT ANALYSIS WITH ROOT CAUSE DETECTION",
        "Domain : Finance",
        "In this project our aim is to find that, if we give credit card to the customer then that",
        "customer  will refund all the money or not. On the basis of that client will decide to give",
        "the credit card to the customer.",
        "Roles and Responsibilities :",
        "E D U C A T I O N",
        "P R O F E S S I O N A L",
        "E X P E R I E N C E",
        "3+ Years of working experience with Bitwise",
        "as Machine Learning Engineer from April",
        "2020 till Date.",
        "BE (ENTC)| SSBT'S COET Bambhori, Jalgaon |",
        "2019 | 7.52",
        "HSC |Vishwabharati Niwasi Jr. College | 2015 |",
        "63.85%",
        "SSC| Gandhi Vidhlaya Parbhani | 2012 | 82.55%",
        "T E C H N I C A L  S K I L L S",
        "K E Y  S K I L L S",
        "P E R S O N A L  D E T A I L S",
        "DOB : 20 / 10 / 1996",
        "Marital Status : Single",
        "Hobbies : Travelling , Listening Music,",
        "Watching Movies.",
        "P R O J E C T",
        "PROJECT  1 :  FRAUDULENT INSURANCE CLAIM IDENTIFICATION.",
        "PROJECT 2 : CREDIT CARD DEFAULTER PREDICTION",
        "In this  project , we get the data of the sentiments of the customers on products of",
        "client and based on that sentiments we  try to find the reason behind the less sell of the",
        "product and build a model  which detect the bad sentiments and their  cause and help",
        "client to improve the services and increase sell.",
        "Roles and Responsibilities :",
        "P R O F E S S I O N A L  S U M M A R Y",
        "Help develop vision, business case, modelling and operational project plans for end-",
        "to-end ML solutions.",
        "Lead the development of data science/ML models for high business areas .",
        "Work on all stages of data science / ML project -exploration and conceptualization",
        "POC (Proof of concept), data preparation and model deployment.",
        "Lead the development of standard building blocks for usage across multiple ML",
        "algorithm.",
        "Create API's and deploy the model on cloud.",
        "To carryout pre-processing, cleaning of data and to verify integrity of data",
        "To visualize and analyse data with data visualization with various python libraries to",
        "get insights of available data",
        "To develop appropriate machine learning model using various algorithms so it can",
        "satisfy the requirements with better efficiency.",
        "To develop appropriate machine learning model using various algorithms so it can",
        "satisfy the requirements with better efficiency.",
        "To perform Tokenization and crating data frames by using Count vectorizer like Bag",
        "of words and TF-IDF Word2Vec. Feature extraction and feature selection.",
        "Coordinate with different functional teams to implement models and monitor",
        "outcomes.",
        "Develop processes and tools to monitor and analyse model performance and data",
        "accuracy."
    ],
    "education": [],
    "work_experience": [],
    "linkedin": "",
    "github": ""
}