{
    "name": "Yudoeo - Hyderabad",
    "email": "vishaljaiswal9551@gmail.com",
    "phone": "+919794363528",
    "education": null,
    "work_experience": [
        {
            "company_name": "FULL STACK DEVELOPER",
            "job_title": "Mentored other developers in best practices for front-end and back-end development, resulting in a more efficient",
            "dates_worked": "Jan, 2023 - April, 2023",
            "additional_info": [
                "Designed and implemented full stack features such as web push notifications, user uploads (using AWS S3), and",
                "APIs, improving platform functionality and user engagement.",
                "Worked closely with cross-functional teams to gather requirements and ensure alignment with business goals,",
                "resulting in a highly effective and user-friendly social media platform.",
                "Maintained a strong focus on software best practices, including agile development, continuous integration, and",
                "automated testing, ensuring high-quality code and timely delivery.",
                "FAWR - Chennai, India",
                "Led the development of a CRM application, which improved customer engagement and streamlined",
                "communication between sales, marketing, and customer support teams.",
                "Implemented the complete hiring pipeline of a HRM application, which saves 90% time of the respected HR.",
                "Planned, Designed, build, tested and deployed four applications."
            ]
        },
        {
            "company_name": "FULL STACK DEVELOPER",
            "job_title": "FRONTEND DEVELOPER",
            "dates_worked": "Jan, 2022 - Dec, 2022",
            "additional_info": [
                "and cohesive development team.",
                "|",
                "Yudoeo - Hyderabad, India",
                "|",
                "Feblic - HBTU, Kanpur, India",
                "May, 2021 - Dec, 2021"
            ]
        },
        {
            "company_name": "BDM",
            "job_title": "Designed and implemented key modules, including lead management, customer segmentation, sales",
            "dates_worked": "HACTOBERFEST (2021)",
            "additional_info": [
                "|",
                "Implemented feature for admin-only invitations of users with assigned roles to partner platforms (CRM,HRM,CMS)",
                "Successfully led the re-architecture of the BDM application's code, addressing numerous bugs and enhancing",
                "overall functionality.",
                "Managed the entire project, ensuring timely delivery and effective collaboration between team members.",
                "Implemented best practices for code development, resulting in improved code quality, maintainability, and",
                "scalability.",
                "CRM",
                "Contributed to the development of the CRM application, adding necessary features and functionality to meet",
                "business requirements.",
                "forecasting, dashboard overview, contacts management, marketing section (through ads, email and social",
                "media), campaign creation, deals management, invoice generation, task management. schedule meeting,",
                "improving overall performance and user experience.",
                "HRM",
                "Designed and Implemented the entire hiring pipeline within the HRM application, providing HRs with a",
                "streamlined process for generating offer letters for candidates.",
                "Developed a system that automatically generates offer letters based on a candidate's experience and job role,",
                "reducing the time and effort required to create individualized letters.",
                "Worked closely with HR teams to understand their requirements and ensure alignment with business goals,",
                "resulting in a highly effective and user-friendly HRM system.",
                "V I S H A L  J A I S W A L",
                "+91-9794363528",
                "vishaljaiswal9551@gmail.com",
                "Portfolio",
                "linkedIn",
                "A C H I E V E M E N T"
            ]
        },
        {
            "company_name": "IN OUR COLLEGE NEWS LETTER",
            "job_title": "",
            "dates_worked": "2014 - 2018",
            "additional_info": [
                "HACKATHON - INEURON AND",
                "GEEKYANTS",
                "CODECHEF(3*)",
                "MEMBER OF THE CORE WEB DEV TEAM",
                "IN THE COLLEGE",
                "3 TIMES MY ART-WORK GOT PUBLISHED",
                "E D U C A T I O N",
                "St. Peter Inter College",
                "SECONDARY SCHOOL",
                "Harcourt Butler Technical University",
                "BACHELOR OF TECHNOLOGY",
                "2019 - 2023",
                "L A N G U A G E S",
                "Full Professional",
                "Proficiency",
                "ENGLISH",
                "Full Professional",
                "Proficiency",
                "HINDI",
                "S K I L L S",
                "React, Node Js, Java, DBMS, Nginx, AWS, Redis, Next, TypeScript, HTML, CSS, Javascript, TailwindCss,  React Native"
            ]
        }
    ],
    "linkedin": "",
    "github": "",
    "projects": null,
    "certifications": null,
    "extra": null,
    "skills": "A B O U T  M E\nE X P E R I E N C E\nLed all the frontend initiatives at the company, collaborating with cross-functional teams to design and\nimplement web applications using modern front-end technologies such as React and Next with TypeScript.\nDeveloped and implemented APIs to improve data accessibility and enhance application functionality.\nAdded full stack features such as web push notifications and upload server (AWS S3).\nWorked closely with back-end developers to integrate APIs and ensure seamless data flow between the front-\nend and back-end systems.\nFeblic tries to solve the problem of high price in-app purchases(30%) in app stores of big tech giants like Google\napp and App store.\nLed all the frontend initiatives, collaborating with cross-functional teams to design and implement web\napplications, More about Feblic.\nP R O J E C T S\nDYLIT\nLed all frontend initiatives at the company, overseeing the development and implementation of user-facing\nfeatures to improve the platform's overall user"
}